import 'package:flutter/material.dart';

class dhara_242 extends StatefulWidget {
  const dhara_242({super.key});

  @override
  State<dhara_242> createState() => _dhara_242State();
}

class _dhara_242State extends State<dhara_242> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো সিকিউরিটিজের মালিক তাহার সিকিউরিটিজ বিক্রয় বা হ¯াÍ ন্তর করিবার পর পুনরায় তাহা ক্রয় বা অর্জন করেন, অথবা একই ধরনের সিকিউরিটিজ ক্রয় বা অর্জন করেন, এবং উক্তরূপ লেনদেনের ফলশ্রæতিতে মালিক কর্তৃক মূল সিকিউরিটিজের বিক্রয় বা হস্তান্তরের প্রেক্ষিতে প্রদেয় কোনো সুদ মালিক কর্তৃক প্রাপ্ত না হয়, সেইক্ষেত্রে পূর্বে উল্লিখিত প্রদেয় সুদ এই আইনের সকল উদ্দেশ্যপূরণকল্পে, অন্য কোনো ব্যক্তির আয় না হইয়া তাহা উক্ত মালিকের আয় হিসাবে গণ্য হইবে, পূর্বে উল্লিখিত প্রদেয় সুদের উপর এই উপ-ধারার বিধান ব্যতীত অন্য কোনোভাবে কর আরোপ হউক বা না হউক।\n(২) যেইক্ষেত্রে কোনো ব্যক্তির আয়বর্ষের কোনো সময়ের জন্য কোনো সিকিউরিটিজে লাভভোগী হইবার ¯া^ র্থ সংশ্লিষ্টতা থাকে এবং উক্ত বৎসরের মধ্যে এইরূপ সিকিউরিটিজ বা তাহা হইতে উদ্ভূত আয়ের লেনদেনের ফলশ্রæতিতে তৎকর্তৃক আয় গৃহীত হয় নাই অথবা আয় হিসাবে যেই পরিমাণ অর্থ তিনি গ্রহণ করেন, তাহা যদি উক্ত সিকিউরিটিজ হইতে উল্লিখিত সময়ের আনুপাতিক হারে দিনের পর দিন যে পরিমাণে পুঞ্জিভূত ও অংশানুপাতে জমাকৃত হইতে পারিত তাহা অপেক্ষা কম হয়, তবে সেইক্ষেত্রে উক্ত সময়ে এইরূপ সিকিউরিটিজ হইতে উদ্ভূত সমুদয় আয় উক্ত ব্যক্তির আয় হিসাবে গণ্য হইবে। \n (৩) যেইক্ষেত্রে আংশিক বা সম্পূর্ণ সিকিউরিটিজ লেনদেন সংক্রান্ত ব্যবসায় নিয়োজিত কোনো ব্যক্তি অন্য কোনো ব্যক্তির নিকট হইতে সিকিউরিটিজ ক্রয় বা অজর্ন করেন এবং উক্ত সিকিউরিটিজ উক্ত অপর ব্যক্তির নিকট পুনরায় বিক্রয় বা হস্তাšরÍ করেন অথবা তাহার নিকট একই ধরনের সিকিউরিটিজ বিক্রয় বা হস্তান্তর করেন এবং উক্ত লেনদেনের ফলশ্রæতিতে তৎকর্তৃক ক্রয়কৃত বা অর্জিত সিকিউরিটিজের জন্য প্রদেয় সুদ তিনি প্রাপ্য হওয়া সত্তে¡ও উক্ত আয় উপ-ধারা (১) এর বিধানাবলির কারণে তাহার আয় হিসাবে গণ্য হয় নাই, সেইক্ষেত্রে উক্ত লেনদেন সম্পর্কে এই আইনের যেকোনো উদ্দেশ্যপূরণকল্পে, কোনো ধরনের আয় গণনাকল্পে উক্তরূপ ব্যবসা হইতে উদ্ভূত কোনো আয় বা লোকসান বিবেচিত হইবে না। \n"
                "(৪) উপকর কমিশনার লিখিত নোটিশের মাধ্যমে, উক্ত নোটিশে উল্লিখিত সময়ের মধ্যে, যাহা ২৮ (আঠাশ) দিনের কম নহে, কোনো ব্যক্তিকে তাহার মালিকানাধীন সকল সিকিউরিটিজের বিবরণ বা নোটিশে বর্ণিত সময়ে যে সকল সিকিউরিটিজে এইরূপ ব্যক্তির সুবধিাভোগী হিসাবে স্বার্থ সংশিষ্টø তা ছিল, সেইরূপ সিকিউরিটিজের বর্ণনা দাখিলের জন্য এবং এই ধারার অন্যান্য উদ্দেশ্যে ও সিকিউরিটিজ বাবদ প্রাপ্ত সুদের কর সংক্রান্ত হিসাব চূড়ান্ত করিবার লক্ষ্যে উপকর কমিশনার যেইরূপ প্রয়োজনীয় বিবেচনা করেন সেইরূপ অন্যান্য তথ্যাদি সরবরাহ করিবার নোটিশ প্রদান করিতে পারিবেন। \n(৫) এই ধারার উদ্দেশ্য পূরণকল্পে,\n(ক)   “সুদ” বলিতে লভ্যাংশও অন্তর্ভুক্ত হইবে; এবং\n(খ) সংশ্লিষ্ট সিকিউরিটিজের মোট নামমাত্র মূল্য অথবা তাহা ধারণ করিবার ফরম বা হস্তান্তরের পদ্ধতিতে যে পার্থক্যই থাকুক না কেন, এইরূপ সিকিউরিটিজ বলিতে সকল সিকিউরিটিজকে বুঝানো হইবে, যাহা তাহার মালিককে একই ব্যক্তির সুদ ও মুনাফার ক্ষেত্রে একই প্রকার অধিকার প্রদান করিয়া এবং উক্ত অধিকার প্রতিষ্ঠার ক্ষেত্রে একইরূপ সুযোগ প্রদান করে। ব করিতে হইবে; এবং \n(খ) সেইরূপ কর এবং জরিমানা আদায়ের উদ্দেশ্যে খেলাপি করদাতা হিসাবে গণ্য করা হইবে এবং এইক্ষেত্রে এই আইনের সকল বিধান প্রযোজ্য হইবে।\n(৩) এই ধারার উদ্দেশ্যপূরণকল্পে, \n (ক) কোনো ব্যক্তির ক্ষেত্রে “অব্যাহতি সার্টিফিকেট” বলিতে সাটির্ িফকেটে উল্লিখিত এক বা একাধিকবার ভ্রমণের জন্য উক্ত ব্যক্তিকে কর পরিশোধ সার্টিফিকেট হইতে অব্যাহতি প্রদান করিবার উদ্দেশ্যে প্রদানকৃত সার্টিফিকেটকে বুঝাইবে; \n(খ) “মালিক” অথবা “চার্টারার” বলিতে কোনো জাহাজ বা বিমানের মালিক অথবা চার্টারার কর্তৃক উক্ত জাহাজ বা বিমানে ভ্রমণের অধিকার ইস্যু করিবার ক্ষমতাপ্রাপ্ত কোনো প্রতিনিধি, এজেন্ট অথবা কর্মচারীও অন্তর্ভুক্ত হইবে",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
