import 'package:flutter/material.dart';

class dhara_243 extends StatefulWidget {
  const dhara_243({super.key});

  @override
  State<dhara_243> createState() => _dhara_243State();
}

class _dhara_243State extends State<dhara_243> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "বাংলাদেশ ত্যাগকারী ব্যক্তির কর পরিশোধের সার্টিফিকেটের আবশ্যকতা",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) বোর্ড কর্তৃক এতদুদ্দেশ্যে নির্ধারিত ব্যতিক্রম ব্যতীত, যে ব্যক্তি বাংলাদেশে ডমিসাইল নন অথবা যে ব্যক্তি বাংলাদেশে ডমিসাইল কিন্তু বাংলাদেশ ত্যাগের সময় আয়কর কর্তৃপক্ষের অভিমত এইরূপ যে তিনি বাংলাদেশে ফিরিয়া আসিবেন না, সেইক্ষেত্রে বোর্ড কর্তৃক ক্ষমতাপ্রাপ্ত উপকর কমিশনারের নিকট হইতে এই মর্মে নিম্নবর্ণিত সার্টিফিকেট ছাড়া তিনি বাংলাদেশ ত্যাগ করিতে পারিবেন না, যথা:- (ক) কর পরিশোধের সার্টিফিকেট, বা\n (খ) তিনি বাংলাদেশে ফিরিয়া আসিতে ইচ্ছুক থাকিলে, একটি অব্যাহতি সার্টিফিকেট, যাহা কেবল তখনই ইস্যু করা যাইবে যখন উপকর কমিশনার এই মর্মে সন্তুষ্ট হন যে, সংশ্লিষ্ট ব্যক্তির এইরূপ ইচ্ছা আছে; এবং এইরূপ অব্যাহতি সার্টিফিকেট একবার ভ্রমণের ক্ষেত্রে বা সার্টিফিকেটে বর্ণিত সময়সীমার মধ্যে একাধিকবার ভ্রমণের ক্ষেত্রে, প্রদান করা যাইতে পারে।\n(২) কোনো বিমান বা জাহাজের মালিক অথবা চার্টারার উপ-ধারা (১) এর অধীন বর্ণিত কোনো ব্যক্তিকে যদি উক্ত উপ-ধারায় বর্ণিত সার্টিফিকেট ছাড়া সেইরূপ বিমান বা জাহাজ ভ্রমণের জন্য বাংলাদেশের যেকোনো স্থান হইতে বাংলাদেশের বাহিরে যেকোনো স্থানে ভ্রমণের অনুমতি দেন, সেইক্ষেত্রে উক্ত মালিক বা চার্টারারকে \n(ক) উপ-ধারা (১) এ বর্ণিত ব্যক্তির নিকট পাওনা কর বা তাহার নিকট পাওনা হইবে এবং তাহার দ্বারা প্রদেয় হইবে এইরূপ কর পরিশোধ করিতে হইবে এবং সর্বোচ্চ ২০ (বিশ) হাজার টাকা পর্যন্ত জরিমানা পরিশোধ করিতে হইবে; এবং \n(খ) সেইরূপ কর এবং জরিমানা আদায়ের উদ্দেশ্যে খেলাপি করদাতা হিসাবে গণ্য করা হইবে এবং এইক্ষেত্রে এই আইনের সকল বিধান প্রযোজ্য হইবে।\n(৩) এই ধারার উদ্দেশ্যপূরণকল্পে, \n (ক) কোনো ব্যক্তির ক্ষেত্রে “অব্যাহতি সার্টিফিকেট” বলিতে সাটির্ িফকেটে উল্লিখিত এক বা একাধিকবার ভ্রমণের জন্য উক্ত ব্যক্তিকে কর পরিশোধ সার্টিফিকেট হইতে অব্যাহতি প্রদান করিবার উদ্দেশ্যে প্রদানকৃত সার্টিফিকেটকে বুঝাইবে; \n(খ) “মালিক” অথবা “চার্টারার” বলিতে কোনো জাহাজ বা বিমানের মালিক অথবা চার্টারার কর্তৃক উক্ত জাহাজ বা বিমানে ভ্রমণের অধিকার ইস্যু করিবার ক্ষমতাপ্রাপ্ত কোনো প্রতিনিধি, এজেন্ট অথবা কর্মচারীও অন্তর্ভুক্ত হইবে; \n(গ) কোনো ব্যক্তির ক্ষেত্রে “কর পরিশোধ সার্টিফিকেট” বলিতে এই আইন অথবা দানকর আইন, ১৯৯০ (১৯৯০ সনের ৪৪ নং আইন) এর অধীন সংশ্লিষ্ট ব্যক্তির কোনো দায় নাই অথবা উক্ত ব্যক্তির সকল প্রকার কর পরিশোধের অথবা তাহার দ্বারা প্রদেয় বা প্রদেয় হইতে পারে এইরূপ যেকোনো প্রকার কর পরিশোধের উদ্দেশ্যে সন্তোষজনক ব্যবস্থা গৃহীত হইয়াছে মর্মে প্রদত্ত কোনো সাটির্ িফকেটকে বুঝাইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
