import 'package:flutter/material.dart';

class dhara_197 extends StatefulWidget {
  const dhara_197({super.key});

  @override
  State<dhara_197> createState() => _dhara_197State();
}

class _dhara_197State extends State<dhara_197> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কর নির্ধারণে সময়ের সীমাবদ্ধতা",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) উপ-ধারা (২) এবং (৩) এর বিধান সাপেক্ষে, নিম্নরূপ মেয়াদ উত্তীর্ণ হইবার পর-\n (ক)	ধারা ২৩৫ এর অধীন প্রণীত কর নির্ধারণের ক্ষেত্রে যে সংশ্লিষ্ট করবর্ষে উক্ত আয় প্রথমবার নিরূপণযোগ্য হইয়াছে তাহা সমাপ্তির ৩ (তিন) বৎসরের মধ্যে; অথবা\n (খ) 	ধারা ১৭১ অনুসারে নির্ধারিত সময়ে রিটার্ন দাখিল না করিবার ক্ষেত্রে যে করবর্ষে উক্ত আয় প্রথমবার নিরূপণযোগ্য হইয়াছে তাহা সমাপ্তির ১ (এক) বৎসরের মধ্যে\n(গ) 	দফা (ক) ও (খ)-তে বর্ণিত ক্ষেত্র ব্যতীত কর নির্ধারণ করিবার ক্ষেত্রে যে করবর্ষে উক্ত আয় প্রথমবার নিরূপণযোগ্য হইয়াছে তাহা সমাপ্তির ৬ (ছয়) মাসের মধ্যে।\n(২) ধারা ২১২ এর উপ-ধারা (১) এর অধীন নোটিশ জারি করা হইলে যে বৎসরে ধারা ২১২ এর অধীন নোটিশ জারি করা হইয়াছে তাহা সমাপ্তির ২ (দুই) বৎসরের মধ্যে কর নির্ধারণ করা যাইবে।\n(৩) এই ধারায় যাহা কিছুই থাকুক না কেন, যেকোনো ব্যবস্থা গ্রহণের সময় সীমিত হইবে, ধারা ২১৩, ২৮৫, ২৮৯, ২৯২, ২৯৪ বা ২৯৫ এর অধীন আদেশে প্রদত্ত পর্যবেক্ষণ বা নির্দেশনার ফলে বা তাহা কার্যকর করিতে করদাতা বা অন্য কোনো ব্যক্তির জন্য প্রণীত আদেশ বা কর নির্ধারণ, যাহাই হউক না কেন, বা ফার্মের ক্ষেত্রে ফার্মের জন্য প্রণীত কর নির্ধারণের ফলশ্রæতিতে ফার্মের অংশীদারের জন্য প্রণীত কর নির্ধারণ প্রণয়ন করিতে হইবে বা ধারা ৩০৪ এর অধীন উপনীত মতৈক্যের ভিত্তিতে প্রস্তুতকৃত চুক্তিপত্র, যেই তারিখে উক্ত আদেশ বা চুক্তিপত্র অবহিত করা হইয়াছে তাহার ৩০ (ত্রিশ) দিনের মধ্যে এবং এইরূপ সংশোধিত আদেশ পরবর্তী ৩০ (ত্রিশ) দিনের মধ্যে করদাতাকে অবহিত করিতে হইবে।\n(৪) যেইক্ষেত্রে কোনো কর্তৃপক্ষ কর্তৃক কর নির্ধারণী আদেশ নাকচ (ংবঃ ধংরফব) করা হয় সেইক্ষেত্রে যেই তারিখে উক্ত আদেশ অবহিত করা হয় সেই তারিখ হইতে ৬০ (ষাট) দিনের মধ্যে কর নির্ধারণ করিতে হইবে।\n (৫) যেইক্ষেত্রে ধারা ২১৩, ২৮৫, ২৮৯, ২৯২, ২৯৪ বা ২৯৫ এর অধীন কোনো আদেশের মাধ্যমে কোনো করবর্ষের জন্য করদাতার কোনো আয় মোট আয় হইতে বাদ দেওয়া হইলে অন্য কোনো করবর্ষের উক্ত আয়ের কর নির্ধারণ, এই ধারার উদ্দেশ্যপূরণকল্পে, সেই আদেশের অন্তর্গত কোনো সিদ্ধান্ত বা নির্দেশের ফলে, বা কার্যকর করিবার লক্ষ্যে, করা হইয়াছে বলিয়া গণ্য হইবে।\n(৬) যেইক্ষেত্রে ধারা ২১৩, ২৮৫, ২৮৯, ২৯২, ২৯৪ বা ২৯৫ এর অধীন কোনো আদেশের মাধ্যমে কোনো আয় কোনো ব্যক্তির মোট আয় হইতে বাদ দেওয়া হইয়াছে এবং তাহা অন্য ব্যক্তির আয় হিসাবে ধার্য হইয়াছে, সেইক্ষেত্রে, এই ধারার উদ্দেশ্যপূরণকল্পে, শেষোক্ত ব্যক্তির উক্তরূপ আয়ের কর নির্ধারণ উক্ত আদেশের সিদ্ধান্ত বা নির্দেশের ফলে বা তাহা কার্যকর করিবার লক্ষ্যে করা হইয়াছে মর্মে গণ্য হইবে।\n (৭) উপ-ধারা (৩) এ উল্লিখিত সময়সীমার মধ্যে উপকর কমিশনার উল্লিখিত কোনো আদেশ বা নির্দেশ প্রদানে ব্যর্থ হইলে উপকর কমিশনারের উক্তরূপ ব্যর্থতা অসদাচরণ মর্মে বিবেচিত হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
