import 'package:flutter/material.dart';

class dhara_244 extends StatefulWidget {
  const dhara_244({super.key});

  @override
  State<dhara_244> createState() => _dhara_244State();
}

class _dhara_244State extends State<dhara_244> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কর চুক্তি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) সরকার অন্য যেকোনো দেশের সরকারের সহিত নিম্নবর্ণিত বিষয়াদিতে চুক্তি সম্পাদন করিতে পারিবে, যথা :-\n (ক) নিম্নবর্ণিত বিষয়ে কর লাঘব সংক্রান্ত : \n(অ) এইরূপ আয় যাহার উপর এই আইন এবং অপর দেশে বলবৎ এইরূপ আইনের অধীন কর পরিশোধ করা হইয়াছে; অথবা \n(আ) পারস্পরিক অর্থনৈতিক সম্পর্ক, ব্যবসা ও বিনিয়োগে উৎসাহ প্রদানের উদ্দেশ্যে এই আইন এবং অপর দেশে বলবৎ এইরূপ আইনের অধীন আরোপযোগ্য কোনো কর; \n(খ) বাংলাদেশের অভ্যন্তরে ও বাহিরের উৎস হইতে আয় নির্ধারণ; \n(গ) এই আইন এবং অপর দেশে বলবৎ এইরূপ আইনের অধীন দ্বৈত কর পরিহার ও রাজস্ব ফাঁকি প্রতিরোধ \n (ঘ) এই আইন এবং অপর দেশে বলবৎ এইরূপ আইনের অধীন কর ফাঁকি অথবা পরিহার রোধে তথ্য বিনিময় অথবা উক্তরূপ ফাঁকি সম্পর্কিত মামলা তদন্ত;\n (ঙ) এই আইন এবং অপর দেশে বলবৎ এইরূপ আইনের অধীন কর উদ্ধার; এবং\n(চ) এই আইন এবং অপর দেশে বলবৎ এইরূপ আইনের যেকোনো উদ্দেশ্য পূরণকল্পে। \n(২) বোর্ড, সরকারি গেজেটে প্রজ্ঞাপন দ্বারা, কর চুক্তি বাস্তবায়নের জন্য প্রয়োজনীয় বিধানাবলি প্রণয়ন করিতে পারিবে। \n    (৩) উপ-ধারা (১) এর অধীন প্রণীত চুক্তিতে এই আইন অথবা এই চুক্তি প্রণয়নের পূর্বের যেকোনো সময়ের কর লাঘব সংক্রান্ত বিধানাবলি এবং যেসব আয় স্বয়ংক্রিয়ভাবে দ্বৈত করের আওতাভুক্ত নহে, তদ্রূপ আয় বিষয়ক বিধানাবলি অন্তর্ভুক্ত থাকতে পারিবে। \n (৪) যেইক্ষেত্রে এই ধারার অধীন সম্পাদিত চুক্তি অনুযায়ী সংশ্লিষ্ট কোনো দেশের আইনের অধীন প্রদেয় কর বাবদ বাংলাদেশে প্রদেয় করের বিপরীতে সমšয়^ মঞ্জুর করিবার কোনো বিধান অন্তর্ভুক্ত থাকে, সেইক্ষেত্রে এই অংশের দ্বিতীয় অধ্যায়ে উল্লিখিত বৈদেশিক কর সমন্বয় সম্পর্কিত বিধানাবলি কার্যকর হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
