import 'package:flutter/material.dart';

class dhara_2 extends StatefulWidget {
  const dhara_2({super.key});

  @override
  State<dhara_2> createState() => _dhara_2State();
}

class _dhara_2State extends State<dhara_2> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
          padding: const EdgeInsets.all(25),
        children: const [
              Center(
                child: Text(
                  "সংজ্ঞা",
                  style: TextStyle(fontSize: 25),
                ),
              ),
              SizedBox(height: 10),
              Text(
                "বিষয় বা প্রসঙ্গের পরিপন্থি কোনো কিছুনা থাকিলে, এই আইনে,"
                    "\n(১) “অবলোপিত মূল্য” অর্থ তৃতীয় তফসিলের অংশ ১ এ সংজ্ঞায়িতঅবলোপিত মূল্য;"
                    "\n(২) “অতিরিক্ত কর কমিশনার (আপিল)” অর্থ ধারা ৪ এ উল্লিখিত অতিরিক্ত কর কমিশনার (আপিল) এবং যুগ্ম কর কমিশনার (আপিল) ;"
                    "\n(৩) “অতিরিক্ত সহকারী কর কমিশনার” অর্থ ধারা ৪ এ উল্লিখিত অতিরিক্ত সহকারী কর কমিশনার;"
                    "\n(৪) “অনিবাসী” অর্থ নিবাসী নহেন এইরূপ কোনো ব্যক্তি; "
                    "\n(৫) “অনুমোদিত আনুতোষিক তহবিল” অর্থ দ্বিতীয় তফসিলের অংশ ২ এর বিধান অনুসারে বোর্ড কর্তৃক অনুমোদিত আনুতোষিক তহবিল ;"
                    "\n(৬) “অনুমোদিত বার্ধক্য তহবিল বা পেনশন তহবিল” অর্থ দ্বিতীয় তফসিলের অংশ ১ এর বিধান অনুসারে বোর্ড কর্তৃক অনুমোদিত কোনো বার্ধক্য তহবিল বা পেনশন তহবিল;"
                    "\n(৭) “অংশীদার” অর্থ Partnership Act, 1932 (Act No. IX of 1932) এ সংজ্ঞায়িত অর্থে কোনো অংশীদার এবং লভ্যাংশ গ্রহণের মাধ্যমে অংশীদার হিসাবে বিবেচিত কোনো নাবালকও ইহার অন্তর্ভুক্ত হইবে;"
                    "\n(৮) “অংশীদারিত্ব” অর্থ Partnership Act, 1932 (Act No. IX of 1932)  এ সংজ্ঞায়িত অর্থে অংশীদারিত্ব;"
                    "\n(৯) “আইনগত প্রতিনিধি” অর্থ  Code of Civil Procedure, 1908(Act No. V of 1908) এর section 2  এর clause (11)  এ সংজ্ঞায়িত কোনো আইনগত প্রতিনিধি;"
                    "\n(১০) “আত্মীয়” অর্থ কোনো ব্যক্তির ¯া^ মী বা স্ত্রী, ছেলে, মেয়ে, ভাই, বোন বা বংশানুক্রমিক পূর্বসূরি বা উত্তরসূরি ;"
                    "\n (১১) “আর্থিক প্রতিষ্ঠান” অর্থ আর্থিক প্রতিষ্ঠান আইন, ১৯৯৩ (১৯৯৩ সনের ২৭ নং আইন) এ সংজ্ঞায়িত আর্থিক প্রতিষ্ঠান;"
                    "\n(১২) “আপিল ট্রাইব্যুনাল” অর্থ ধারা ১৩ এর অধীন প্রতিষ্ঠিত কর আপিল ট্রা ইব্যুনাল;"
                    "\n(১৩) “আয়” অর্থে অšভÍর্ ুক্ত হইব্যে"
                    "\n(ক) এই আইনের কোনো বিধানের অধীন কর আরোপণযোগ্যযেকোনো উৎস হইতে উদ্ভূত আয়, প্রাপ্তি, মুনাফা বা অর্জন;"
                    "\n(খ) এই আইনের কোনো বিধানের অধীন উৎসে কর্তন বা সংগ্রহযোগ্য যেকোনো পরিমাণ অর্থ;"
                    "\n(গ) উপ-দফা (ক) তে উল্লিখিত আয়, মুনাফা বা অর্জন সংশ্লিষ্ট কোনো ক্ষতি;"
                    "\n (ঘ) চতুর্থ তফসিল এর ৮ নং অনুচ্ছেদ অনুসারে ধার্যকৃত মিউচুয়াল ইন্স্যুরেন্স অ্যাসোসিয়েশন কর্তৃক পরিচালিত কোনো বিমা ব্যবসা হইতে অর্জিত মুনাফা বা প্রাপ্তি;"
                    "\n (ঙ) এই আইনের যেকোনো বিধানের অধীন আয় হিসাবে গণ্য বা বিবেচিত যেকোনো অর্থ, অথবা বাংলাদেশে উদ্ভূত, সৃষ্টবা প্রাপ্ত যেকোনো আয় অথবা উপচিত, উদ্ভূত, সৃষ্ট বা প্রাপ্ত হিসাবে বিবেচিত যেকোনো অর্থ;"
                    "\n (চ) কর আরোপ করা হয় এইরূপ যেকোনো পরিমাণ অর্থ, পরিশোধ বা লেনদেন;"
                    "\n (১৪) “আয়কর” অর্থ এই আইনের অধীন আরোপযোগ্য বা পরিশোধযোগ্য যেকোনো প্রকারের কর বা সারচার্জ;"
                    "\n(১৫) “আয়বর্ষ” অর্থ করবর্ষের অব্যবহিত পূর্ববর্তী অর্থবৎসর এবং ইহার অšভÍ ক্ত হইবে\n(ক) কোনো ব্যবসা প্রথম শুরুর তারিখ হইতে পরবর্তী জুনমাসের ৩০ তারিখ পর্যন্ত সময় ;\n(খ) নূতনভাবে কোনো আয়ের উদ্ভব ঘটিলে যে তারিখ হইতেতাহা শুরু হইয়াছে সেই তারিখ হইতে শুরু করিয়া পরবর্তী জুন মাসের ৩০ তারিখ পর্যন্ত সময়;\n(গ) জুলাই মাসের প্রথম দিন হইতে শুরু করিয়া কোনোব্যবসা সমাপ্তির তারিখ বা, ক্ষেত্রমত, অনিগমিত কোনোসংস্থার বিলুপ্তি বা কোনো কোম্পানির অবসানের তারিখপর্যন্ত সময় ;\n (ঘ) জুলাই মাসের প্রথম দিন হইতে শুরু করিয়া অনিগমিতকোনো সংস্থার অংশীদারের অবসর বা মৃত্যুর তারিখপর্যন্ত সময়;\n (ঙ) অনিগমিত কোনো সংস্থার অংশীদারের অবসর বা মৃত্যুরতারিখের অব্যবহিত পরবর্তী তারিখ হইতে উক্তঅনিগমিত সংস্থার অপর কোনো অংশীদারের অবসর বামৃত্যুর তারিখ বা, ক্ষেত্রমত, উক্ত অবসর বা মৃত্যুরতারিখের অব্যবহিত পরবর্তী জুন মাসের ৩০ তারিখ;\n (চ) কোনো ব্যাংক, বিমা বা আর্থিক প্রতিষ্ঠান বা উহার কোনো সহযোগী সংগঠনের ক্ষেত্রে, সংশ্লিষ্ট বৎসরের জানুয়ারিমাসের প্রথম দিন হইতে শুরু করিয়া পরবর্তী ১২ (বারো)মাস:তবে শর্ত থাকে যে, বাংলাদেশের বাহিরে নিগমিতকোনো মূল কোম্পানির সহযোগী কোম্পানি, সহযোগীকোম্পানির সহযোগী কোম্পানিসহ, বা উহার কোনোহোল্ডিং কোম্পানি বা উহার কোনো ব্রাঞ্চ, রিপ্রেজেন্টেটিভবা লিয়াজোঁ অফিসের ক্ষেত্রে, যদি উক্তরূপ কোম্পানিউহার হিসাব মূল কোম্পানির হিসাবের সহিত সমন্বয়করিবার উদ্দেশ্যে ভিন্ন কোনো আয়বর্ষ অনুসরণ করিবারঅভিপ্রায় ব্যক্ত করে, তাহা হইলে, উপকর কমিশনারেরঅনুমোদনক্রমে, পৃথক কোনো ১২ (বারো) মাস আয়বরষ হিসাবে গণ্য হইতে পারিবে;"
                    "\n(১৬) “আয়ের উপর প্রদেয় কর” অর্থ এই আইনের অধীন আয়ের ভিত্তিতে আরোপযোগ্য বা পরিশোধযোগ্য অর্থ:"
                    "\n(১৭) “উপকর কমিশনার” অর্থ ধারা ৪ এ উল্লিখিত উপকর কমিশনার হিসাবেনিযুক্ত কোনো ব্যক্তি, এবং ট্রান্সফার প্রাইসিং অফিসার, সহকারী কর কমিশনার, অতিরিক্ত সহকারী কর কমিশনার ও ট্যাক্স রিকোভারি অফিসার ও ইহার অন্তভুক্ত হইবে;র্ "
                    "\n(১৮) “একীভূতকরণ ( সবৎমবৎ)” অর্থ অষ্টম তফসিলে সংজ্ঞায়িত একীভূতকরণ;"
                    "\n(১৯) “কমিশনার” অর্থ ধারা ৪ এ উল্লিখিত কর কমিশনার বা কর কমিশনার (বৃহৎ করদাতা ইউনিট);"
                    "\n(২০) “কমিশনার (আপিল)” অর্থ ধারা ৪ এ উল্লিখিত কর কমিশনার (আপিল); "
                    "\n(২১) “কর” অর্থ আয়ের উপর প্রদেয় কর, এবং যেকোনো অতিরিক্ত কর, অতিরিক্ত মুনাফা কর, দÐ কর, সুপার কর, জরিমানা, সুদ, ফি অথবা এই আইনের অধীন অন্যবিধ আরোপযোগ্য বা পরিশোধযোগ্য অর্থও ইহার অন্তর্ভুক্ত হইবে;"
                    "\n(২২) “করদাতা” অর্থ করারোপযোগ্য অর্থ উপার্জনকারী কোনো ব্যক্তি এবং নিমবœ র্ণিত ব্যক্তিগণও ইহার অন্তর্ভুক্ত হইবেন, যথা:\n (ক) এই আইনের অধীন কোনো কর বা অন্য কোনো অর্থ পরিশোধে বাধ্য কোনো ব্যক্তি;\n(খ) এইরূপ প্রত্যেক ব্যক্তিÑÑ (অ) যাহার আয়, অথবা যাহার আয়ের সহিত অন্য কোনো ব্যক্তির আয় নির্ধারণযোগ্য; অথবা (আ) যাহার বা অপর ব্যক্তির প্রাপ্য পাওনা নির্ধারণের জন্য এই আইনের অধীন কার্যক্রম গৃহীত হইয়াছে;\n(গ) যাহাকে ন্যূনতম কর পরিশোধ করিতে হইবে;\n(ঘ) কোনো রিটার্ন, দলিল বা বিবরণী দাখিলে বা তথ্য প্রদানে বাধ্য কোনো ব্যক্তি;\n (ঙ) কর নির্ধারণে ইচ্ছুক এবং রিটার্ন দাখিলকারী কোনো ব্যক্তি;\n(চ) এই আইনের কোনো বিধানের অধীন করদাতা বা খেলাপি করদাতা হিসাবে গণ্য কোনো ব্যক্তি;\n(ছ) যাহার বিরুদ্ধে এই আইনের অধীন কোনো কার্যধারা গ্রহণ করা হইয়াছে;"
                    "\n(২৩) “করদিবস” অর্থ- \n (ক) কোম্পানি ব্যতীত কোনো করদাতার ক্ষেত্রে, আয়বর্ষ সমাপ্তির পরবর্তী নভেম্বর মাসের ৩০ (ত্রিশ) তম দিন; কোম্পানির ক্ষেত্রে, আয়বর্ষ সমাপ্তির পরবর্তী সপ্তম মাসের ১৫ (পনেরো) তম দিন অথবা যেইক্ষেত্রে উক্ত\n (খ) পনেরোতম দিন সেপ্টেম্বর মাসের ১৫ (পনেরো) তম দিনের পূর্বের তারিখে পড়ে, সেইক্ষেত্রে আয়বর্ষ সমাপ্তির পরবর্তী সেপ্টেম্বর মাসের পনেরোতম দিন;\n(গ) পূর্বে কখনোই রিটার্ন দাখিল করেন নাই এইরূপ ¯া^ ভাবিকব্যক্তি করদাতার ক্ষেত্রে আয়বর্ষ শেষ হইবার পরবর্তী ৩০জুন তারিখ;\n (ঘ) বিদেশে অবস্থানরত কোনো ¯া^ ভাবিক ব্যক্তি করদাতারক্ষেত্রে, তার বাংলাদেশে প্রত্যাবর্তনের দিন হইতে ৯০(নব্বই) তম দিন, যদি উক্তরূপ ব্যক্তি (অ) উচ্চ শিক্ষার জন্য ছুটিতে অথবা চাকরির জন্য প্রেষণে বা লিয়েনে নিযুক্ত হইয়া বাংলাদেশের বাহিরে অবস্থান করেন; বা (আ) অর্থ উপার্জনের উদ্দেশ্যে বৈধ ভিসা এবং পারমিটধারী হয়ে অবস্থান করেন; বাংলাদেশে বাহিরে\n(ঙ) যদি উপ-দফা (ক) ও (খ) তে উল্লিখিত দিন সরকারি ছুটির দিন হয়, তাহা হইলে উক্ত দিনের অব্যবহিত পরবর্তী কর্মদিবস;                                                                                                            "
                    "\n(২৪) “করবর্ষ” অর্থ প্রত্যেক বৎসর জুলাই মাসের প্রথম দিন হইতে শুরু করিয়া ১২ (বারো) মাস মেয়াদ এবং এই আইনের বিধানাবলির অধীন করবর্ষ হিসাবে গণ্য কোনো মেয়াদও ইহার অšভÍ ক্ত হইবে;র্ ু"
                    "\n(২৫) “কর্মচারী” অর্থ কোনো কোম্পানির ক্ষেত্রে, অর্থ ব্যবস্থাপনা পরিচালক বা অন্য যেকোনো পরিচালক ও এইরূপ কোনো ব্যক্তি এবং ইহার অন্তর্ভুক্ত হইবেন, পদবি নির্বিশেষে কোম্পানির ব্যবস্থাপনার সহিত সম্পর্কিত কোনো দায়িত্ব পালন করেন;"
                    "\n(২৬) “কর অব্যাহতি” অর্থ কোনো ব্যক্তিকে নিম্নবর্ণিত সুবিধা প্রদানের মাধ্যমে এই আইনের অধীন উদ্ভূত কোনো করদায় হইতে আংশিক বা সম্পূর্ণ মুক্ত করা, যথা:-\n(ক) রেয়াত, অবকাশ, অব্যাহতি \n(খ) হ্রাসকৃত হারে কর পরিশোধ; বা\n(গ) মোট আয় পরিগণনা হইতে কোনো আয় বাদ দেয়া;"
                    "\n(২৭) “করমুক্ত সীমা” অর্থ মোট আয়ের কোনো সীমা যাহা শূন্য করহার বিশিষ্ট; "
                    "\n(২৮) “করারোপিত লভ্যাংশ” অর্থ সেই লভ্যাংশ আয় যাহার উপর ইতোমধ্যে এই আইনের অধীন আয়কর পরিশোধ করা হইয়াছে;"
                    "\n (২৯) “কস্ট এন্ড ম্যানেজমেন্ট অ্যাকাউন্টেন্ট” অর্থ কস্ট এন্ড ম্যানেজমেন্ট অ্যাকাউন্টেন্টস্ আইন, ২০১৮ (২০১৮ সনের ৭০ নং আইন) এ সংজ্ঞায়িত কোনো কস্ট এন্ড ম্যানেজমেন্ট অ্যাকাউন্টেন্ট;"
                    "\n(৩০) “কারিগরি সেবার ফি” অর্থ ব্যবস্থাপনা, কারিগরি বা পরামশর্ক সেবা প্রদানের মাধ্যমে প্রাপ্ত প্রতিদান, এককালীন প্রাপ্ত প্রতিদানসহ, এবং কোনো কারিগরি বা অন্য কোনো পেশাজীবীর সেবাও ইহার অন্তর্ভুক্ত হইবে, তবে নিম্নবর্ণিত বিষয়াদি ইহার অন্তর্ভুক্ত হইবে না, যথা:-\n(ক) প্রতিদান গ্রহীতা কর্তৃক গৃহীত কোনো নির্মাণ কাৰ্য, যন্ত্রাদি জোড়া প্রদানের কার্য, খনি বিষয়ক কার্য বা এইরূপ বিষয় সংক্রান্ত প্রকল্প হইতে প্রাপ্য প্রতিদান ; অথবা\n(খ) প্রতিদান গ্রহীতার “চাকরি হইতে আয়” আয় হিসাবে শ্রেণিবিন্যাসযোগ্য কোনো প্রতিদা"
                    "\n(৩১) “কোম্পানি” অর্থ কোম্পানী আইন, ১৯৯৪ (১৯৯৪ সনের ১৮ নং আইন) এ সংজ্ঞায়িত অর্থে কোনো কোম্পানি, এবং ইহার অন্তর্ভুক্ত হইবে-\n (ক) বিদেশি কোনো প্রতিষ্ঠানের লিয়াজোঁ অফিস, রিপ্রেজেন্টেটিভ অফিসবা ব্রাঞ্চ অফিস;\n(খ) যেকোনো বিদেশি সত্তা বা ব্যক্তির স্থায়ী কোনো প্রতিষ্ঠান;\n (গ) বাংলাদেশের বাহিরের কোনো দেশের আইন দ্বারা বা আইনের অধীননিবন্ধিত কোনো সংঘ বা সংস্থা;\n  (ঘ) যেকোনো ব্যাংক, বিমা বা আর্থিক প্রতিষ্ঠান;\n (ঙ) যেকোনো শিল্প ও বাণিজ্য সংগঠন, ফাউন্ডেশন, সমিতি, সমবায় সমিতি এবং যেকোনো শিক্ষা প্রতিষ্ঠান;\n (চ) এনজিও বিষয়ক ব্যুরো বা মাইক্রোক্রেডিট রেগুলেটরী অথরিটিরসহিত নিবন্ধিত কোনো প্রতিষ্ঠান :\n(ছ) কোনো ফার্ম, ব্যক্তিসংঘ, জয়েন্ট ভেঞ্চার বা ব্যক্তিবর্গের সংগঠন, উহা যে নামেই অভিহিত হউক না কেন, যদি উক্তরূপ ব্যক্তিবর্গের কেহ কোম্পানী আইন, ১৯৯৪ (১৯৯৪ সনের ১৮ নং আইন) এ সংজ্ঞায়িত অর্থে কোনো কোম্পানি বা বিদেশি সত্তা হয়;\n (জ) সংবিধিবদ্ধ সরকারি কর্তৃপক্ষ, স্থানীয় কর্তৃপক্ষ, স্বায়ত্তশাসিত সংস্থা; আপাতত বলবৎ কোনো আইন দ্বারা বা আইনের অধীন\n(ঝ) প্রতিষ্ঠিত বা গঠিত যেকোনো সত্ত¡া;\n (ঞ) স্বাভাবিক ব্যক্তি, ফার্ম, ব্যক্তিসংঘ, ট্রাস্ট, হিন্দু অবিভক্ত পরিবার ও তহবিল ব্যতীত অন্য সকল সত্ত¡া;\n (ট) কোনো আইন দ্বারা বা আইনের অধীন নিগমিত নহে, এইরূপ কোনো বিদেশি সংঘ বা সংস্থা যাহা, বোর্ড কর্তৃক, সাধারণ বা বিশেষ আদেশ দ্বারা, এই আইনের উদ্দেশ্য পূরণকল্পে কোম্পানি হিসাবে ঘোষিত হইতে পারে;"
                    "\n(৩২) “খেলাপি করদাতা” অর্থ\n(ক) কোনো ব্যক্তি যিনি এই আইনানুযায়ী কোনো কর পরিশোধে ব্যর্থ হইয়াছেন; বা \n(খ) কোনো ব্যক্তি যিনি এই আইনানুযায়ী খেলাপি করদাতা হিসাবে গণ্য হইয়াছেন;"
                    "\n(৩৩) “গবেষণা ও উন্নয়ন” অর্থ প্রণালিবদ্ধ (ংুংঃবসধঃরপ), অনুসন্ধানী (রহাবংঃরমধঃরাব) এবং পরীক্ষামূলক (বীঢ়বৎরসবহঃধষ) অধ্যয়ন যাহা\n(ক) অভিনব অথবা কারিগরি ঝুঁকি সংবলিত হইতে হইবে;\n (খ) বিজ্ঞান বা প্রযুক্তি জগতের হইতে হইবে;\n (গ) নূতন জ্ঞান অর্জনের লক্ষ্যে পরিচালিত হইতে হইবে; অথবা\n (ঘ) উৎপাদন অথবা উপকরণ, যš,¿ পণ্য, কৃষিপণ্য বা প্রক্রিয়ার উন্নয়নের লক্ষ্যে অধ্যয়নের ফলাফল ব্যবহারের উদ্দেশ্যে পরিচালিত হইতে হইবে, তবে নিম্নবর্ণিত লক্ষ্যে পরিচালিত অধ্যয়ন গবেষণা বা উন্নয়ন অর্থে অন্তর্ভুক্ত হইবে না, যথা:- (অ) উপকরণ, যন্ত্র বা পণ্যের মান নিয়ন্ত্রণ বা রুটিন টেস্টিং; (আ) শিল্পকলা ও মানবতা এবং সামাজিক বিজ্ঞানে পরিচালিত গবেষণা; (ই) আর্থিক দলিলাদি বা আর্থিক পণ্যের সৃষ্টি ও উন্নয়ন; (ঈ) বাজার গবেষণা বা বিক্রয় প্রচার, রুটিন উপাত্ত (ফধঃধ) সংগ্রহ, ইফিসিয়েন্সি সার্ভে বা ব্যবস্থাপনা অধ্যয়ন; (উ) উপকরণ, যন্ত্র, পণ্য, প্রক্রিয়া বা উৎপাদন পদ্ধতির রুটিন অদলবদল বা পরিবর্তন; (ঊ) উপকরণ, যন্ত্র, পণ্য, প্রক্রিয়া বা উৎপাদন পদ্ধতির সামান্য (পড়ংসবঃরপ) অদলবদল বা স্টাইলের পরিবর্তন; বা (ঋ) ট্রেডমার্ক বা সুনাম সৃষ্টি বা উন্নতি;"
                    "\n(৩৪) “গণকর্মচারী” অর্থ Penal Code, 1860 (Act No. XLV of 1860) Gi section 21 এ সংজ্ঞায়িত অর্থে কোনো গণকর্মচারী;"
                    "\n(৩৫) “চাকরি” অর্থে অন্তর্ভুক্ত হইবে-\n(ক) কোনো পদ যাহাতে নিযুক্ত ব্যক্তি নির্ধারিত বা, সময় সময়, নির্ধারিতব্য পারিশ্রমিক প্রাপ্তির অধিকারী; \n (খ) কোনো পরিচালক পদ বা কোম্পানির ব্যবস্থাপনার সহিত সংশ্লিষ্টকোনো পদ;\n(গ) সরকারি অফিসের কোনো পদের দায়িত্বে থাকা বা কার্য করা;"
                    "\n(৩৬) “চার্টার্ড অ্যাকাউন্টেন্ট” অর্থ Bangladesh Chartered Accountants Order, 1973 (President's Order No. 2 of 1973)  এ সংজ্ঞায়িত কোনো চার্টার্ড অ্যাকাউন্টেন্ট;"
                    "\n(৩৭) ‘‘ট্রেডিং অ্যাকাউন্ট” বা “প্রফিট এন্ড লস অ্যাকাউন্ট” অর্থে International Financial Reporting Standards (IFRS)  এর আওতায় প্রস্তুতকৃত আয় বিবরণী এবং হিসাব সংক্রান্ত অন্যান্য সমরূপ বিবরণীও ইহার অন্তভুক্ত হইবে;"
                    "\n(৩৮) “ট্রাস্ট” অর্থ Trust Act, 1882 (Act No. II of 1882) এর অধীন গঠিত ট্রাস্ট এবং Specific Relief Act, 1877 (Act No. II of 1877)এ সংজ্ঞায়িত ট্রাস্টও ইহার অন্তর্ভুক্ত হইবে: তবে শর্ত থাকে যে, যেইক্ষেত্রে ট্রাস্ট কোনো কোম্পানি বা তহবিল গঠনের পূর্বশর্ত অথবা কোম্পানি বা তহবিল পরিচালনার উদ্দেশ্যে গঠিত হইয়া থাকে সেইক্ষেত্রে উক্ত কোম্পানি বা, ক্ষেত্রমত, তহবিল করযোগ্য সত্ত¡া হইবে এবং ট্রাস্ট করযোগ্য সত্ত¡া হিসাবে বিবেচিত হইবে না; তবে শর্ত থাকে যে, যেইক্ষেত্রে ট্রাস্ট কোনো কোম্পানি বা তহবিল গঠনের পূর্বশর্ত অথবা কোম্পানি বা তহবিল পরিচালনার উদ্দেশ্যে গঠিত হইয়া থাকে সেইক্ষেত্রে উক্ত কোম্পানি বা, ক্ষেত্রমত, তহবিল করযোগ্য সত্ত¡া হইবে এবং ট্রাস্ট করযোগ্য সত্ত¡া হিসাবে বিবেচিত হইবে না; "
                    "\n(৩৯) “ট্যাক্স রিকোভারি অফিসার” অর্থ ধারা ৪ এ উল্লিখিত ট্যাক্স রিকোভারি অফিসার হিসাবে নিযুক্ত কোনো ব্যক্তি; "
                    "\n(৪০) “ডিমার্জার” অর্থ অষ্টম তফসিলে সংজ্ঞায়িত ডিমার্জার;"
                    "\n(৪১) “তফসিলি ব্যাংক” অর্থ Bangladesh Bank Order, 1972 (President's Order No. 127 of 1972)  এর article 2 (j)  - তে সংজ্ঞায়িত কোনো তফসিলি ব্যাংক; "
                    "\n(৪২) “তহবিল” অর্থ আপাতত বলবৎ কোনো আইন বা বিধির অধীন সৃষ্ট বা স্বীকৃত কোনো তহবিল;"
                    "\n  (৪৩) “দাতব্য উদ্দেশ্য” অর্থ \n(ক) দরিদ্রের জন্য ত্রাণ, শিক্ষা ত্রাণ, চিকিৎসা ত্রাণ; এবং \n(খ) সাধারণ জন-উপযোগের কোনো উদ্দেশ্যের উন্নতি বা প্রসার, তবে সাধারণ জন-উপযোগের কোনো উদ্দেশ্যের উন্নতি বা প্রসার দাতব্য উদ্দেশ্য বলিয়া বিবেচিত হইবে না- \n (অ) যদি না উহা জাতীয় রাজস্ব বোর্ড কর্তৃক অনুমোদিত হয়; এবং \n(আ) যদি উহা নিম্নবর্ণিত কোনো কর্মকাÐে জড়িত হয়- \n(১) কারবার, বাণিজ্য বা ব্যবসায় প্রকৃতির কোনো কার্যক্রম উহা যেকোনো ধরনের বা প্রকারের হউক না কেন; অথবা \n(২) পণের বিনিময়ে কোনো সেবা প্রদান করিলে এবংকোনো আয়বর্ষে এইরূপ পণের মোট মূল্য ২০(বিশ) লক্ষ টাকা অতিক্রম করিলে; "
                    "\n (৪৪) “ধারকৃত অর্থ” অর্থে ব্যাংক কোম্পানির ক্ষেত্রে জমার মাধ্যমে গৃহীত অর্থও অন্তর্ভুক্ত হইবে; "
                    "\n (৪৫) “নিবাসী” অর্থ কোনো আয়বর্ষে \n(ক) এইরূপ কোনো ব্যক্তি যিনি নিম্নবর্ণিত সময়ব্যাপী বাংলাদেশে অবস্থান করিয়াছেন- \n(অ) ধারাবাহিকভাবে অথবা উক্ত বর্ষে সমষ্টিগতভাবে ন্যূনতম ১৮৩ (একশত তিরাশি) বা ততোধিক দিন; বা \n(আ) উক্ত বর্ষে ধারাবাহিকভাবে বা সমষ্টিগতভাবে সর্বমোট ৯০ (নব্বই) দিন বা ততোধিক দিন এবং অব্যবহিত পূর্ববর্তী ৪ (চার) বৎসরের মধ্যে ধারাবাহিকভাবে অথবা সমষ্টিগতভাবে মোট ৩৬৫ (তিনশত পঁয়ষট্টি) অথবা ততোধিক দিন; \n(খ) কোনো হিন্দুঅবিভক্ত পরিবার, ফার্ম বা ব্যক্তিসংঘ যাহার নিয়šণ¿ ও ব্যবস্থাপনা কার্যাদি সম্পূর্ণরূপে উক্ত বর্ষে বাংলাদেশের অভ্যন্তরে সংঘটিত হইয়াছে;\n(গ) কোনো বাংলাদেশি কোম্পানি বা অন্য কোনো কোম্পানি যাহার নিয়ন্ত্রণ ও ব্যবস্থাপনা কার্যাদি সম্পূর্ণরূপে উক্ত বর্ষে বাংলাদেশের অভ্যন্তর হইতে সংঘটিত হইয়াছে; এবং\n(ঘ) কোনো ট্রাস্ট, তহবিল, সত্ত¡া বা আইনের দ্বারা সৃষ্ট কৃত্রিম ব্যক্তিসত্তা যাহাদের সৃষ্টি বাংলাদেশে বলবৎ কোনো আইনের অধীন হইয়াছে বা যাহার নিয়ন্ত্রণ ও ব্যবস্থাপনা কার্যাদি সম্পূর্ণরূপে উক্ত বর্ষে বাংলাদেশের অভ্যন্তরে সংঘটিত হইয়াছে; "
                    "\n(৪৬) “নির্ধারিত” অর্থ বিধি দ্বারা নির্ধারিত;"
                    "\n(৪৭) “নিয়োগকর্তা” অর্থে প্রাক্তন নিয়োগকর্তাও অন্তর্ভুক্ত হইবে; "
                    "\n(৪৮) “ন্যায্য বাজার মূল্য” অর্থ বোর্ড কর্তৃক নির্ধারিত মূল্য;"
                    "\n(৪৯) “পণ্য” অর্থ সিকিউরিটিজ ও অর্থ ব্যতীত সকল প্রকার দৃশ্যমান অস্থাবর সম্পত্তি; "
                    "\n (৫০) “পণ্য সরবরাহ” অর্থ\n(ক) পণ্যের বিক্রয়, বিনিময় বা অন্যবিধভাবে পণ্যের অধিকার হস্তাšরÍ ; বা \n (খ) লিজ, ভাড়া, কিস্তি বা অন্য কোনোভাবে পণ্যে ব্যবহারের অধিকার প্রদান এবং ফাইন্যান্স লিজের অধীন পণ্য বিক্রয় ও উহার অন্তর্ভুক্ত হইবে; "
                    ""
                    ""
                    ""
                    ""
                    ""
                    ""
                    " ",

                style: TextStyle(fontSize: 15),
              )
            ],
          ),
    );
  }
}