import 'package:flutter/material.dart';

class dhara_236 extends StatefulWidget {
  const dhara_236({super.key});

  @override
  State<dhara_236> createState() => _dhara_236State();
}

class _dhara_236State extends State<dhara_236> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " ট্রা ন্সফার প্রাইসিং কর্মচারীর নিকট প্রেরণ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) ধারা ২৩৫ এই যাহা কিছুই থাকুক না কেন, \n(ক) বোর্ডের পূর্বানুমোদন সাপেক্ষে উপকর কমিশনার ধারা ২৩৫ এর অধীন আর্মস লেংথ প্রাইস নির্ধারণের বিষয়টি ট্রান্সফার প্রাইসিং কর্মচারীর কাছে প্রেরণ করিতে পারিবেন; \n (খ) বোর্ডের পূর্বানুমোদন সাপেক্ষে ট্রান্সফার প্রাইসিং কর্মকর্তা কোনো আন্তর্জাতিক লেনদেনের আর্মস লেংথ প্রাইস নির্ধারণের কার্যক্রম শুরু করিতে পারিবেন। \n (২) যেইক্ষেত্রে উপ-ধারা (১) এর অধীন কোনো রেফারেন্স অথবা কোনো কার্যক্রম গ্রহণ করা হইবে, সেইক্ষেত্রে ট্রান্সফার প্রাইসিং কর্মকর্তা করদাতাকে বিচারাধীন আন্তর্জাতিক লেনদেনের আর্মস লেংথ প্রাইস পরিগণনা করিবার জন্য করদাতা যেসকল প্রমাণাদির উপর নির্ভর করিয়াছিল তাহা নোটিশে উল্লিখিত তারিখে উপস্থাপনের বা উপস্থাপন করানোর জন্য নোটিশ প্রদান করিবেন। \n    (৩) ট্রান্সফার প্রাইসিং কর্মকর্তা তাহার নিকট উপস্থাপিত প্রমাণ বা তিনি কোনো বিশেষ পয়েন্টে করদাতার নিকট বা অন্য কোনো ব্যক্তির নিকট হইতে কোনো প্রমাণ অধিযাচন করিলে তৎসহ তাহার নিকট প্রাপ্ত বা উপস্থিত প্রমাণ বিবেচনা করিয়া এবং তাহার সংগৃহীত সংশ্লিষ্ট সকল কাগজপত্র বিবেচনাক্রমে লিখিত আদেশ দ্বারা ধারা ২৩৫ অনুসারে আন্তর্জাতিক লেনদেন সংক্রান্ত আর্মস লেংথ প্রাইস নির্ধারণ করিবেন এবং উপকর কমিশনারের নিকট তাহার একটি অনুলিপি প্রেরণ করিবেন। \n  (৪) উপকর কমিশনার উপ-ধারা (৩) এর অধীন আদেশের কপি প্রাপ্তির পর ট্রান্সফার প্রাইসিং কর্মকর্তা কর্তৃক নির্ধারিত আর্মস লেংথ প্রাইস অনুসারে করদাতার মোট আয় পরিগণনার কার্যক্রম শুরু করিবেন এবং এইরূপ আয় পরিগণনাকালে যদি কর অব্যাহতিপ্রাপ্ত কোনো ব্যক্তির আয় পরিগণনা করিতে হয় তবে ট্রান্সফার প্রাইসিং কর্মকর্তা কর্তৃক নির্ধারিত আর্মস লেংথ প্রাইস এর ভিত্তিতে যে সমšয়^ পাওয়া যাইবে তাহা উক্ত ব্যক্তির আয় হিসাবে বিবেচিত হইবে এবং উক্ত আয়ের উপর নিয়মিত হারে কর আরোপিত হইবে। \n (৫) ট্রান্সফার প্রাইসিং কর্মকর্তা তাহার নিজস্ব উদ্ঘাটন অথবা করদাতা বা অন্য কোনো আয়কর কর্তৃপক্ষ কর্তৃক তাহার নজরে আনিবার প্রেক্ষিতে পরিদৃষ্ট হন যে, উপধারা (৩) এর অধীন তৎকর্তৃক প্রদত্ত   কোনো আদেশে এইরূপ ভুল রহিয়াছে যাহা রেকর্ডদৃষ্টে প্রতীয়মান, তাহা হইলে তিনি উক্ত ভুল সংশোধন করিতে পারিবেন এবং সেই অনুসারে এইক্ষেত্রে ধারা ৩৩০ এর বিধানাবলি, যতদূর সম্ভব, প্রযোজ্য হইবে। \n (৬) উপ-ধারা (৫) এর অধীন কোনো সংশোধন করা হইলে, ট্রান্সফার প্রাইসিং কর্মকর্তা তাহার আদেশের একটি অনুলিপি উপকর কমিশনারের নিকট প্রেরণ করিবেন যিনি পরবর্তীতে উক্ত আদেশ অনুসারে কর নির্ধারণী আদেশ সংশোধন করিবার ব্যবস্থা গ্রহণ করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
