import 'package:flutter/material.dart';

class dhara_21 extends StatefulWidget {
  const dhara_21({super.key});

  @override
  State<dhara_21> createState() => _dhara_21State();
}

class _dhara_21State extends State<dhara_21> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: [
              Text(
                "রিটার্নে অপ্রদর্শিত বিদেশস্থ সম্পত্তির উপর জরিমানা আরোপ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো নিবাসী বাংলাদেশি করদাতার রিটার্নে প্রদর্শিত নহে, এইরূপ কোনো বিদেশস্থ সম্পত্তির সন্ধান পাওয়া যায় এবং করদাতা উক্তরূপ সম্পত্তি অর্জনের উৎস বা প্রকৃতি সম্পর্কে কোনো সন্তোষজনক ব্যাখ্যা উপস্থাপন করিতে ব্যর্থ হন অথবা উপস্থাপিত ব্যাখ্যা উপকর কমিশনারের নিকট সন্তোষজনক প্রতীয়মান না হয়, সেইক্ষত্রে উপকর কমিশনার বিদেশস্থ সম্পত্তির ন্যায্য বাজার মূল্যের সমপরিমাণ অর্থ জরিমানা হিসাবে উক্ত করদাতার উপর আরোপ করিবেন এবং আদায় করিবেন।\n(২) উপ-ধারা (১) এর বিধান এই আইন বা বাংলাদেশে বলবৎ অন্য কোনো আইনের অধীন উদ্ভূত কোনো দায়কে ক্ষুণœ করিবে না।\n(৩) উপ-ধারা (১) এর অধীন জরিমানা আরোপের ক্ষেত্রে করদাতাকে যুক্তিসংগত শুনানির সুযোগ প্রদান করিতে হইবে।\n (৪) উপকর কমিশনার উপ-ধারা (১) এর অধীন আরোপিত জরিমানা করদাতার কোনো পরিসম্পদ বা করদাতার পক্ষে অন্য কেহ কোনো পরিসম্পদ ধারণ করিলে তাহা বিক্রয় বা বাজেয়াপ্ত করিয়া আদায় করিতে পারিবেন।\n(৫) যেইক্ষেত্রে উপকর কমিশনারের বিশ্বাস করিবার যুক্তিসংগত কারণ থাকে যে, করদাতার রিটার্নে অপ্রদর্শিত বিদেশস্থ সম্পত্তি রহিয়াছে, সেইক্ষেত্রে তিনি উক্ত সম্পত্তির বিষয়ে দেশে ও বিদেশে তদন্ত করিতে পারিবেন।\n (৬) বোর্ড, রিটার্নে অপ্রদর্শিত কোনো সম্পত্তি ধারণ প্রতিরোধে বা বিদেশে পাচারকৃত কোনো সম্পত্তি উদ্ধারে-\n(ক) 	যেইরূপ উপযুক্ত বিবেচনা করিবে সেইরূপ ব্যবস্থা গ্রহণ করিতে পারিবে; বা\n(খ)	উপকর কমিশনারের নিম্নে নহে এইরূপ যেকোনো আয়কর কর্তৃপক্ষকে অনুসন্ধান বা তদন্ত পরিচালনার নিমিত্ত সম্মতি প্রদান, অনুমতি প্রদান বা ব্যবস্থা গ্রহণ করিতে পারিবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
