import 'package:flutter/material.dart';

class dhara_119 extends StatefulWidget {
  const dhara_119({super.key});

  @override
  State<dhara_119> createState() => _dhara_119State();
}

class _dhara_119State extends State<dhara_119> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "অনিবাসীদের আয় হইতে কর কর্তন বা সংগ্রহ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই অধ্যায়ের অন্যান্য বিধানে যাহা কিছুই থাকুক না কেন, উপ-ধারা (২) এর বিধান সাপেক্ষে, যেইক্ষেত্রে নির্দিষ্ট ব্যক্তি বা দায়িত্বপ্রাপ্ত অন্য যেকোনো ব্যক্তি কোনো অনিবাসীকে এইরূপ কোনো অর্থ পরিশোধ করেন যাহা এই আইনের অধীন উক্ত অনিবাসীর জন্য করযোগ্য, সেইক্ষেত্রে উক্ত অর্থ পরিশোধের সময় উক্ত অর্থ প্রদানকারী, যদি না তিনি নিজেই এজেন্ট হিসাবে কর পরিশোধের জন্য দায়বদ্ধ থাকেন, প্রদেয় অর্থের উপর নির্ধারিত, অনধিক ৩০% (ত্রিশ শতাংশ), হারে কর কর্তন বা সংগ্রহ করিবেন।\n(২) যেইক্ষেত্রে বোর্ড, এতদুদ্দেশ্যে প্রয়োজনীয় কাগজপত্রসহ প্রাপ্ত আবেদনের ভিত্তিতে সন্তুষ্ট হইয়া আবেদন প্রাপ্তির ৩০ (ত্রিশ) দিনের মধ্যে এই মর্মে সনদ প্রদান করে যে, কোনো অনিবাসীকে কর সংক্রান্ত চুক্তি বা অন্য কোনো কারণে বাংলাদেশে কোনো কর প্রদান করিতে হইবে না বা হ্রাসকৃত হারে কর প্রদান করিতে হইবে, সেইক্ষেত্রে উপ-ধারা (১) এ উল্লিখিত পরিশোধ কর কর্তন ব্যতিরেকে বা হ্রাসকৃত হারে কর কর্তনপূর্বক করা যাইবে।\n (৩) এই ধারার অধীন কর্তনকৃত কর, যে আয়ের উপর উক্ত কর কর্তন করা হইয়াছে, উক্ত আয়ের উপর প্রাপকের ন্যূনতম করদায় বলিয়া গণ্য হইবে এবং কোনো দাবির বিপরীতে উহা সমন্বয় করা যাইবে না।\n(৪) কোনো কোম্পানি শেয়ার হস্তান্তর হইতে কোনো অনিবাসী করদাতার পক্ষে মূলধনি আয় উদ্ভূত হইলে, উক্ত শেয়ার হস্তান্তর কার্যকরের জন্য দায়ী ব্যক্তি বা, ক্ষেত্রমত, কর্তৃপক্ষ, উক্ত মূলধনি আয়ের উপর প্রদেয় কর পরিশোধিত না হইলে, উক্ত হস্তান্তর কার্যকর করিবেন না।\n (৫) এই ধারার অধীন সংগৃহীত কোনো কর নিবাসী কোনো ব্যক্তির নামে জমা হইলে এই ধারার অধীন কর সংগৃহীত হয় নাই মর্মে গণ্য হইবে।\n(৬) অনিবাসী বরাবর প্রেরিত নিম্নবর্ণিত অর্থ রেমিটকালে এই ধারার অধীন উৎসে কর কর্তন প্রযোজ্য হইবে না, যথা:-\n  (ক) 	আরবিট্রেশন ফি;\n(খ) 	হজ্ব বাবদ প্রেরিত অর্থ:\n (গ) 	প্রায়োরিটি পাস বাবদ অর্থ।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
