import 'package:flutter/material.dart';

class dhara_211 extends StatefulWidget {
  const dhara_211({super.key});

  @override
  State<dhara_211> createState() => _dhara_211State();
}

class _dhara_211State extends State<dhara_211> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "শপথ, ইত্যাদি গ্রহণপূর্বক সাক্ষ্য গ্রহণের ক্ষমতা ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো মামলা বিচার করিবার জন্য Code of Civil Procedure, 1908 (Act No. V of 1908) এর অধীন আদালতকে যে সকল ক্ষমতা প্রদান করা হইয়াছে, এই আইনের উদ্দেশ্যপূরণকল্পে, উপকর কমিশনার, অতিরিক্ত কর কমিশনার,কর কমিশনার, মহাপরিচালক (কেন্দ্রীয় গোয়েন্দা সেল), কর কমিশনার (আপিল) এবং আপিল ট্রাইব্যুনাল এর নিম্নবর্ণিত বিষয়ে সেই একই ক্ষমতা থাকিবে, যথা:-\n (ক) উদ্ঘাটন ও পরিদর্শন:\n (খ) কোনো ব্যক্তির উপস্থিতি বাধ্যকরণ এবং শপথ গ্রহণ ব ঘোষণাপূর্বক তাহাকে পরীক্ষা করা;\n(গ) আয় সম্পর্কিত রেকর্ড (সংশ্লিষ্ট আয়বর্ষের অব্যবহিত পূর্বের বা পরের দলিলাদিসহ) উপস্থাপনে বাধ্য করা; এবং\n(ঘ) সাক্ষ্য গ্রহণের জন্য কমিশন গঠন করা।\n(২) কমিশনারের পূর্বানুমোদন ব্যতীত উপকর কমিশনার কোনো তফসিলি ব্যাংকের কোনো কর্মচারীকে সাক্ষী হিসাবে হাজির করিবার বা উক্ত ব্যাংকের আয় সংশ্লিষ্ট দলিলাদি উপস্থাপনে বাধ্য করিবার জন্য এই ধারার অধীন তাহার ক্ষমতা প্রয়োগ করিবেন না। \n(৩) উপ-ধারা (১) এ উল্লিখিত যেকোনো কর্তৃপক্ষ, এই আইনের অধীন পরিচালিত কোনো কার্যক্রমের প্রেক্ষিতে তাহার নিকট উপস্থাপিত কোনো আয় সংশ্লিষ্ট দলিলাদি জব্দ করিতে পারিবেন এবং যেইরূপ উপযুক্ত বিবেচনা করিবেন সেইরূপ মেয়াদের জন্য আটক রাখিতে পারিবেন।\n(৪) উপকর কমিশনার\n(ক) কারণ রেকর্ড না করিয়া আয় সম্পর্কিত কোনো দলিলপত্র আটক করিবেন না; অথবা\n(খ) মুখ্য কমিশনার বা কমিশনারের পূর্বানুমোদন ব্যতীত, আয় সম্পর্কিত কোনো দলিলপত্র তাহার নিকট ১৫ (পনেরো) দিনের অধিক, ছুিটর দিন ব্যতীত, আটক রাখিবেন না।\n(৫) উপ-ধারা (১) এ উল্লিখিত কোনো কর্তৃপক্ষের নিকট এই আইনের অধীন পরিচালিত কোনো কার্যক্রম, Penal Code, 1860 (Act No. XLV of 1860) Gi section 196 ১৯৬ এর উদ্দেশ্যপূরণকল্পে, section 193 Ges 128 এর অধীন বিচারিক কার্যধারা বলিয়া গণ্য হইবে।\n (৬) এই আইনের অধীন গৃহীত বা পরিচালিত কোনো কার্যধারায় আয়কর কর্তৃপক্ষ কর্তৃক প্রদত্ত কোনো আদেশ দেওয়ানি আদালতের আদেশ বলিয়া গণ্য হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
