import 'package:flutter/material.dart';

class dhara_27 extends StatefulWidget {
  const dhara_27({super.key});

  @override
  State<dhara_27> createState() => _dhara_27State();
}

class _dhara_27State extends State<dhara_27> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
        padding: const EdgeInsets.all(25),
        children: const [
          Text(
            "বাংলাদেশে উপচিত বা উদ্ভূত বলিয়া গণ্য আয়",
            style: TextStyle(fontSize: 25),
          ),
          SizedBox(height: 10),
          Text(
            "নিম্নবর্ণিত আয়সমূহ বাংলাদেশে উপচিত বা উদ্ভূত হইয়াছে বলিয়া গণ্য হইবে, যথা: -"
            "\n(ক) পরিশোধের স্থান নির্বিশেষে চাকরি হইতে আয় খাতভুক্ত যেকোনো আয়, যদি তাহা-"
            "\n(অ) বাংলাদেশে অর্জিত হয়: বা"
            "\n(আ) সেবা প্রদানের বিপরীতে যদি সরকার বা স্থানীয় কর্তৃপক্ষ কর্তৃক কোনো বাংলাদেশি নাগরিককে পরিশোধ করা হয়;"
            "\n(খ) নিম্নবর্ণিত উৎস হইতে প্রত্যক্ষ বা পরোক্ষভাবে, উপচিত বা উ™ূ ত¢ কোনো আয়, যথা:-"
            "\n(অ) বাংলাদেশে অবস্থিত কোনো স্থায়ী স্থাপনা;"
            "\n(আ) বাংলাদেশে বিদ্যমান কোনো স্পর্শাতীত (রহঃধহমরনষব) সম্পত্তি, বাংলাদেশে বিদ্যমান কোনো সম্পত্তি, অধিকার, অথবা আয়ের অন্য কোনো উৎস; বা"
            "\n(ই) বাংলাদেশে অবস্থিত কোনো সম্পত্তি হস্তান্তর;"
            "\n(ঈ) বাংলাদেশে অবস্থিত কোনো ক্রেতার নিকট ইলেকট্ির নক মাধ্যমে কোনো পণ্য বা সেবা বিক্রয়; বা"
            "\n(উ) বাংলাদেশে ব্যবহৃত কোনো স্পর্শাতীত সম্পত্তি; ব্যাখ্যা। -এই ধারার উদ্দেশ্যপূরণকল্পে,"
            "\n(ক) বাংলাদেশে নিবাসী কোনো কোম্পানির শেয়ার, তাহা যাহার নিকট থাককু না কেন, বাংলাদেশে থাকা সম্পত্তি বলিয়া গণ্য হইবে;"
            "\n(খ) কোনো স্পর্শাতীত সম্পত্তি বাংলাদেশে বিদ্যমান সম্পত্তি বলিয়া গণ্য হইবে, যদি"
            "\n(অ) স্পর্শা তীত সম্পত্তি বাংলাদেশে নিবন্ধিত হয়; বা"
            "\n(আ) যেইক্ষেত্রে স্পর্শাতীত সম্পত্তির মালিক বাংলাদেশে অনিবাসী, সেইক্ষেত্রে স্পর্শাতীত সম্পত্তিটি যদি উপরিবর্ণিত অনিবাসীর বাংলাদেশে অবস্থিত স্থায়ী এস্টাবিøসমেন্টের সহিত সংশিষ্টø হয়:"
            "\n(গ) বাংলাদেশে অনিবাসী কোনো কোম্পানির শেয়ার হস্তান্তরিত হইলে, উক্ত শেয়ার হস্তাšরÍ যেখানেই সংঘটিত হউক না কেন, এবং উক্ত কোম্পানির বাংলাদেশে কোনো পরিসম্পদ থাকিলে উক্ত হস্তাšÍি রত শেয়ারমূল্যের যতটুকু বাংলাদেশে অবস্থিত কোনো"
            "পরিসম্পদের মূল্যের সহিত সম্পকির্ত ততটুকু পর্যন্ত অঙ্ক বাংলাদেশে অবস্থিত কোনো পরিসম্পদ হস্তান্তর বলিয়া গণ্য হইবে;"
            "\n(ঘ) বাংলাদেশি কোনো কোম্পানি কর্তৃক বাংলাদেশের বাহিরে পরিশোধিত কোনো লভ্যাংশ;"
            "\n(ঙ) সুদ হিসাবে প্রদেয় কোনো আয়, যদি তাহা-"
            "\n(অ) বাংলাদেশ সরকার কর্তৃক প্রদেয় হয়;"
            "\n(আ) নিবাসী কোনো ব্যক্তি কর্তৃক প্রদেয় হয়, তবে নিম্নবর্ণিত ক্ষেত্রে প্রযোজ্য হইবে না, যদি ঋণ বা ধারকৃত অর্থ"
            "\n(১) বাংলাদেশের বাহির হইতে গৃহীত হয়; এবং\n(২) বাংলাদেশের বাহিরে কোনো ব্যবসা পরিচালনার উদ্দেশ্যে বা বাংলাদেশের বাহিরে অবস্থিত কোনো  উৎস হইতে আয় অর্জনের উদ্দেশ্যে ব্যবহৃত হয়;\n(ই) বাংলাদেশে কোনো ব্যবসা পরিচালনার উদ্দেশ্যে বাবাংলাদেশে অবস্থিত কোনো উৎস হইতে আয় অর্জনের উদ্দেশ্যে গৃহীত বা ব্যবহৃত কোনো ঋণের বা ধারকৃত কোনো অর্থের বিপরীতে কোনো অনিবাসী কর্তৃক প্রদেয় হয়; \n(চ) কারিগরি সেবার জন্য ফি হিসাবে প্রাপ্ত কোনো আয়, যদি তাহাÑ\n(অ) বাংলাদেশ সরকার কর্তৃক প্রদেয় হয়; বা\n (আ) নিবাসী কোনো ব্যক্তি কর্তৃক প্রদেয় হয়, তবে নিম্নবর্ণিত ক্ষেত্রে প্রযোজ্য হইবে না, যদি উক্ত ফিÑ\n(১) বাংলাদেশের বাহিরে কোনো ব্যবসা পরিচালনা উদ্দেশ্যে গৃহীত সেবার বিপরীতে প্রদেয় হয়; অথবা\n (২) বাংলাদেশের বাহিরে অবস্থিত কোনো উৎস হইতে আয় অর্জনের উদ্দেশ্যে গৃহীত সেবার বিপরীতে প্রদেয় হয়; \n(ই) বাংলাদেশে অবস্থিত কোনো ব্যবসা পরিচালনা বা বাংলাদেশে অবস্থিত অন্য কোনো উৎস হইতে আয় অর্জনের লক্ষ্যে গৃহীত সেবার ফি হিসাবে কোনো অনিবাসী কর্তৃক প্রদেয় হয়;\n(ছ) রয়্যালটি আয়, যাহা\n(অ) বাংলাদেশ সরকার কর্তৃক পরিশোধযোগ্য ;\n(আ) নিবাসী কোনো ব্যক্তি কর্তৃক প্রদেয় হয়, তবে নিম্নবর্ণিত ক্ষেত্রে উহা প্রযোজ্য হইবে না, যদি উক্ত রয়্যালটি-\n (১) বাংলাদেশের বাহিরে কোনো ব্যবসা পরিচালনার উদ্দেশ্যে কোনো স্বত্ত¡, সম্পত্তি বা তথ্য বা গৃহীত সেবার বিনিময় হিসাবে প্রদেয় হয়; অথবা \n (২) বাংলাদেশের বাহিরে অবস্থিত কোনো উৎস হইতে আয় অর্জনের উদ্দেশ্যে কোনো স্বত্ত¡, সম্পত্তি বা তথ্য বা গৃহীত সেবার বিনিময় হিসাবে প্রদেয় হয়; \n (ই) বাংলাদেশে অবস্থিত কোনো ব্যবসা পরিচালনা বা বাংলাদেশে অবস্থিত অন্য কোনো উৎস হইতে আয় অর্জনের জন্য ব্যবহৃত কোনো স্বত্ত¡, সম্পত্তি বা তথ্য বা গৃহীত সেবার বিনিময় হিসাবে কোনো অনিবাসী কর্তৃক পরিশোধযোগ্য; \n(জ) বাংলাদেশের অভ্যন্তরে কোনো ঝুঁকি হইতে রক্ষার বিপরীতে কোনো নিবাসী বা অনিবাসী দ্বারা উপচিত বা প্রদেয় বিমা বাপুনঃবিমার প্রিমিয়াম । ",
            style: TextStyle(fontSize: 15),
          )
        ],
      ),
    );
  }
}
