import 'package:flutter/material.dart';

class dhara_8 extends StatefulWidget {
  const dhara_8({super.key});

  @override
  State<dhara_8> createState() => _dhara_8State();
}

class _dhara_8State extends State<dhara_8> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: [
              Text(
                "আয়কর কর্তৃপক্ষের দায়িত্ব ও কার্যাবলি এবং অধিক্ষেত্র",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের অন্যান্য বিধান সাপেক্ষে, এই আইনের অধীন বোর্ড যে সকল ক্ষমতা প্রয়োগ ও কার্য সম্পাদন করিতে পারিবে, সদস্য (কর) সেই সকল ক্ষমতা প্রয়োগ ও কার্য সম্পাদন করিতে পারিবে।"
                "\n(২) মহাপরিচালক (পরিদর্শন) নিম্নবর্ণিত কার্য সম্পাদন করিবেন, যথা:-"
                "\n(ক) এই আইনের অধীন কার্যধারার বাস্তবায়ন পরিদর্শন;"
                "\n(খ) পরিদর্শনের উপর ভিত্তি করিয়া করনীতি সংস্কারের প্রস্তাব এবং কর প্রশাসন উন্নয়নের ক্ষেত্র শনাক্তকরণ;"
                "\n(গ) বোর্ডের নিকট বোর্ড কর্তৃক নির্দেশিত পদ্ধতিতে মতামত এবং সুপারিশ অন্তর্ভুক্ত করিয়া প্রতিবেদন আকারে পেশকরণ; এবং"
                "\n(ঘ) বোর্ড কর্তৃক নির্ধারিত অন্য কোনো কার্য।"
                "\n(৩) মহাপরিচালক (কেন্দ্রীয় গোয়েন্দা সেল) নিম্নবর্ণিত কার্য সম্পাদন করিবেন, যথা:-"
                "\n(ক) করদাতাদের তথ্য সংগ্রহের জন্য গোয়েন্দা কার্য;"
                "\n(খ) গোয়েন্দা কার্যক্রমের ভিত্তিতে সংগৃহীত তথ্যের সহিত সংশিষ্টø আয়কর রেকর্ড বিশ্লেষণ;"
                "\n (গ) অংশ ১৩ এবং অংশ ১৫ এ উল্লিখিত কর পরিহার, গোপনকৃত আয় ও অনিয়ম শনাক্তকরণ;"
                "\n(ঘ) কর ফাঁকি বা গোপনকৃত আয় উদ্ঘাটন বা কর সংক্রান্ত অন্য কোনো অনিয়ম প্রমাণ করিবার জন্য এবং জরিমানা প্রদানপূর্বক কর পুনরুদ্ধারের জন্য কর জালিয়াতি বা কর জালিয়াতির পক্ষে পরিচালনার সুপারিশ প্রদানের জন্য তদন্ত পরিচালনা;"
                "\n(ঙ) অন্য কোনো আইন দ্বারা অনুমোদিত বা বোর্ড কর্তৃক অর্পিত অন্য কোনো কার্য;"
                "\n(৪) বোর্ড, আদেশ দ্বারা, আয়কর কর্তৃপক্ষের অধিক্ষেত্র নির্ধারণ করিতে পারিবে, এবং প্রয়োজনে, আয়কর কর্তৃপক্ষের অধিক্ষেত্র পুনঃনির্ধারণ করিতে পারিবে বা কার্যাবলি পরিবর্তন করিতে পারিবে বা এক আয়কর কর্তৃপক্ষের কার্যাবলি ও ক্ষমতা অন্য কোনো আয়কর কর্তৃপক্ষের নিকট হস্তান্তর করিতে পারিবে।"
                "\n(৫) উপ-ধারা (৪) এ উল্লিখিত এইরূপ হস্তান্তর স্বাভাবিক কার্যধারার যেকোনো পর্যায়ে করা যাইবে এবং যে পর্যায়ে হ¯াÍ ন্তর হইয়াছিল সেই পর্যায় হইতে পরবর্তী কার্যক্রম গ্রহণ করা যাইবে।"
                "\n(৬) বোর্ড, আদেশ দ্বারা, করদাতাগণের কর নির্ধারণের স্থান নির্ধারণ করিতে পারিবে। ",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
