import 'package:flutter/material.dart';

class dhara_209 extends StatefulWidget {
  const dhara_209({super.key});

  @override
  State<dhara_209> createState() => _dhara_209State();
}

class _dhara_209State extends State<dhara_209> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "জব্দকতৃ সম্পদের ব্যবস্থা ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে ধারা ২০৬ এর অধীন জব্দকৃত কোনো অর্থ, মূল্যবান ধাতু, গহনা বা অন্যান্য মূল্যবান সামগ্রী বা জিনিস (অতঃপর সম্পদ বলিয়া উল্লিখিত), উপকর কমিশনারের নিকট হস্তান্তর করা হয়, সেইক্ষেত্রে উপ-ধারা (২) এ বর্ণিত পদ্ধতি অনুসরণ করিতে হইবে। \n (২) উপকর কমিশনার, সংশ্লিষ্ট ব্যক্তিকে যুক্তিসঙ্গত শুনানির সুযোগ প্রদান করিবেন এবং অতঃপর সম্পদ জব্দের ৯০ (নব্বই) দিনের মধ্যে নিম্নবর্ণিত প্রয়োজনীয় অনুসন্ধানের উদ্যোগ গ্রহণ করিবেন,"
                " \n (ক) অপ্রদর্শিত আয় সম্পর্কে আনুমানিক হিসাব করিয়া অপ্রদর্শিত সম্পত্তি হইতে আয়সহ, প্রাপ্ত তথ্যের ভিত্তিতে সংক্ষেপে তাহার বিবেচনায় সর্বোত্তম সিদ্ধান্ত গ্রহণ;"
                "\n (খ) প্রদেয় অঙ্ক পরিগণনা, যাহা নিমবœ র্ণিত বিষয়াদির সমষ্টি হইবে, যথা:- "
                "\n(অ) দফা (ক) এর প্রাক্কলনের ভিত্তিতে প্রদেয় কর এবং অন্য কোনো অঙ্ক; এবং "
                "\n (আ) এইরূপ ব্যক্তির, বিদ্যমান যে করদায়ের জন্য করখেলাপি "
                "অথবা করখেলাপি হিসাবে বিবেচিত সেই করদায় পূরণের জন্য প্রয়োজনীয় অঙ্ক । "
                "\n (৩) উপ-ধারা (২) এর উদ্দেশ্যপূরণকল্পে, ৯০ (নব্বই) দিন সময় গণনাকালে, এই ধারার অধীন নির্ধারিত কোনো সময়সীমা, কোনো আদেশ বা নিষেধাজ্ঞার কারণে"
                "কোনো কার্যধারা বহিভতূর্ থাকিবে।"
                "\n (৪) যেইক্ষেত্রে মোট আয় এবং করদায় পরিগণনার নিমিত্ত জব্দকৃত সম্পত্তি বা"
                "তাহার অংশ কোনো আয়বর্ষ বা বর্ষসমূহের সহিত সংশ্লিষ্ট তাহা নিরূপণ করা সম্ভব হয়  নাই সেইক্ষেত্রে উপকর কমিশনার উক্ত সম্পত্তি বা তাহার অংশবিশেষ, যাহা প্রযোজ্য, উক্ত ব্যক্তির যেই আয়বর্ষের সহিত সংশ্লিষ্ট সম্পদ জব্দ করা হইয়াছে উক্ত বৎসরের"
                "হিসাবে বিবেচনা করিতে পারিবেন।"
                "\n (৫) উপ-ধারা (২) এবং (৩) এর অধীন কার্যক্রম সম্পন্ন করিবার পর, কমিশনারের অনুমোদনক্রমে, উপকর কমিশনার, উপ-ধারা (২) এর দফা (খ)-তে উল্লিখিত পরিমাণ অর্থ প্রদানের জন্য সংশ্লিষ্ট ব্যক্তিকে আদেশ প্রদান করিতে পারিবেন।"
                "\n(৬) যেইক্ষেত্রে সংশ্লিষ্ট ব্যক্তি কোনো অর্থ পরিশোধ করে বা সন্তোষজনক ব্যবস্থা গ্রহণ করে, সেইক্ষেত্রে উপকর কমিশনার জব্দকৃত সম্পদ ছাড় বা তাহার নিকট উপযুক্ত মর্মে বিবেচিত এইরূপ উদ্যোগ গ্রহণ করিবেন।\n(৭) যেইক্ষেত্রে উপ ধারা (২) এর অধীন পরিশোধ, পরিশোধের জন্য কোনো"
                "সন্তোষজনক ব্যবস্থা, গ্রহণ করা হয় নাই সেইক্ষেত্রে -"
                "\n (ক) উক্ত ব্যক্তি অপরিশোধিত পরিমাণ কর প্রদানের জন্য করদাতা হিসাবে গণ্য হইবেন; এবং"
                "\n (খ) ধারা ২০৬ এর অধীন জব্দকৃত পরিমাণ সম্পত্তি যাহা করের অনাদায়ী অংশের আদায়ের জন্য যথেষ্ট সেই পরিমাণ সম্পদ উপকর কমিশনার হেফাজতে রাখিতে পারিবেন।"
                "\n(৮) যদি উপকর কমিশনার এই মর্মে সন্তুষ্ট হন যে, ধারা ২০৬ এর অধীন"
                "জব্দকৃত সম্পত্তি বা উহার কোনো অংশ কোনো ব্যক্তি বা অন্য কোনো ব্যক্তির দখলভুক্ত,"
                "তাহা হইলে তিনি এই ধারার অধীন উক্ত ব্যক্তির বিরুদ্ধে ব্যবস্থা গ্রহণ করিতে পারিবেন এবং এই ধারার সকল বিধান যথাযথভাবে প্রয়োগযোগ্য হইবে।"
                "\n  (৯) যেকোনো ব্যক্তি যাহাকে উপ-ধারা (৪) এর অধীন নির্ধারিত পরিমাণ অর্থ পরিশোধ করিতে হইবে, তিনি যদি সংক্ষুব্ধ হন, তাহা হইলে কর কমিশনারের নিকট লিখিতভাবে আপত্তি উত্থাপন করিতে পারিবেন, এবং কমিশনার আবেদনকারীকে শুনানির সুযোগ প্রদান করিয়া, যথোপযুক্ত আদেশ প্রদান করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
