import 'package:flutter/material.dart';

class dhara_205 extends StatefulWidget {
  const dhara_205({super.key});

  @override
  State<dhara_205> createState() => _dhara_205State();
}

class _dhara_205State extends State<dhara_205> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "জরিপের ক্ষমতা",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের অধীন কোনো ব্যক্তির কর সংক্রান্ত দায়বদ্ধতা জরিপের উদ্দেশ্যে বোর্ড বা কর কমিশনার কোনো আয়কর কর্তৃপক্ষকে ব্যবসা পরিচালিত হয় বা ভাড়া প্রদানের মাধ্যমে আয় হয় এইরূপ যেকোনো স্থানে বা প্রাঙ্গণে গমনের ও জরিপের ক্ষমতা অর্পণ করিতে পারিবে।\n (২) আয়কর কর্তৃপক্ষ নিম্নরূপ ক্ষেত্রে উপ-ধারা (১) এ উল্লিখিত স্থানে প্রবেশ করিবে, যথা:-\n (ক) যদি উক্ত স্থানে ব্যবসাটি পরিচালিত হয়, তাহা হইলে কেবল যে সময়ে উক্ত স্থান ব্যবসার জন্য উন্মুক্ত থাকে; এবং\n(খ) অন্য কোনো ক্ষেত্রে, কেবল সূর্যোদয়ের পরে এবং সূর্যাস্তের পূর্বে।\n(৩) উপ-ধারা (২) এ উল্লিখিত স্থানে প্রবেশ করিয়া, আয়কর কর্তৃপক্ষ নিম্নবর্ণিত পদক্ষেপ গ্রহণ করিবেন, যথা:-\n(ক) আয়, পরিসম্পদ ও দায় সম্পর্কিত যে রেকর্ড তদ্কর্তৃক পরিদর্শন করা হইয়াছে সেই রেকর্ডে পরিদর্শনের চিহ্ন প্রদান করত তাহা হইতে সারাংশ বা কপি সংগ্রহ;\n(খ) তদ্কর্তৃক পরিদর্শনকৃত আয় সম্পর্কিত রেকর্ড কারণ রেকর্ডপূর্বক জব্দকরণ ও হেফাজতে গ্রহণ;\n(গ) নগদ, অর্থ জমা বা মূল্যবান সামগ্রীসমূহের তালিকা প্রস্তুতকরণ;\n(ঘ) এই আইনের অধীন কোনো কার্যক্রমের জন্য প্রাসঙ্গিক হইলে কোনো ব্যক্তিকে শপথপূর্বক তাহার বিবৃতি পরীক্ষা; এবং\n(ঙ) অন্য কোনো প্রয়োজনীয় অনুসন্ধান।\n(৪) প্রত্যেক মালিক, বেতনভোগী কর্মী বা অন্য কোনো ব্যক্তি যিনি কোনো ব্যবসা পরিচালনা করেন, বা কোনো ব্যক্তি যিনি উপ-ধারা (১) এর অধীন আয়কর কর্তৃপক্ষ কর্তৃত্ব বা ক্ষমতা প্রয়োগ করিতে পারে এইরূপ কোনো স্থান বা প্রাঙ্গণে বসবাস করেন, কর্তৃপক্ষকে নিম্নবণির্ত ভাবে উক্তরূপ কর্তৃত্ব বা ক্ষমতা প্রয়োগে সহায়তা করিবে, যথা:-\n (ক) কর্তৃপক্ষকে নিম্নবর্ণিত কার্য সম্পাদনে প্রয়োজনীয় ব্যবস্থা গ্রহণ করিবে-\n(অ) আয়, পরিসম্পদ ও দায় সংক্রান্ত রেকর্ড পরিদশর্ন ও প্রবেশ কর; অথবা\n(আ) এইরূপ স্থান বা প্রাঙ্গণে প্রাপ্ত নগদ অর্থ, স্টক বা অন্য কোনো মূল্যবান সামগ্রী বা বস্তু যাচাই-বাছাই ও পরীক্ষণ; এবং\n (খ) এই আইনের অধীন কোনো কার্যক্রমের জন্য উপযুক্ত বা প্রাসঙ্গিক কোনো বিষয় সম্পর্কে কর্তৃপক্ষকে প্রয়োজনীয় তথ্য সরবরাহ।\n(৫) উপ-ধারা (৮) এর দফা (ঘ) এর অধীন কোনো ব্যক্তি কর্তৃক প্রদত্ত বিবৃতি এই আইনের অধীন কোনো কার্যক্রমের প্রমাণ হিসাবে ব্যবহার করা যাইবে।\n (৬) এই ধারার প্রয়োগের ক্ষেত্রে আয়কর কর্তৃপক্ষ, প্রবেশকৃত স্থান বা প্রাঙ্গণ হইতে কোনো নগদ অর্থ, স্টক বা অন্যান্য মলূ ্যবান সামগ্রী বা বস্তুঅপসারণ করিবে না।\n (৭) আয়কর কর্তৃপক্ষ কর কমিশনারের অনুমোদন ব্যতিরেকে এই ধারার অধীন হেফাজতে জব্দকৃত আয় সম্পর্কিত রেকর্ড ১ (এক) মাসের অধিক সময়ের জন্য তাহার নিকট রাখিবে না। \n (৮) কর পরিদর্শক ব্যতীত কোনো আয়কর কর্তৃপক্ষের ধারা ২২৩ এর উপ-ধারা\n(১) এর ক্ষমতা থাকিবে, যদি কোনো ব্যক্তি নিম্নবর্ণিত কার্যাদি সম্পাদনে অপারগ হইলে বা অমান্য করিলে, যথা:-\n (ক) হিসাবপত্র বা অন্যান্য দলিলপত্র পরীক্ষার জন্য আয়কর কর্তৃপক্ষকে সহায়তা প্রদান;\n (খ) কোনো নগদ অর্থ, স্টক বা অন্যান্য মূল্যবান সামগ্রী বা বস্তু যাচাই- বাছাই বা পরীক্ষা করিবার অনুমতি প্রদান;\n (গ) কোনো তথ্য প্রদান; বা\n (ঘ) রেকর্ড বা বিবৃতি প্রদান ।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
