import 'package:flutter/material.dart';

class dhara_210 extends StatefulWidget {
  const dhara_210({super.key});

  @override
  State<dhara_210> createState() => _dhara_210State();
}

class _dhara_210State extends State<dhara_210> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "২১০। অধিকৃত সম্পত্তির ব্যবস্থা । -",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে ধারা ২০৬ এর উপ-ধারা (৭) এর অধীন সংরক্ষণকৃত সম্পদ কেবল অর্থ হয়, বা আংশিক পরিমাণ অর্থ হয় এবং অন্যান্য অংশ হয় অন্যান্য সম্পদ, সেইক্ষেত্রে\n(ক) উপকর কমিশনার প্রথমে এই উপ-ধারার অধীন দায়ী করদাতা হিসাবে বিবেচিত ব্যক্তির অনাদায়ী পরিমাণ অর্থ প্রদানের জন্য এই অর্থ ব্যবহার করিবেন; এবং এইরূপ ক্ষেত্রে যেই পরিমাণ অর্থ উক্ত ব্যক্তির নিকট হইতে পরিশোধ করা হইয়াছে সেই পরিমাণ অর্থ দায়মুক্ত হইবে; এবং \n (খ) যেইক্ষেত্রে, দফা (ক) এর অধীন অর্থ ব্যবহারের পর, উল্লিখিত পরিমাণের যেই পরিমাণ অংশ অবশিষ্ট থাকে, উপকর কমিশনার ট্যাক্স রিকোভারি কর্মচারীর মাধ্যমে অর্থ নহে এইরূপ কোনো অস্থাবর সম্পত্তি বিক্রয় করিয়া অবশিষ্ট অনাদায়ী অর্থ পুনরুদ্ধার করিতে পারিবেন; এতদুদ্দেশ্যে তাহার এই আইনের অধীন কর পুনরুদ্ধারকারীর ন্যায় সকল ক্ষমতা থাকিবে।\n (২) উপ-ধারা (১) এর কোনো বিধান এবং ধারা ২০৬ এর উপ-ধারা (৭) এ উল্লিখিত কোনো কিছুই করদাতার নিকট হইতে এই আইনের অধীন যেকোনো উপায়ে পাওনা আদায়ের প্রক্রিয়াকে বাধাগ্রস্ত করিবে না।\n (৩) ধারা ২০৬ এর উপ-ধারা (৭) এ উল্লিখিত দায় পরিশোধের পর কোনো সম্পদ বা প্রাপ্তি অবশিষ্ট থাকিলে অবিলম্বে যাহার নিকট হইতে সম্পদের হেফাজত লওয়া হইয়াছিল তাহার নিকট হস্তান্তর করিতে হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
