import 'package:flutter/material.dart';

class dhara_143 extends StatefulWidget {
  const dhara_143({super.key});

  @override
  State<dhara_143> createState() => _dhara_143State();
}

class _dhara_143State extends State<dhara_143> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
        padding: const EdgeInsets.all(25),
        children: [
          const Text(
            "কর্তন, সংগ্রহ, ইত্যাদির ব্যর্থতার ফলাফল ",
            style: TextStyle(fontSize: 25),
          ),
          const SizedBox(height: 10),
          const Text(
            "(১) যেইক্ষেত্রে কোনো ব্যক্তি এই অংশের বিধানাবলির অধীন\n (ক)	উৎসে কর কর্তন বা সংগ্রহ করিতে ব্যর্থ হন; বা\n(খ)	অপেক্ষাকৃত কম হারে বা পরিমাণে কর কর্তন বা সংগ্রহ করেন; বা\n (গ)	উৎসে কর কর্তন বা সংগ্রহ করিবার পর তাহা সরকারের অনুকূলে জমা প্রদান করিতে ব্যর্থ হন অথবা যেই পরিমাণ কর কর্তন বা সংগ্রহ করেন তাহার চাইতে কম পরিমাণ অর্থ সরকারের অনুকূলে জমা প্রদান করেন; বা\n  (ঘ)	অন্য কোনো প্রকার পরিপালনে ব্যর্থ হন, সেইক্ষেত্রে এইরূপ ব্যক্তি খেলাপি করদাতা হিসাবে গণ্য হইবেন।\n  (২) উপ-ধারা (১) অনুযায়ী খেলাপি করদাতা হিসাবে গণ্য ব্যক্তি, এই আইনের অধীন অন্য যে সকল পরিণতির জন্য দায়ী হইতে পারেন তাহা ক্ষুণœ না করিয়া নিম্নবর্ণিত অর্থ পরিশোধের জন্য দায়ী থাকিবেন, যথা :-\n(ক)	যেই পরিমাণ অর্থ কর্তন বা সংগ্রহ করা হয় নাই;\n(খ)	যেই পরিমাণ অর্থ কর্তন বা সংগ্রহ করা আবশ্যক এবং প্রকৃতভাবে যাহা কর্তন বা সংগ্রহ করা হইয়াছে এই দুইয়ের পার্থক্যের সমপরিমাণ অর্থ; বা\n (গ)	কর কর্তন বা সংগ্রহ করিবার পর যেই পরিমাণ অর্থ সরকারের অনুকূলে জমা প্রদান করা হয় নাই তাহার সমপরিমাণ অর্থ; এবং\n (ঘ)	অন্য কোনো বিধানাবলি পরিপালনের ব্যর্থতায় অনধিক ১০ (দশ) লক্ষ টাকা।\n(৩) উপ-ধারা (১) এ উল্লিখিত পরিমাণের অর্থ পরিশোধ ছাড়াও, উপ-ধারা (১) অনুযায়ী খেলাপি করদাতা হিসাবে গণ্য ব্যক্তি উপ-ধারা (২) এর দফা (ক), (খ) এবং (গ) এ উল্লিখিত পরিমাণের উপর নিম্নবর্ণিত সারণীতে প্রদত্ত অতিরিক্ত অর্থ গণনার ভিত্তি অঙ্কের উপর প্রতিমাসে ২% (দুই শতাংশ) হারে অতিরিক্ত পরিমাণ অর্থ পরিশোধের জন্য দায়ী হইবেন, যথা:-",
            style: TextStyle(fontSize: 15),
          ),
          const SizedBox(height: 10),
          const Text("সারণী", textAlign: TextAlign.center),
          Table(
            border: TableBorder.all(color: Colors.black),
            columnWidths: const {
              0: FlexColumnWidth(1),
              1: FlexColumnWidth(2),
              2: FlexColumnWidth(3),
            },
            children: const [
              TableRow(children: [
                Text("ক্রমিক নং"),
                Text("ক্ষেত্রসমূহ"),
                Text("অতিরিক্ত অর্থ পরিগণনার ভিত্তি"),
              ]),
              TableRow(children: [
                Text("(১)	"),
                Text("(২)"),
                Text("(৩)"),
              ]),
              TableRow(children: [
                Text("১।"),
                Text(
                    "এই অংশের বিধানাবলি অনুসারে কর কর্তন বা সংগ্রহের ব্যর্থতা"),
                Text("যেই পরিমাণ উৎসে কর কর্তন বা সংগ্রহ করা হয়নি।"),
              ]),
              TableRow(children: [
                Text("২।"),
                Text("কমহারে বা কম পরিমাণে কর কর্তন বা সংগ্রহ"),
                Text("যেই পরিমাণ উৎসে কর কম কর্তন বা সংগ্রহ করা হইয়াছে।"),
              ]),
              TableRow(children: [
                Text("৩।"),
                Text(
                    "কর্তন বা সংগ্রহের পর উহা সরকারি কোষাগারে জমা না দেওয়া বা পরিমাণে কম জমা দেওয়া"),
                Text(
                    "উৎসে কর কর্তনের পর যেই পরিমাণ অর্থ সরকারি কোষাগারে জমা দেওয়া হয় নাই।"),
              ]),
            ],
          ),
          const SizedBox(height: 10),
          const Text(
              "(৪) উপ-ধারা (৩) এর অধীন অতিরিক্ত অর্থ পরিগণনার মেয়াদ উৎসে কর কর্তন বা সংগ্রহের নির্ধারিত তারিখ হইতে সরকারি কোষাগারে জমা দেওয়ার তারিখ পর্যন্ত হইবে: তবে শর্ত থাকে যে, এইরূপ মেয়াদ ২৪ (চব্বিশ) মাসের অধিক হইবে না।\n (৫) উপকর কমিশনার উপ-ধারা (১) এ উল্লিখিত ব্যক্তিকে শুনানির যুক্তিসংগত সুযোগ প্রদান করিয়া তাহার নিকট হইতে উপ-ধারা (২) এর অধীন পরিশোধযোগ্য অর্থসহ উপ-ধারা (৩) এ উল্লিখিত অতিরিক্ত পরিমাণ অর্থ আদায়ের প্রয়োজনীয় পদক্ষেপ গ্রহণ করিবেন।\n (৬) যেইক্ষেত্রে সরকার, সরকারি প্রতিষ্ঠান, কর্তৃপক্ষ, প্রজেক্ট, প্রোগ্রাম, সংস্থা, ইউনিট বা সরকারের আর্থিক বা পরিচালনগত সংশ্লিষ্টতা রহিয়াছে এইরূপ কোনো কর্মকাÐে উৎসে কর কর্তন বা সংগ্রহের জন্য দায়িত্বপ্রাপ্ত, সেইক্ষেত্রে-"
              "\n(ক)	অর্থ পরিশোধের অনুমোদন বা অনুমতির জন্য দায়িত্বপ্রাপ্ত স্বাভাবিক ব্যক্তি বা ব্যক্তিগণ; অথবা\n(খ)	ছাড়পত্র, রেজিস্ট্রেশন, লাইসেন্স, পারমিট প্রদান, অনুমোদন বা অনুমতি দানের জন্য দায়িত্বপ্রাপ্ত স্বাভাবিক ব্যক্তি বা ব্যক্তিগণ, এই ধারার অধীন কর, জরিমানা ও অতিরিক্ত অর্থ পরিশোধের জন্য যৌথভাবে ও পৃথকভাবে দায়ী হইবেন।\n (৭) যেইক্ষেত্রে সরকার, সরকারি প্রতিষ্ঠান, কর্তৃপক্ষ, প্রজেক্ট, প্রোগ্রাম, সংস্থা, ইউনিট বা সরকারের আর্থিক বা পরিচালনগত সংশ্লিষ্টতা রহিয়াছে এইরূপ কোনো কর্মকাÐ ব্যতীত অন্য কোনো ব্যক্তি বা প্রতিষ্ঠান উৎসে কর কর্তন বা সংগ্রহের জন্য দায়িত্বপ্রাপ্ত, সেইক্ষেত্রে-\n(ক)	ব্যক্তি বা প্রতিষ্ঠান নিজে, এবং\n (খ) 	অর্থ পরিশোধের অনুমোদন বা অনুমতি দানের জন্য দায়িত্বপ্রাপ্ত স্বাভাবিক ব্যক্তি বা ব্যক্তিগণ এই ধারার অধীন কর, জরিমানা ও অতিরিক্ত অর্থ পরিশোধের জন্য যৌথভাবে ও পৃথকভাবে দায়ী হইবেন।"
              "\n(৮) যে ব্যক্তির নিকট হইতে কর সংগ্রহযোগ্য বা কর্তনযোগ্য, তিনি ইতোমধ্যে উপ-ধারা (২) ও (৩) এ উল্লিখিত সকল প্রকারের অর্থ সম্পূর্ণভাবে পরিশোধ করিয়া থাকিলে, উপ-ধারা (২) ও (৩) এ উল্লিখিত অর্থ আদায়ের পদক্ষেপ গ্রহণ করা হইবে না।"),
          const SizedBox(height: 10),
        ],
      ),
    );
  }
}
