import 'package:flutter/material.dart';

class dhara_147 extends StatefulWidget {
  const dhara_147({super.key});

  @override
  State<dhara_147> createState() => _dhara_147State();
}

class _dhara_147State extends State<dhara_147> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "উৎসে কর কর্তন বা সংগ্রহ নিশ্চিতকরণ ও যাচাইকরণ। ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "( ১ ) কর কমিশনার বা মহাপরিচালক, কর পরিদর্শক বা মহাপরিচালক, সেন্ট্রাল ইন্টেলিজেন্স সেল কর্তৃক লিখিতভাবে ক্ষমতাপ্রাপ্ত কর্তৃপক্ষ উৎসে কর কর্তন বা সংগ্রহ যাচাইয়ের লক্ষ্যে বা এই অংশের বিধানাবলির প্রয়োগের উদ্দেশ্যে\n(ক) 	যেকোনো ব্যক্তি বা প্রতিষ্ঠানের\n (অ) 	প্রাঙ্গণ, স্থান, পণ্য হিসাব বহি এবং যেকোনো প্রকারে বা পদ্ধতিতে রক্ষিত অর্থনৈতিক কর্মকাÐের রেকর্ডে পূর্ণাঙ্গ ও নির্বিঘœ প্রবেশ করিতে পারিবে;\n (আ) 	কম্পিউটারে রক্ষিত বা লভ্য (ধাধরষধনষব) কোনো এনক্রিপ্টেড উপাত্তকে পাঠযোগ্য ও বোধগম্য বিন্যাসে (ভড়ৎসধঃ) বা পাঠে (ঃবীঃ) আনস্ক্র্যামবল বা রিট্রান্সফরম করিবার ক্ষমতাসম্পন্ন যেকোনো তথ্য, কোড বা প্রযুক্তিতে প্রবেশ করিতে পারিবে\n (ই) 	ইলেক্ট্রনিক রেকর্ডে বা সিস্টেমে সংরক্ষিত উপাত্ত, ইমেজ বা অন্য কোনো ইনপুট এক্সট্রাক্ট (বীঃৎধপঃ) করিতে পারিবে;\n(ঈ) 	পাসওয়ার্ড ব্রেক করিয়া সিস্টেমে প্রবেশ করিতে পারিবে;\n (উ) 	কোনো তথ্য, হিসাবের বহি, দলিলাদি, ইমেজ বা ইনপুটের কপি বা বিশ্লেষণ করিতে পারিবে;\n(ঊ) 	হিসাব বহি ও অন্যান্য দলিলাদিতে শনাক্ত চিহ্ন বা স্ট্যাম্প ছাপ দিতে পারিবে এবং উহাদের কপি বা এক্সট্রাক্ট লইতে পারিবে;\n(ঋ)	যেকোনো হিসাব বহি, দলিলাদি, ইলেক্ট্রনিক রেকর্ড ও সিস্টেম জব্দ করিতে এবং নিজেদের দখলে রাখিতে পারিবে;\n (এ)	কোনো ব্যক্তিকে কোনো কার্যকলাপ করা বা করা হইতে  বিরত থাকিবার নির্দেশ দিতে পারিবে;\n(খ)	যেইরূপ উপযুক্ত সেইরূপ বিশেষজ্ঞ, মূল্য নির্ধারক বা বাহিনী নিজেদের সহিত নিতে পারিবে।\n(২) এই ধারার অধীন ক্ষমতাপ্রাপ্ত কোনো কর্তৃপক্ষ কোনো ব্যক্তির প্রাঙ্গণে বা স্থানে প্রবেশ করিলে বা প্রবেশের অভিপ্রায় ব্যক্ত করিয়া যদি কোনো প্রকার বাধা, প্রতিবন্ধকতা বা অসহযোগিতার সম্মুখীন হইলে, উক্ত ব্যক্তিকে অনধিক ৫০ (পঞ্চাশ) লক্ষ টাকা জরিমানা আরোপ করিতে পারিবেন।\n(৩) কোনো ব্যক্তি এই ধারার বা এই আইনের এই অংশের বিধানাবলি পরিপালনে ব্যর্থ হইলে, উপকর কমিশনার উক্ত ব্যক্তি কর্তৃক প্রদত্ত ব্যাখ্যা লিপিবদ্ধপূর্বক, বা কোনোরূপ ব্যাখ্যার অনুপস্থিতিতে একতরফাভাবে কর নির্ধারণ সম্পন্ন করিয়া নিরূপিত কর ও আরোপিত জরিমানা আদায় করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
