import 'package:flutter/material.dart';

class dhara_140 extends StatefulWidget {
  const dhara_140({super.key});

  @override
  State<dhara_140> createState() => _dhara_140State();
}

class _dhara_140State extends State<dhara_140> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "সংজ্ঞা।-এই অংশের উদ্দেশ্যপূরণকল্পে",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১)	অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি বলিতে\n (অ) 	চাকরি হইতে আয় খাতের অধীন আয় হিসাবে পরিগণিত হয় এইরূপ কোনো অর্থ পরিশোধের ক্ষেত্রে স্বয়ং নিয়োগকর্তা বা যেইক্ষেত্রে নিয়োগকর্তা স্থানীয় কর্তৃপক্ষ, কোম্পানি বা প্রতিষ্ঠান হয়, সেইক্ষেত্রে অনুরূপ কর্তৃপক্ষ, কোম্পানি বা প্রতিষ্ঠান এবং উহাদের প্রধান কর্মকর্তাও অন্তর্ভুক্ত হইবে;\n(আ) আর্থিক পরিসম্পদ হইতে আয় খাতের অধীন কোনো অর্থ পরিশোধের ক্ষেত্রে, উক্ত আর্থিক পরিসম্পদ ইস্যুকারী কোনো সংস্থা, কোম্পানি বা অন্য কোনো প্রতিষ্ঠান অথবা উক্ত সংস্থা, কোম্পানি বা প্রতিষ্ঠানের প্রধান কর্মকর্তা; এবং\n (ই)	এই আইনের অধীন করযোগ্য আয় হিসাবে পরিগণিত অন্য কোনো অর্থ পরিশোধের ক্ষেত্রে বা এই অংশের অধীন উৎসে কর কর্তন বা সংগ্রহ প্রযোজ্য হয় এইরূপ কোনো অর্থ পরিশোধের ক্ষেত্রে, স্বয়ং অর্থ প্রদানকারী অথবা অর্থ প্রদানকারী কোনো কোম্পানি বা অন্য কোনো প্রতিষ্ঠান হইলে, উহার প্রধান কর্মকর্তাও অন্তর্ভুক্ত হইবে;\n(২)	‘‘চুক্তি” অর্থে উপ-চুক্তি, উপ-উপ-চুক্তি, অনুযাত (ংঁনংবয়ঁবহঃ) চুক্তি, কোনো সমঝোতা (ধমৎববসবহঃ) বা বন্দোবস্ত (ধৎৎধহমবসবহঃ) যে নামেই অভিহিত হউক না কেন, অন্তর্ভুক্ত হইবে;\n(৩)	“নির্দিষ্ট ব্যক্তি” অর্থ-\n(ক) 	কোনো কোম্পানি, ফার্ম, ব্যক্তিসংঘ, ট্রাস্ট বা তহবিল;\n(খ) 	পাবলিক-প্রাইভেট পার্টনারশীপ;"
                "\n(গ) 	কোনো বিদেশি ঠিকাদার, বিদেশি এন্টারপ্রাইজ বা বাংলাদেশের বাহিরে প্রতিষ্ঠিত কোনো সংঘ বা সংস্থা ;\n(ঘ) 	কোনো হাসপাতাল, ক্লিনিক বা ডায়াগনস্টিক সেন্টার;\n(ঙ)	বার্ষিক এক কোটি টাকার অধিক টার্নওভার বিশিষ্ট কোনো ই-কমার্স প্লাটফর্ম, যাহা অন্য কোনো নির্দিষ্ট ব্যক্তি নহে, যে নামেই অভিহিত হউক না কেন;\n (চ) 	বার্ষিক ১ (এক) কোটি টাকার অধিক টার্নওভার বিশিষ্ট হোটেল, কমিউনিটি সেন্টার, ট্রান্সপোর্ট এজেন্সি:\n(ছ) 	কৃষক নহেন এইরূপ কোনো ব্যক্তি যিনি তামাক পাতা, সিগারেট, বিড়ি, জর্দা, গুল ও অন্যান্য তামাক জাতীয় পণ্য উৎপাদন এবং সরবরাহে জড়িত ;\n (৪)	“পরিশোধ” বলিতে স্থানান্তর, ক্রেডিট, পরিশোধের সমন্বয় বা কোনো পরিশোধ করিবার আদেশ বা নির্দেশ অন্তর্ভুক্ত হইবে;\n (৫)	“ভিত্তিমূল্য” বলিতে নিম্নবর্ণিত ৩ (তিন) টি বিষয়ের মধ্যে যাহা অধিক তাহাকে বুঝাইবে-\n (অ) 	চুক্তি মূল্য;\n(আ) 	বিল বা ইনভয়েসের অঙ্ক; বা\n(ই) 	পরিশোধ।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
