import 'package:flutter/material.dart';

class dhara_295 extends StatefulWidget {
  const dhara_295({super.key});

  @override
  State<dhara_295> createState() => _dhara_295State();
}

class _dhara_295State extends State<dhara_295> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "আপিল বিভাগে আপিল ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                " (১) ধারা ২৯৪ এর অধীন হাইকোর্ট বিভাগ কর্তৃক প্রদত্ত কোনো রায়ের ক্ষেত্রে, হাইকোর্ট বিভাগ যদি উক্ত রায় আপিল বিভাগে আপিলযোগ্য মর্মে প্রত্যয়ন করে, তাহা হইলে সেইক্ষেত্রে আপিল করা যাইবে। \n(২) হাইকোর্ট বিভাগ কত Code of Civil Procedure 1908 (Act No. V of 1908) এর বিধানাবলি ডিক্রির ক্ষেত্রে যেইভাবে প্রয়োগ করা হয়, আপিল বিভাগে এই ধারার অধীন বর্ণিত আপিলের ক্ষেত্রে উক্ত বিধানাবলি যতদূর সম্ভব, সেইভাবে প্রয়োগযোগ্য হইবে: তবে শর্ত থাকে যে, এই ধারার কোনো কিছুই ধারা ২৯৪ এর উপ-ধারা (২) বা (৪) এর বিধানাবলিকে প্রভাবিত করিয়াছে মর্মে ব্যক্ত হইবে না: আরও শর্ত থাকে যে, আপিল বিভাগের আদেশ হিসাবে যে ব্যয়াদি অনুমোদিত হয়, তদসংক্রান্ত আদেশ বা¯বÍ ায়নের নিমিত্ত আনীত দায়েরকৃ ত পিটিশন হাইকোর্ট বিভাগ উহার অধস্তন যেকোনো আদালতে সরবরাহ করিতে পারিবে। \n(৩) যেইক্ষেত্রে এই ধারার অধীন হাইকোর্ট বিভাগের প্রদত্ত রায় পরিবর্তিত হয়, সেইক্ষেত্রে ধারা ২৯৪ এর উপ-ধারা (২) ও (৪) এ বর্ণিত হাইকোর্ট বিভাগের রায় কার্যকর করিবার যে পদ্ধতি অনুসরণ করা হয় সেই একই পদ্ধতিতে আপিল বিভাগের আদেশের কার্যকারিতা প্রদান করিতে হইবে। \n(৪) ব্যয় এবং কর পরিশোধ সংক্রান্ত ধারা ২৯৪ এর উপ-ধারা (৩) ও (৪) এর বিধানাবলি হাইকোর্ট বিভাগে রেফারেন্স মামলায় ধারা ২৯৪ এর অধীন যেভাবে প্রয়োগ হয়, আপিল বিভাগে আপিলের ক্ষেত্রেও উক্ত বিধানসমূহ সমভাবে প্রয়োগযোগ্য হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
