import 'package:flutter/material.dart';

class dhara_288 extends StatefulWidget {
  const dhara_288({super.key});

  @override
  State<dhara_288> createState() => _dhara_288State();
}

class _dhara_288State extends State<dhara_288> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "আপিল নিষ্পত্তির ক্ষেত্রে অনুসরণীয় পদ্ধতি ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) আপিল আয়কর কর্তৃপক্ষ আপিল শুনানির জন্য তারিখ ও স্থান নির্ধারণ করিবেন, এবং তৎসম্পর্কিত একটি নোটিশ আপিলকারী ও সংশ্লিষ্ট উপকর কমিশনারকে প্রদান করিবেন। \n  (২) আপিলকারী এবং উপকর কমিশনার ব্যক্তিগতভাবে বা প্রতিনিধির মাধ্যমে আপিল শুনানিতে অংশগ্রহণের অধিকার সংরক্ষণ করিবেন। \n (৩) আপিল আয়কর কর্তৃপক্ষ প্রয়োজন বিবেচনা করিলে, সময় সময়, আপিল শুনানি মুলতবি রাখিতে পারিবেন।\n(৪) আপিল আয়কর কর্তৃপক্ষ শুনানিকালে বা তৎপূর্বে আবেদনে উপস্থাপিত কারণ ছাড়াও আপিলের অন্যান্য কারণ অন্তর্ভুক্ত করিবার অনুমতি প্রদান করিতে পারিবে,  যদি কর্তৃপক্ষ এই মর্মে সন্তুষ্ট হয় যে, আপিল আবেদন ফরমে ইচ্ছাকৃতভাবে এইরূপ কারণসমূহ বাদ দেওয়া হয় নাই এবং উক্তরূপ বাদ পড়া অযৌক্তিক ছিল না। \n(৫) আপিল আয়কর কর্তৃপক্ষ আপিল নিষ্পত্তির পূর্বে যেইরূপ উপযুক্ত বিবেচনা করিবে সেইরূপ তদন্ত সম্পাদন করিতে পারিবে অথবা প্রয়োজন বিবেচনা করিলে আপিলের কারণ সম্পকির্ত তথ্যাদি তলব করিতে পারিবে অথবা উপকর কমিশনার কর্তৃক বিষয়টি সম্পর্কে অধিকতর তদন্ত সম্পাদনের ব্যবস্থা করিতে পারিবে। \n(৬) আপিল আয়কর কর্তৃপক্ষ আপিল শুনানি চলাকালে এইরূপ কোনো দলিলাদি বা সাক্ষ্য- প্রমাণ গ্রহণ করিতে পারিবেন না, যাহা উপকর কমিশনারের নিকট সময়মত উপস্থাপন করা হয় নাই, যদি না তাহার নিকট সšোÍ ষজনকভাবে প্রতীয়মান হয় যে, এইরূপ দলিলাদি বা সাক্ষ্য প্রমাণ যুক্তিসঙ্গত কারণে উপকর কমিশনারের নিকট উপস্থাপন করা সম্ভব ছিল না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
