import 'package:flutter/material.dart';

class dhara_291 extends StatefulWidget {
  const dhara_291({super.key});

  @override
  State<dhara_291> createState() => _dhara_291State();
}

class _dhara_291State extends State<dhara_291> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "আপিল ট্রা ইব্যুনালে আপিল",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যদি কোনো করদাতা ধারা ২৭২ অথবা ২৮৯ এর অধীন, অতিরিক্ত কর কমিশনার (আপিল) বা, ক্ষেত্রমত, কমিশনার (আপিল) কর্তৃক জারীকৃত আদেশে সংক্ষুদ্ধ হন, তাহা হইলে তিনি আপিল ট্রাইব্যুনালে আপিল করিতে পারিবেন।\n(২) করদাতা, অতিরিক্ত কর কমিশনার (আপিল) বা, ক্ষেত্রমত, কমিশনার (আপিল) এর আদেশের ভিত্তিতে ধার্যকৃত কর, এবং ধারা ১৭৩ অনুসারে পরিশোধযোগ্য      করের মধ্যকার যে পার্থক্য হইবে, তাহার ১০% (দশ শতাংশ), কর পরিশোধ না করিয়া থাকিলে, অতিরিক্ত কর কমিশনার (আপিল) বা, ক্ষেত্রমত, কমিশনার (আপিল) কর্তৃক প্রদত্ত আদেশের বিরুদ্ধে উপ-ধারা (১) এর অধীন কোনো আপিল দায়ের করিতে পারিবেন না। \n(৩) আপিলকারীর আবেদনের প্রেক্ষিতে কর কমিশনার, আবেদনে উল্লিখিত কারণ তাহার নিকট সন্তোষজনক প্রতীয়মান হইলে, উপ-ধারা (২) এর অধীন পরিশোধের বাধ্যবাধকতা শিথিল করিতে পারিবেন এবং আবেদন প্রাপ্তির ৩০ (ত্রিশ) দিনের মধ্যে তিনি যেইরূপ উপযুক্ত বিবেচনা করিবেন সেইরূপ আদেশ প্রদান করিবেন। \n(৪) উপকর কমিশনার কর কমিশনারের পূর্বানুমোদন গ্রহণপূর্বক ধারা ২৮৯ এর অধীন অতিরিক্ত কর কমিশনার (আপিল) বা, ক্ষেত্রমত, কমিশনার (আপিল) কর্তৃক প্রদত্ত আদেশের বিরুদ্ধে আপিল ট্রাইব্যুনালে আপিল দায়ের করিতে পারিবেন। \n(৫) যে আদেশের বিরুদ্ধে আপিল দায়ের করা হইবে সেই আদেশ সম্পর্কে করদাতা অথবা, ক্ষেত্রমত, কমিশনারকে অবহিত করিবার পরবর্তী ৬০ (ষাট) দিনের মধ্যে উপ-ধারা (১) অথবা উপ- ধারা (৩) এর অধীন প্রত্যেক আপিল দাখিল করিতে হইবে: তবে শর্ত থাকে যে, নির্ধারিত ৬০ (ষাট) দিনের মধ্যে আপিল দায়ের করিতে ব্যর্থ হইলেও, যদি আপিল ট্রা ইব্যুনাল এই মর্মে সন্তুষ্ট হন যে, উক্ত ব্যর্থতার জন্য পর্যাপ্ত কারণ বিদ্যমান ছিল, তাহা হইলে উক্ত মেয়াদপূর্তির পরও উক্ত আপিল গৃহীত হইবে। \n(৬) নির্ধারিত ফরমে এবং পদ্ধতিতে প্রতিপাদনপূর্বক আপিল ট্রাইব্যুনালে আপিল দায়ের করিতে হইবে এবং উপ-ধারা (২) এর ক্ষেত্র ব্যতীত, অন্যান্য ক্ষেত্রে উত্থাপিত আপিল আবেদনের সহিত ১ (এক) হাজার টাকা ফি প্রদান করিতে হইবে। \n(৭) বোর্ড, সরকারি গেজেটে প্রজ্ঞাপন দ্বারা,-\n(ক) ইলেক্ট্রনিক্যালি বা অন্য কোনো যন্ত্রে পাঠযোগ্য বা কম্পিউটারে পাঠযোগ্য মাধ্যমে আপিল দায়েরের ক্ষেত্রসমূহ নির্ধারণ করিতে পারিবে; এবং\n(খ) উক্ত আপিল দায়ের করিবার ফরম ও পদ্ধতি নির্ধারণ করিতে পারিবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
