import 'package:flutter/material.dart';

class dhara_292 extends StatefulWidget {
  const dhara_292({super.key});

  @override
  State<dhara_292> createState() => _dhara_292State();
}

class _dhara_292State extends State<dhara_292> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "আপিল ট্রা ইব্যনুাল কর্তৃক আপিল নিষ্পত্তি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "( ১ ) আপিল ট্রাইব্যনুাল আপিল মামলার উভয় পক্ষকে শুনানির সুযোগ প্রদানের পর আপিলটির ক্ষেত্রে যেইরূপ যথাযথ বিবেচনা করিবে সেইরূপ আদেশ প্রদান করিবে।\n(২) কোনো আপিল নিষ্পত্তির প্রাক্কালে আপিল ট্রাইব্যুনাল আপিল সংক্রান্ত যেকোনো তথ্য তলব করিতে পারিবে অথবা উপকর কমিশনার কর্তৃক এতদ্বিষয়ে অধিকতর তদন্তের ব্যবস্থা গ্রহণ করিতে পারিবে। \n(৩) যেইক্ষেত্রে আপিল মামলার কারণে কোনো ফার্ম বা ব্যক্তিসংঘের কর নির্ধারণী আদেশে কোনো পরিবর্তন আনীত হয়, অথবা ফার্ম বা ব্যক্তিসংঘের কর নির্ধারণী আদেশ নূতনভাবে করিতে হয়, সেইক্ষেত্রে আপিল ট্রাইব্যুনাল কর্তৃক আনীত উক্ত পরিবর্তন মোতাবেক উপকর কমিশনারকে উক্ত ফার্মের অংশীদার বা ব্যক্তিসংঘের সংশ্লিষ্ট কর নির্ধারণী সংশোধনের নির্দেশ প্রদান করিবে। \n(৪) কোনো আপিল মামলা নিষ্পত্তির ক্ষেত্রে আপিল ট্রাইব্যুনাল তৎকর্তৃক জারীকৃত আদেশ প্রদানের ৩০ (ত্রিশ) দিনের মধ্যে উক্ত আদেশটি আপিলকারীকে এবং কমিশনারকে অবহিত করিবেন। \n(৫) এই অধ্যায়ে বর্ণিত ক্ষেত্র ব্যতীত আপিল ট্রাইব্যনুাল কর্তৃক কোনো আপিলের বিষয়ে প্রদত্ত আদেশ চূড়ান্ত বলিয়া গণ্য হইবে। \n(৬) এই আইনে যাহা কিছুই থাককু না কেন, কোনো করদাতা কর্তৃক আপিল ট্রাইব্যুনালে আপিল আবেদন দাখিল করা হইলে, যে মাসে উহা দাখিল করা হইয়াছে, তৎপরবর্তী ১৮০ (একশত আশি) দিন অতিবাহিত হইবার পূর্বে আপিল ট্রাইব্যুনাল উক্ত আপিলের উপর কোনো আদেশ প্রদানে ব্যর্থ হইলে, আপিলটি অনুমোদিত হইয়াছে মর্মে গণ্য করা হইবে এবং যেইক্ষেত্রে ২ (দুই) সদস্য বিশিষ্ট আপিল ট্রা ইব্যুনাল মামলা শুনানি করেন এবং সিদ্ধান্তের ক্ষেত্রে দ্বিমত পোষণের কারণে একজন অতিরিক্ত সদস্য নিয়োগ করা হইলে, উক্ত মেয়াদ হইবে যেই মাসে আপিল দাখিল করা হইয়াছে, তৎপরবর্তী  ২৪০ (দুইশত চল্লিশ) দিন ।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
