import 'package:flutter/material.dart';

class dhara_285 extends StatefulWidget {
  const dhara_285({super.key});

  @override
  State<dhara_285> createState() => _dhara_285State();
}

class _dhara_285State extends State<dhara_285> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "২৮৫। কমিশনারের রিভিশনের ক্ষমতা। -",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কমিশনার করদাতার আবেদনের প্রেক্ষিতে, এই আইনের অধীন তাহার অধীক্ষেত্রাধীন অধস্তন কোনো কর্তৃপক্ষ কর্তৃক কোনো কার্যক্রমের প্রেক্ষিতে প্রদত্ত আদেশের রেকর্ডপত্র তলব করিতে পারিবেন এবং যেইরূপ প্রয়োজনীয় বিবেচনা করিবেন সেইরূপ অনুসন্ধান করিয়া বা করিবার ব্যবস্থা গ্রহণের পর এই আইনের বিধানাবলি সাপেক্ষে, তৎসম্পর্কে যেইরূপ উপযুক্ত বিবেচনা করিবেন সেইরূপ আদেশ জারি করিতে পারিবেন, তবে করদাতার স্বার্থের হানিকর কোনো আদেশ জারি করা যাইবে না। \n(২) এই আইনের অধীন কমিশনারের অধীক্ষেত্রাধীন অধস্তন কোনো কর্তৃপক্ষ কর্তৃক প্রদত্ত আদেশ রিভিশনের আবেদন এইরূপ আদেশ করদাতার অবহিত হইবার ৬০ (ষাট) দিনের মধ্যে অথবা উক্ত ৬০ (ষাট) দিনের মধ্যে আবেদন দাখিল করিতে না পারিবার যুক্তিসঙ্গত কারণ ছিল মর্মে সন্তুষ্ট হইয়া কমিশনার কর্তৃক কোনো সময় বর্ধিত করা হইলে উক্তরূপ বর্ধিত সময়ের মধ্যে দাখিল করিতে হইবে। \n(৩) কমিশনার উপ-ধারা (১) এর অধীন তাহার ক্ষমতা নিম্নবর্ণিত ক্ষেত্রে প্রয়োগ করিবেন না, যথা:-\n(ক) যেইক্ষেত্রে অতিরিক্ত কর কমিশনার (আপিল) বা কমিশনার (আপিল) এর নিকট বা আপিল ট্রাইব্যনুালে আপিল করা হয় এবং যদি এইরূপ আপিলের সময় উত্তীর্ণ না হয় অথবা করদাতা তাহার আপিল করিবার অধিকার পরিত্যাগ না করেন; এবং \n(খ) যেইক্ষেত্রে অতিরিক্ত কর কমিশনার (আপিল) বা কমিশনার (আপিল) বা আপিল ট্রাইব্যুনালের নিকট আপিলের বিষয়ে আদেশ অপেক্ষমান। (৪) উপ-ধারা (১) এর অধীন কোনো আবেদন বিবেচিত হইবে না, যদি না- \n    (ক) আবেদনের সহিত ২০০ (দুইশত) টাকা ফি প্রদান করা হয়; এবং \n  (খ) অবিতর্কিত করের অংশ পরিশোধ করা হয়। ব্যাখ্যা।- “অবিতর্কিত করের অংশ” অর্থ ধারা ১৭৩ এর অধীন পরিশোধযোগ্য কর।\n    (৫) এই ধারার উদ্দেশ্যপূরণকল্পে, কমিশনার কর্তৃক অসম্মতি জ্ঞাপনসূচক কোনো আদেশ করদাতার স্বার্থের হানিকর হিসাবে জারি করা হইবে না। \n(৬) এই আইনে যাহা কিছুই থাককু না কেন, উপ-ধারা (১) এর অধীন কোনো রিভিশনের আবেদন করা হইলে যদি কমিশনার উক্ত আবেদন দাখিলের তারিখ হইতে ৬০ (ষাট) দিনের মধ্যে এতদ্বিষয়ে কোনো আদেশ প্রদানে ব্যর্থ হন, তবে উক্ত রিভিশন অনুমোদিত হইয়াছে মর্মে গণ্য হইবে। \n(৭) এই ধারার উদ্দেশ্যপূরণকল্পে, অতিরিক্ত কর কমিশনার (আপিল) সেই কর কমিশনারের অধস্তন কর্তৃপক্ষ হিসাবে গণ্য হইবেন যাহার অধস্তন উপকর কমিশনার দ্বারা পুনর্বিবেচনাধীন আপিলের বিষয়বস্তু আদেশ প্রদত্ত হইয়াছে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
