import 'package:flutter/material.dart';

class dhara_302 extends StatefulWidget {
  const dhara_302({super.key});

  @override
  State<dhara_302> createState() => _dhara_302State();
}

class _dhara_302State extends State<dhara_302> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "বিকল্প বিরোধ নিষ্পত্তির মাধ্যমে কর বিরোধ নিষ্পত্তির পদ্ধতি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) বিকল্প বিরোধ নিষ্পত্তির আবেদন প্রাপ্তির পর, সহায়তাকারী আবেদনের একটি অনুলিপি সংশ্লিষ্ট উপকর কমিশনারের নিকট প্রেরণ করিবেন এবং উক্ত বিষয়ে এবং ধারা ২৯৮ এর শর্তাবলি প্রতিপালিত হইয়াছে কিনা তৎমর্মে সেই বিষয়ে তাহার মতামত তলব করিবেন। \n(২) যদি উপকর কমিশনার, উপ-ধারা (৩) এর দফা (গ)-এ উল্লিখিত অনুলিপি প্রাপ্তির পর, ৫ (পাঁচ) কার্যদিবসের মধ্যে শর্তপূরণ সম্পর্কে তাহার মতামত প্রদানে ব্যর্থ হন, তাহা হইলে সহায়তাকারী আবেদনে উল্লিখিত শর্তা দি প্রতিপালিত হইয়াছে মর্মে গণ্য করিতে পারিবেন। \n(৩) সহায়তাকারী-\n    (ক) আবেদনকারী এবং কর কমিশনার বা কমিশনারের প্রতিনিধিকে নোটিশে উল্লিখিত তারিখে বিরোধ নিষ্পত্তির সভায় অংশগ্রহণের জন্য লিখিতভাবে অবহিত করিতে পারিবেন; \n(খ) প্রয়োজন বিবেচনা করিলে, সময় সময়, সভা মুলতুবি করিতে পারিবেন; \n(গ) বিরোধ নিষ্পত্তির উদ্দেশ্যে সভার পূর্বে বা সভায় উপকর কমিশনার বা আবেদনকারীর নিকট হইতে দলিল বা সাক্ষ্য-প্রমাণ তলব করিতে পারিবেন; এবং \n    (ঘ) উপযুক্ত বিবেচনা করিলে, আবেদন নিষ্পত্তির পূর্বে কোনো আয়কর কর্তৃপক্ষ দ্বারা অনুসন্ধান করাইতে পারিবেন। \n(৪) সহায়তাকারী আবেদনকারী করদাতাকে এবং কমিশনারের প্রতিনিধিকে আলোচনা এবং সভার মাধ্যমে বিরোধ নিষ্পত্তির উদ্দেশ্যে সম্মত হইবার জন্য সহায়তা প্রদান করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
