import 'package:flutter/material.dart';

class dhara_298 extends StatefulWidget {
  const dhara_298({super.key});

  @override
  State<dhara_298> createState() => _dhara_298State();
}

class _dhara_298State extends State<dhara_298> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " বিকল্প বিরোধ নিষ্পত্তির প্রয়োগ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) উপ-ধারা (৪) এর বিধান সাপেক্ষে, একজন করদাতা আপিল আয়কর কর্তৃপক্ষ বা কর আপিল ট্রাইব্যুনাল বা সুপ্রীম কোর্টের যেকোনো বিভাগে নিষ্পন্নাধীন বিরোধ, বিকল্প বিরোধ নিষ্পত্তি প্রক্রিয়ার মাধ্যমে নিষ্পত্তির জন্য আবেদন করিতে পারিবেন। \n(২) সুপ্রীম কোর্টের যেকোনো বিভাগে কোনো বিরোধ নিষ্পন্নাধীন থাকিলে,  করদাতাকে উপ- ধারা (১) এর অধীন আবেদন দাখিলের পূর্বে আদালতের অনুমতি গ্রহণ করিতে হইবে: তবে শর্ত থাকে যে, কোনো বিরোধ লইয়া রিট করা হইলে উক্ত বিরোধ বিকল্প বিরোধ নিষ্পত্তি প্রক্রিয়ার মাধ্যমে নিষ্পত্তি করা যাইবে না। \n(৩) বিকল্প বিরোধ নিষ্পত্তির আবেদন- \n(ক) নির্ধারিত ফরমে, সময়ে এবং ফি প্রদানপূর্বক প্রত্যয়ন করিয়া দাখিল করিতে হইবে; \n    (খ) সংশ্লিষ্ট আপিল আয়কর কর্তৃপক্ষ বা কর আপিল ট্রাইব্যুনাল বা, ক্ষেত্রমত, সুপ্রীম কোর্টের রেজিস্ট্রার বরাবর দাখিল করিতে হইবে।\n(৪) করদাতা আবেদনপত্রের সহিত সংশ্লিষ্ট কাগজপত্র, দলিলাদি এবং আইনগত ভিত্তি ও প্রকৃত ঘটনা সম্বলিত বিবৃতি দাখিল করিবেন। \n(৫) কোনো করদাতা কোনো আয়বর্ষের রিটার্ন দাখিল করিয়া থাকিলে, তিনি বিকল্প বিরোধ নিষ্পত্তির আবেদন দাখিলের যোগ্য হইবেন না যদি না উক্ত আয়বর্ষে ধারা ১৭৩ এর অধীন প্রদেয় কর পরিশোধ না করিয়া থাকেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
