import 'package:flutter/material.dart';

class dhara_304 extends StatefulWidget {
  const dhara_304({super.key});

  @override
  State<dhara_304> createState() => _dhara_304State();
}

class _dhara_304State extends State<dhara_304> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "বিকল্প বিরোধ নিষ্পত্তি প্রক্রিয়ার সিদ্ধান্ত",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে উভয় পক্ষ এই আইনের আওতাধীন বিরোধ সংক্রান্ত কোনো ঘটনা বা আইনিভাবে বিরোধপূর্ণ বিষয়ে উক্তকমত্য পোষণ করেন, সেইক্ষেত্রে মতৈক্যের ভিত্তিতে বিরোধপূর্ণ বিষয়টি আংশিক বা সম্পূর্ণভাবে বিকল্প বিরোধ নিষ্পত্তি প্রক্রিয়ার মাধ্যমে নিষ্পত্তি করা যাইবে। \n(২) যেইক্ষেত্রে করদাতা এবং কর কমিশনারের প্রতিনিধির মধ্যে বিরোধ নিষ্পত্তির আংশিক বা সম্পূর্ণ মতৈক্য হয়, সেইক্ষেত্রে সহায়তাকারী, নির্ধারিত পদ্ধতিতে, মতৈক্যের বিস্তারিত তথ্য নির্ধারিত পদ্ধতিতে লিপিবন্ধ করিবেন। \n(৩) উক্ত মতৈক্যের রেকর্ডে যেকোনো প্রদেয় বা প্রত্যার্পনযোগ্য কর এবং অন্যান্য প্রয়োজনীয় ও উপযুক্ত বিষয়াদিসহ মতৈক্যের শর্তাবলির বর্ণনা থাকিবে, এবং মতৈক্যের ভিত্তিতে ন্যায্য পাওনা পরিশোধের পদ্ধতি এবং সহায়তাকারী যেইরূপ উপযুক্ত বিবেচনা করিবেন সেইরূপ অন্যান্য বিষয়েরও উল্লেখ থাকিবে।\n(৪) যদি পরবর্তীতে উদঘাটিত হয় যে, প্রতারণা ও অসত্য তথ্য উপস্থাপনের মাধ্যমে মতৈক্য প্রক্রিয়া সম্পন্ন হইয়াছে, তাহা হইলে তাহা বাতিল হইবে।\n        (৫) করদাতা, কমিশনারের প্রতিনিধি এবং সহায়তাকারী মতৈক্যে স্বাক্ষর প্রদান করিবেন।\n(৬) যেইক্ষেত্রে আবেদনকারী করদাতা এবং সংশ্লিষ্ট কমিশনারের প্রতিনিধির মধ্যে যেকোনো পক্ষের অসহযোগিতার কারণে আংশিক বা সম্পূর্ণভাবে কোনো মতৈক্যে পৌঁছানো সম্ভবপর না হয়, বা বিরোধ নিষ্পত্তির ক্ষেত্রে মতভেদ সৃষ্টি হয়, সেইক্ষেত্রে সহায়তাকারী, কারণসমূহ লিপিবদ্ধ করিয়া, মতভেদ হইবার ১৫ (পনেরো) দিনের মধ্যে আবেদনকারী, বোডর্, সংশ্লিষ্ট আদালত, ট্রাইব্যুনাল, আপিল কর্তৃপক্ষ এবং, ক্ষেত্রমত, আয়কর কর্তৃপক্ষকে উক্ত অসফল বিরোধ নিষ্পত্তি সম্পর্কে অবহিত করিবেন।\n(৭) যেইক্ষেত্রে পাওনা আদায় ও প্রত্যার্পনের পন্থা ও সময় নির্ধারণ করিয়া মতৈক্য হয় এবং তাহা যথাযথভাবে লিপিবব্ধ ও স্বাক্ষরিত হয়, সেইক্ষেত্রে সহায়তাকারী, এই আইনের বিধানাবলি পরিপালন করিয়া, মতৈক্য অনুসারে, উহা করদাতা এবং সংশ্লিষ্ট উপকর কমিশনারকে অবহিত করিবেন। \n    (৮) যদি সহায়তাকারী, যে মাসে আবেদন করা হইয়াছিল সেই মাস সমাপ্ত হইবার পরবর্তী ৩ (তিন) মাসের মধ্যে, মতৈক্যে উপনীত হইতে ব্যর্থ হন, তাহা হইলে কোনো মতৈক্য হয় নাই বলিয়া গণ্য হইবে। \n(৯) যেইক্ষেত্রে সফল মতৈক্য হয়, সেইক্ষেত্রে সহায়তাকারী মতৈক্যের অনুলিপি উপ-ধারা (৬)-এ উল্লিখিত সকল পক্ষের নিকট, যেই তারিখে সহায়তাকারী এবং পক্ষগণ মতৈক্যে স্বাক্ষর করিয়াছেন সেই তারিখ হইতে ১৫ (পনেরো) দিনের মধ্যে, প্রেরণ করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
