import 'package:flutter/material.dart';

class dhara_191 extends StatefulWidget {
  const dhara_191({super.key});

  @override
  State<dhara_191> createState() => _dhara_191State();
}

class _dhara_191State extends State<dhara_191> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "বন্ধ ব্যবসার ক্ষেত্রে কর নির্ধারণ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) ধারা ১৮৯ এর বিধান ব্যতিরেকে, যেইক্ষেত্রে কোনো অর্থবর্ষে কোনো ব্যবসা বন্ধ হয়, সেইক্ষেত্রে উক্ত বৎসরের কর নির্ধারণ করা যাইবে।\n(২) উপ-ধারা (১) এর অধীন কোনো আয়বর্ষের কর নির্ধারণের ক্ষেত্রে যে আয়বর্ষে ব্যবসা বন্ধ হইয়াছে সেই আয়বর্ষের শুরু হইতে যেই তারিখে ব্যবসা বন্ধ হইয়াছে সেই সময়ের জন্য আয় পরিগণনা করা হইবে।\n(৩) কোনো অর্থবৎসরে কোনো ব্যবসা বন্ধ হইলে তাহা ব্যবসা বন্ধ হইবার ১৫ (পনেরো) দিনের মধ্যে উপকর কমিশনারকে নোটিশ প্রদান করিতে হইবে এবং নোটিশের সহিত আয়বর্ষ শেষের তারিখ হইতে যে তারিখে ব্যবসা বন্ধ হইয়াছে সে সময়কাল পর্যন্ত আয়ের রিটার্ন দাখিল করিতে হইবে, তবে এইক্ষেত্রে উক্ত সময়ের জন্য আয়ের ক্ষেত্রে অর্থবৎসর ই করবর্ষ হিসাবে গণ্য হইবে।\n (৪) উপ-ধারা (৩) এর অধীন নোটিশ প্রদানে ব্যর্থতায় উপকর কমিশনার ব্যবসা বন্ধের তারিখ পর্যন্ত সময়ের জন্য কোনো অঙ্ক জরিমানা হিসাবে আদায় করিবার নির্দেশ প্রদান করিতে পারেন, তবে এই জরিমানার অঙ্ক অব্যবহিত পূর্বের করবর্ষের করের অঙ্ক অপেক্ষা অধিক হইবে না।\n(৫) 	উপ-ধারা (১) এর অধীন কর নির্ধারণ করিবার ক্ষেত্রে উপকর কমিশনার\n (ক)	যে ব্যক্তির কর নির্ধারণ হইবে তাহার;\n (খ)	ফার্মের ক্ষেত্রে ব্যবসা বন্ধের সময় যিনি ফার্মের অংশীদার ছিলেন। তাহার; এবং\n (গ)	কোম্পানির ক্ষেত্রে কোম্পানির প্রধান কর্মচারীরÑ উপর নোটিশ জারি করিয়া কমপক্ষে ৭ (সাত) দিন সময় প্রদান করিয়া ধারা ১৬৯ অনুসারে রিটার্ন দাখিলের ক্ষেত্রে প্রযোজ্য বিবরণী এবং তথ্যসহ নোটিশে বর্ণিত বিবরণী, রেকর্ড এবং দলিলাদি সংযুক্ত করিয়া রিটার্ন দাখিলের নির্দেশ প্রদান করিতে পারিবেন।\n(৬) কর নির্ধারণের উদ্দেশ্যে উপ-ধারা (৫) এর অধীন প্রদত্ত নোটিশ ধারা ১৭২ এর অধীন নোটিশ হিসাবে গণ্য হইবে এবং এই আইনের বিধানাবলি যতটুকু প্রযোজ্য ততটুকু প্রয়োগ হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
