import 'package:flutter/material.dart';

class dhara_181 extends StatefulWidget {
  const dhara_181({super.key});

  @override
  State<dhara_181> createState() => _dhara_181State();
}

class _dhara_181State extends State<dhara_181> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "রিটার্ন প্রসেস",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) ধারা ১৮০ এর অধীন দাখিলকৃত “স্বনির্ধারণী রিটার্ন” বা সংশোধিত রিটার্ন উপকর কমিশনার নিম্নবর্ণিত পদ্ধতিতে প্রসেস করিবেন, যথা:-\n(ক)	দাখিলকৃত রিটার্নে কোনো গাণিতিক ত্রæটি অথবা উক্ত রিটার্নে বা রিটার্নের সহিত দাখিলকৃত কোনো বিবৃতি বা দলিলাদিতে বিদ্যমান কোনো তথ্যের আলোকে কোনো অশুদ্ধ দাবি পরিলক্ষিত হইলে উহা সমন্বয়পূর্বক আয় পরিগণনা করিতে হইবে;\n (খ) 	এই আইনের অধীন প্রদেয় কর এবং অন্য কোনো অঙ্ক দফা (ক) এর ভিত্তিতে পরিগণনা করিতে হইবে; এবং\n(গ) 	উৎস করসহ পরিশোধিত অগ্রিম কর এবং এই আইনের অধীন পরিশোধিত করের ক্রেডিট প্রদান করিয়া প্রদেয় বা প্রত্যর্পণযোগ্য কর নির্ধারণ করিতে হইবে।\n (২) রিটার্ন প্রসেসের ফলশ্রæতিতে আয়, কর বা অন্যান্য উল্লেখযোগ্য অঙ্কের পরিমাণের সহিত ধারা ১৮০ এর অধীন দাখিলকৃত “স্বনির্ধারণী রিটার্ন” বা সংশোধিত রিটার্নে প্রদর্শিত অঙ্কের পার্থক্য হইলে উপকর কমিশনার নিম্নবর্ণিতভাবে করদাতাকে লিখিত নোটিশ প্রদান করিবেন, যথা:-\n(ক)	রিটার্ন প্রসেসের ফলশ্রæতিতে পরিগণিত আয়, কর, প্রত্যর্পণযোগ্য কর বা অন্যান্য সংশ্লিষ্ট বিষয়াদি সংবলিত পরিগণনা পত্র নোটিশের সহিত সংযুক্ত করিয়া পার্থক্যের পরিমাণ করদাতাকে অবহিত করিবেন;\n (খ) 	নোটিশে উল্লিখিত সময়ের মধ্যে রিটার্ন প্রসেস প্রক্রিয়ায় উদ্ভূত অতিরিক্ত দায় বা প্রত্যর্পণ হ্রাস সম্পর্কে লিখিতভাবে করদাতার অবস্থান ব্যাখ্যা করিবার সুযোগ প্রদান করিবেন; এবং\n(গ)	নোটিশে উল্লিখিত সময়ের মধ্যে, প্রযোজ্য ক্ষেত্রে, তাহাকে নিম্নবর্ণিত সুযোগ প্রদান করিবেন, যথা:-\n (অ)	নোটিশে উল্লিখিত পার্থক্য নিরসনক্রমে সংশোধিত রিটার্ন দাখিল করিবার; এবং\n(আ) 	উক্ত প্রসেসের ফলে প্রদেয় কর এবং অন্যান্য প্রদেয় অঙ্ক পরিশোধ করিবার।\n (৩) যেইক্ষেত্রে উপ-ধারা (২) এর অধীন নোটিশ প্রদান করা হয়, সেইক্ষেত্রে উপকর কমিশনারÑ\n(ক) 	নিম্নবর্ণিত শর্তাদি পূরণ সম্পর্কে নিশ্চিত হইয়া ৯০ (নব্বই) দিনের মধ্যে সংশোধিত রিটার্নের গ্রহণপত্র প্রেরণ করিবেন, যথা:-\n (অ) 	উপ-ধারা (২) এর দফা (গ) এর বিধান অনুসারে সংশোধিত রিটার্ন দাখিল করা হইয়াছে কিনা;\n (আ) 	প্রসেসের ফলশ্রæতিতে এই আইনের অধীন প্রদেয় কোনো কর বা অন্যান্য অঙ্ক সংশোধিত রিটার্ন জমাকালে বা তাহার পূর্বে পরিশোধ করা হইয়াছে কিনা; এবং\n (ই) 	উপ-ধারা (২) এ উল্লিখিত পার্থক্যটির রিটার্নে যথোচিত সুরাহা হইয়াছে কিনা;\n (খ)	দফা (ক)-তে উল্লিখিত কোনো শর্ত পূরণ করা না হইলে, উপ-ধারা (২) এর অধীন প্রদত্ত নোটিশে উল্লিখিত তারিখ উত্তীর্ণ হইবার পরবর্তীতে আয়, কর, প্রত্যর্পণযোগ্য কর বা অন্যান্য সংশ্লিষ্ট বিষয়াদি সংবলিত পরিগণনা পত্রসহ একটি দাবির নোটিশ জারি করিতে হইবে;\n (গ)	উপ-ধারা (২) এর অধীন নোটিশ প্রদানের তারিখ হইতে ৬ (ছয়) মাসের মধ্যে দফা (খ)-তে উল্লিখিত দাবির নোটিশ জারি করিতে হইবে।\n (৪) এই ধারার উদ্দেশ্যপূরণকল্পে, রিটার্নে বা রিটার্নের সহিত দাখিলকৃত কোনো বিবৃতি বা দলিলাদিতে বিদ্যমান কোনো তথ্যের আলোকে কোনো অশুদ্ধ দাবি অর্থ প্রদত্ত তথ্যের ভিত্তিতে এইরূপ কোনো দাবি, যাহা কোনো রিটার্ন বা কোনো বিবরণী বা দাখিলকৃত দলিলাদি হইতে উদ্ভূত-\n(ক)	কোনো আইটেম, যাহা অন্য কোনো সমজাতীয় এন্ট্রির সহিত সঙ্গতিপূর্ণ নহে, বা অন্য কোনো আইটেম, যাহা রিটার্নের কোনো বিবরণী বা দলিলাদির সহিত অসামঞ্জস্যপূর্ণ; অথবা\n (খ)	কোনো কর্তন, অব্যাহতি, রেয়াত বা ক্রেডিট, যেইক্ষেত্রে অনুমোদিত আইনগত সীমার আর্থিক পরিমাণ, অনুপাত বা ভগ্নাংশ হিসাবে নির্ধারিত কোনো কর্তন অব্যাহতি, রেয়াত বা ক্রেডিট সীমাকে অতিক্রম করে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
