import 'package:flutter/material.dart';

class dhara_185 extends StatefulWidget {
  const dhara_185({super.key});

  @override
  State<dhara_185> createState() => _dhara_185State();
}

class _dhara_185State extends State<dhara_185> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "সাময়িক কর নির্ধারণ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১)উপকর কমিশনার কোনো আয়বর্ষে করদাতার মোট আয়ের উপর সাময়িক কর নির্ধারণ করিতে পারিবেন।\n(২)সাময়িক কর নির্ধারণ নিম্নবর্ণিত সময়ে করা হইবে, যথা:-\n (ক) 	যেইক্ষেত্রে সংশ্লিষ্ট করবর্ষের যেকোনো সময়ে রিটার্ন দাখিল করা হইয়াছে; এবং\n(খ)	যেইক্ষেত্রে করদিবসে বা করদিবসের পূর্ববর্তী কোনো দিনে সংশ্লিষ্ট করবর্ষের রিটার্ন জমা করা হয় নাই।\n(৩) 	সাময়িক কর নির্ধারণ নিম্নবর্ণিত বিষয়ের ভিত্তিতে প্রস্তুত করা হইবে, যথা:-\n (ক) 	উপ-ধারা (২) এর দফা (ক)-তে উল্লিখিত ক্ষেত্রে, রিটার্নের ভিত্তিতে এবং হিসাব ও দলিলাদি, যদি থাকে, তৎসহ;\n(খ)	উপ-ধারা (২) এর দফা (খ)-তে উল্লিখিত ক্ষেত্রে, কোনো সহজলভ্য তথ্য বা উপাদান এবং উপকর কমিশনারের সর্বোত্তম বিচারের ভিত্তিতে।\n (৪) এই ধারার অধীন সাময়িক কর নির্ধারণের ক্ষেত্রে, উপকর কমিশনার নিম্নরূপ কার্যক্রম গ্রহণ করিতে পারিবেন, যথা:-\n(ক)	রিটার্ন, হিসাব এবং দলিলাদির কোনো গাণিতিক ত্রæটি সংশোধন;\n(খ) 	রিটার্ন, হিসাব এবং দলিলাদি হইতে প্রাপ্ত তথ্যের ভিত্তিতে ধারা ৭০ এবং ৭১ এর অধীন কোনো ক্ষতির সমন্বয় এবং জের টানা বা অবচয় ভাতার জের টানা।\n (৫) পরিশোধ এবং পুনরুদ্ধারের ক্ষেত্রে সাময়িক কর নির্ধারণের ভিত্তিতে প্রদেয় কর এইরূপে বিবেচিত হইবে যেন তাহা নিয়মিত কর নির্ধারণের ভিত্তিতে নির্ধারিত হইয়াছে।\n(৬) এই ধারার অধীন করদায় পরিগণনার ক্ষেত্রে নিম্নবর্ণিত অঙ্ক ক্রেডিট প্রদান করা হইবে, যথা:Ñ\n(ক)	কোনো কর যাহা উৎসে কর্তন বা সংগ্রহ করা হইয়াছে এবং সরকারকে প্রদান করা হইয়াছে; এবং\n (খ)	পরিশোধিত কোনো অগ্রিম কর।\n(৭) যেইক্ষেত্রে সাময়িক কর নির্ধারণের মাধ্যমে করদাবির বিপরীতে যেকোনো পরিমাণ অর্থ প্রদান করা হয়, সেইক্ষেত্রে একই করবর্ষের জন্য নিয়মিত কর নির্ধারণের অধীন প্রদেয় কর পরিগণনার ক্ষেত্রে উক্ত পরিমাণে করের ক্রেডিট প্রদান করা হইবে।\n(৮) এই ধারার অধীন কোনো সাময়িক কর নির্ধারণের কারণে কৃত কাজ বা সংক্ষুব্ধতা বা ক্ষতিগ্রস্ততা উহার নিয়মিত কর নির্ধারণের ক্ষেত্রে উত্থাপিত কোনো সমস্যা নিরসনকল্পে গৃহীত উদ্যোগকে অগ্রাহ্য করিবে না।\n(৯) এই ধারার অধীন কৃত সাময়িক কর নির্ধারণের বিরুদ্ধে কোনো আপিল দায়ের করা যাইবে না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
