import 'package:flutter/material.dart';

class dhara_180 extends StatefulWidget {
  const dhara_180({super.key});

  @override
  State<dhara_180> createState() => _dhara_180State();
}

class _dhara_180State extends State<dhara_180> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "স্বনির্ধারণী",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো ব্যক্তি কর্তৃক এই ধারার অধীন কোনো করবর্ষের জন্য “স্বনির্ধারণী রিটার্ন” দাখিল করা হইলে এই আইনের অধীন তাহার আয়, কর ও অন্যান্য দায় নির্ধারণ স্বয়ংক্রিয়ভাবে সম্পন্ন হইয়াছে বলিয়া গণ্য হইবে, যদি উক্ত রিটার্ন\n(ক)	ধারা ১৬৯ এ উল্লিখিত সকল বিধান পরিপালনপূর্বক দাখিল করা হয়; এবং\n (খ) 	ধারা ১৭৩ এবং ধারা ১৭৪ এ উল্লিখিত সকল বিধান পরিপালনপূর্বক কর পরিশোধ করা হয় : তবে শর্ত থাকে যে, ধারা ১৬৯ এ উল্লিখিত বিধানাবলি পরিপালন না করিয়া কোনো রিটার্ন দাখিল করা হইলে উহা “সাধারণ রিটান” বলিয়া গণ্য হইবে।\n (২) উপ-ধারা (১) এর অধীন রিটার্ন দাখিল করিবার পর যদি করদাতা কর্তৃক পরিলক্ষিত হয় যে তাহার দাখিলকৃত রিটার্নে\n(ক) 	প্রদর্শিত আয়; বা\n(খ) 	দাবিকৃত কর অব্যাহতি বা ক্রেডিট; বা\n (গ) 	অন্য কোনো কারণে, এই আইনের অধীন প্রদেয় কর সঠিকভাবে পরিগণিত হয় নাই বা সঠিক অঙ্কে পরিশোধিত হয় নাই, তাহা হইলে তিনি একটি লিখিত বিবৃতিতে কারণ উল্লেখপূর্বক সংশোধিত রিটার্ন দাখিল করিতে পারিবেন: তবে শর্ত থাকে যে, করদাতাকে উক্তরূপ সংশোধিত রিটার্ন দাখিলের পূর্বে কর এবং অন্যান্য অঙ্ক যাহা কম পরিগণনা করা হইয়াছিল বা কম পরিশোধ করা হইয়াছিল উহা, এবং এইরূপ পরিমাণের উপর মাসিক ৫% (পাঁচ শতাংশ) হারে সরল সুদ পরিশোধ করিতে হইবে।\n(৩) উপ-ধারা (২) এর অধীন নিম্নবর্ণিত ক্ষেত্রসমূহে কোনো সংশোধিত রিটার্ন দাখিল করা যাইবে না-\n(ক) 	উপ-ধারা (১) এর অধীন রিটার্ন দাখিল করিবার তারিখ হইতে ১৮০ (একশত আশি) দিন শেষ হইবার পর;\n(খ)	সংশোধিত রিটার্ন প্রথমবার দাখিলের পর; বা\n(গ) 	মূল রিটার্নটি ধারা ১৮২ এর অধীনে অডিটের জন্য নির্বাচিত হইবার পর।\n (৪) উপ-ধারা (১) এর অধীন দাখিলকৃত রিটার্নের ক্ষেত্রে, নূতন কোনো স্বাভাবিক ব্যক্তি করদাতার ব্যবসায়ের প্রারম্ভিক মূলধনের উৎস সম্পর্কে কোনো প্রশ্ন উত্থাপন করা হইবে না, যদি করদাতা-\n (ক) 	এইরূপ খাত হইতে আয় প্রদর্শন করেন যাহা কর অব্যাহতি প্রাপ্ত নহে এবং প্রদর্শিত আয় করমুক্ত সীমা অতিক্রম করে;\n(খ) 	প্রারম্ভিক মূলধনের ২০% (বিশ শতাংশ) এর নিম্নে নহে এইরূপ পরিমাণ আয় প্রদর্শন করেন;\n(গ)	রিটার্ন দাখিল করিবার সময় বা তৎপূর্বে নিয়মিত করহারে পরিগণিত কর ও অন্যান্য প্রযোজ্য অঙ্ক পরিশোধ করেন;\n (ঘ)	প্রদর্শিত ব্যবসায়ের অস্তিত্ব সম্পর্কিত প্রমাণাদি দাখিল করেন;\n(ঙ)	সংশ্লিষ্ট করবর্ষের সংশ্লিষ্ট করদিবসের মধ্যে দাখিল করেন; এবং\n (চ)	লিখিতভাবে উল্লেখ করেন যে, দাখিলকৃত রিটার্নটি বকেয়া রিটার্ন নহে।\n(৫) উপ-ধারা (৪) এর বিধান প্রযোজ্য হয় এইরূপ ক্ষেত্রে, প্রথম আয়বর্ষ পরবর্তী ধারাবাহিক ৪ (চার) আয়বর্ষে প্রদর্শিত প্রারম্ভিক মূলধনের পরিমাণ প্রথম আয়বর্ষে প্রদর্শিত মূলধন হইতে কম হইবে না এবং প্রথম আয়বর্ষ পরবর্তী ধারাবাহিক ৪ (চার) আয়বর্ষের কোনো আয়বর্ষে প্রদর্শিত মূলধনের পরিমাণ প্রথম আয়বর্ষে প্রদর্শিত মূলধন হইতে কম প্রদর্শিত হইলে সেই আয়বর্ষে উক্তরূপ ঘাটতি করদাতার “অন্যান্য উৎস হইতে আয়” হিসাবে গণ্য হইবে।\n(৬) এই ধারার উদ্দেশ্যপূরণকল্পে,\n(ক) 	“নিয়মিত করহার অর্থ এইরূপ করহার যাহা অব্যাহতিপ্রাপ্ত নয় বা হ্রাসকৃত নহে;\n(খ) 	“বকেয়া রিটার্ন” অর্থ এইরূপ রিটার্ন যাহা আয়বর্ষ সংশ্লিষ্ট করবর্ষের মধ্যে দাখিল হয় নাই।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
