import 'package:flutter/material.dart';

class dhara_186 extends StatefulWidget {
  const dhara_186({super.key});

  @override
  State<dhara_186> createState() => _dhara_186State();
}

class _dhara_186State extends State<dhara_186> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "উৎস করের রিটার্ন অডিট",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কর কমিশনারের অনুমোদনক্রমে, উপকর কমিশনার ধারা ১৭৭ এর অধীন দাখিলকৃত উৎস করের রিটার্ন হইতে কতিপয় রিটার্ন অডিটের জন্য নির্বাচন করিবেন।\n(২) উপকর কমিশনার নির্বাচিত উৎস কর রিটার্নের নিম্নবর্ণিত বিষয়ে অডিট পরিচালনা করিবেন, যথা:-\n (ক) 	অংশ ৭ এবং তদুদ্দেশ্যে প্রণীত বিধিতে বর্ণিত হারে, পরিমাণে এবং পদ্ধতিতে কর কর্তন বা সংগ্রহ করা হইয়াছে কিনা;\n(খ) 	সংগৃহীত বা কর্তনকৃত কর সরকারের হিসাবে প্রদান করা হইয়াছে কিনা, বা নির্ধারিত সময়ে এবং পদ্ধতিতে প্রদান করা হইয়াছে কিনা;\n(গ) 	কর কর্তন বা সংগ্রহের সনদ এই আইনের বিধানানুযায়ী প্রদত্ত হইয়াছে কিনা।\n(৩) যেইক্ষেত্রে উপ-ধারা (২) এর অধীন কোনো হিসাবে দেখা যায় যে, উক্ত উপ-ধারায় উল্লিখিত বিষয়সমূহের ক্ষেত্রে এই আইনের বিধানসমূহ অনুসরণ করা হয় নাই, সেইক্ষেত্রে উপকর কমিশনার অডিট পরিচালনার ক্ষেত্রে ধারা ১৪৩, ১৪৪ এবং ২৬৬ সহ এই আইনের অধীন প্রয়োজনীয় পদক্ষেপ গ্রহণ করিতে পারিবেন।\n (৪) উপ-ধারা (১) এর অধীন অডিটের উদ্দেশ্যে রিটার্ন নির্বাচন এবং অডিট নিষ্পন্নের উদ্দেশ্যে বোর্ড যেইরূপ উপযুক্ত বিবেচনা করিবে সেইরূপ আবশ্যিকভাবে পরিপালনীয় পূর্ণাঙ্গ অডিট নির্দেশিকা প্রণয়ন করিবে।\n(৫) রিটার্ন দাখিলের পর ৪ (চার) বৎসর উত্তীর্ণ হইয়াছে এইরূপ কোনো রিটার্ন অডিটের জন্য নির্বাচন করা যাইবে না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
