import 'package:flutter/material.dart';

class dhara_183 extends StatefulWidget {
  const dhara_183({super.key});

  @override
  State<dhara_183> createState() => _dhara_183State();
}

class _dhara_183State extends State<dhara_183> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "রিটার্নের ভিত্তিতে উপকর কমিশনার কর্তৃক কর নির্ধারণ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো করদাতা-\n (ক) 	ধারা ১৬৬, ২১২ বা ১৭৫ এর অধীন কোনো রিটার্ন বা সংশোধিত রিটার্ন দাখিল করিলে বা দাখিলের যোগ্য হইলে; বা\n(খ) 	ধারা ১৮২ এর উপ-ধারা (১২) অনুযায়ী কর নির্ধারণের যোগ্য হইলে; বা\n(গ)	এই আইনের বিধানানুযায়ী কোনো কর বা অন্য কোনো অঙ্ক পরিশোধের যোগ্য হইলে; উপকর কমিশনার, এই ধারার অধীন, সংশ্লিষ্ট রিটার্নের বা দলিলাদির ভিত্তিতে কর বা অন্য কোনো অঙ্ক নির্ধারণ করিতে পারিবেন।\n (২) যেইক্ষেত্রে উপকর কমিশনার সন্তুষ্ট হন যে, করদাতার কর নির্ধারণ বা করদায় পরিগণনা করিবার জন্য করদাতার উপস্থিতি বা কোনো সাক্ষ্য প্রমাণ প্রয়োজন নাই, সেইক্ষেত্রে উপকর কমিশনার রিটার্ন বা সংশোধিত রিটার্নের ভিত্তিতে, নিম্নবর্ণিত শর্তাবলির পরিপালন সাপেক্ষে, উক্ত করদাতার কর নির্ধারণ করিবেন, যথা:-\n (ক) 	উক্ত রিটার্ন ধারা ১৭১ এ উল্লিখিত তারিখে বা পূর্বে দাখিল করিতে হইবে;\n (খ)	প্রদেয় কর রিটার্ন দাখিলের তারিখে বা তাহার পূর্বে পরিশোধ করিতে হইবে;\n(গ) 	উক্ত রিটার্নে কোনো ক্ষতি বা সর্বশেষ নিরূপিত আয় হইতে কম আয় প্রদর্শন করা হয় নাই;\n(ঘ) 	উক্ত রিটার্নের ভিত্তিতে কর নির্ধারণ করা হইলে উহার ফলশ্রæতিতে কোনো কর প্রত্যর্পণ করিতে হইবে না; এবং\n (ঙ)	উক্ত রিটার্নে করদাতা শনাক্তকরণ নম্বর উল্লেখ করা হইলে।\n (৩) যেইক্ষেত্রে উপকর কমিশনার কোনো করদাতার কর নির্ধারণের জন্য করদাতার উপস্থিতি বা কোনো সাক্ষ্য প্রমাণাদির প্রয়োজন বিবেচনা করেন, সেইক্ষেত্রে উপকর কমিশনার উক্ত ব্যক্তিকে এই মর্মে নোটিশ প্রদান করিবেন যে, তাহাকে\n (ক) 	নোটিশে উল্লিখিত তারিখ এবং সময়ে, নিজে বা অনুমোদিত প্রতিনিধি দ্বারা, উপকর কমিশনারের সম্মুখে হাজির হইতে হইবে; অথবা\n(খ) 	নোটিশে উল্লিখিত রিটার্নের সমর্থনে প্রয়োজনীয় প্রমাণ দাখিল করিতে হইবে।\n(৪) যেইক্ষেত্রে করদাতা উপ-ধারা (৩) এর অধীন প্রদত্ত নোটিশ পরিপালন করেন, সেইক্ষেত্রে উপকর কমিশনার কর নির্ধারণ প্রক্রিয়া শুরু করিবেন।\n (৫) উপকর কমিশনার করদাতার কর নির্ধারণ প্রক্রিয়াকালে অধিকতর শুনানি বা প্রয়োজনীয় সাক্ষ্য প্রমাণ চাহিতে পারিবেন এবং এইক্ষেত্রে নোটিশে সুনির্দিষ্টভাবে শুনানির বিষয়াদি উল্লেখসহ পরিপালনের ব্যর্থতায় উদ্ভূত ফলাফলের বর্ণনা উল্লেখ করিবেন।\n (৬) উপকর কমিশনার শুনানির সুযোগ প্রদান ব্যতীত করদাতা কর্তৃক প্রদর্শিত কোনো ব্যয় অননুমোদন করিতে পারিবে না।\n (৭) উপকর কমিশনার শুনানি অন্তে উপস্থাপিত সাক্ষ্য প্রমাণ বিবেচনাক্রমে লিখিতভাবে বা নির্দিষ্ট ইলেকট্রনিক পদ্ধতিতে কর নির্ধারণী আদেশ প্রদান করিবেন এবং উক্ত আদেশ প্রদানের ৩০ (ত্রিশ) দিনের মধ্যে উক্ত আদেশ করদাতাকে অবহিত করিবেন।\n (৮) করদাতা উপ-ধারা (৩) বা (৫) এর অধীন প্রদত্ত নোটিশ পরিপালনে ব্যর্থ হইলে, উপকর কমিশনার ধারা ১৮৪ এর অধীন সর্বোত্তম বিচারভিত্তিক কর নির্ধারণ করিতে পারিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
