import 'package:flutter/material.dart';

class dhara_193 extends StatefulWidget {
  const dhara_193({super.key});

  @override
  State<dhara_193> createState() => _dhara_193State();
}

class _dhara_193State extends State<dhara_193> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "বাংলাদেশ ত্যাগকারী ব্যক্তির ক্ষেত্রে কর নির্ধারণ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) উপকর কমিশনার নিম্নবর্ণিতভাবে বাংলাদেশে কাজ করিবার জন্য অনুমোদনপ্রাপ্ত কোনো ব্যক্তির, যিনি চলতি অর্থবর্ষে বা ইহার মেয়াদ উত্তীর্ণ হইবার অল্প সময় পর বাংলাদেশ ছাড়িয়া চলিয়া যাইতে পারেন এবং তাহার প্রত্যাবর্তনের কোনো ইচ্ছে নাই, উক্ত বৎসরের মোট আয়ের উপর ভিত্তি করিয়া কর নির্ধারণ করিতে পারিবেন, যথা:-\n (ক)	যদি পূর্বে তাহার কর নির্ধারণ হইয়া থাকে সেইক্ষেত্রে পূর্ববর্তী যেই আয়বর্ষে আয় নিরূপিত হইয়াছে তাহা সমাপ্ত হইবার পর হইতে যে সম্ভাব্য তারিখে বাংলাদেশ ত্যাগ করিবেন উক্ত সময়ের জন্য; এবং\n(খ)	যদি পূর্বে তাহার কর নির্ধারণ না হইয়া থাকে সেইক্ষেত্রে বাংলাদেশ ত্যাগের সম্ভাব্য তারিখ পর্যন্ত বাংলাদেশে অবস্থানকালীন পূর্ণ মেয়াদের জন্য।\n (২) উপ-ধারা (১) এর অধীন নিম্নবর্ণিতভাবে কর নির্ধারণ করা হইবে, যথা :\n (ক) 	উপ-ধারা (১) এ উল্লিখিত সময়ের আওতাধীন প্রত্যেকটি পূর্ণ আয়বর্ষের ক্ষেত্রে, যথাসময়ে কর নির্ধারণ করা হইলে যে হারে কর আরোপ হইত সেই হার প্রযোজ্য হইবে; এবং\n (খ) 	সর্বশেষ সমাপ্ত আয়বর্ষের পর প্রস্থানের সম্ভাব্য তারিখের মধ্যবর্তী সময়ের ক্ষেত্রে যে অর্থবর্ষে এইরূপ কর নির্ধারণ করা হইয়াছে সেই অর্থবৎসরে বলবৎ হারে এবং উক্ত আয়ের ক্ষেত্রে উক্ত সময়ের জন্য জন্যে অর্থবৎসর কেই করবর্ষ হিসাবে বিবেচনা করা হইবে।\n(৩) এই ধারার অধীন কর নির্ধারণের উদ্দেশ্যে, উপকর কমিশনার সংশ্লিষ্ট ব্যক্তিকে এ মর্মে নোটিশ জারি করিবেন যেন নিম্নবর্ণিত তথ্যাদি নোটিশে উল্লিখিত সময়ের মধ্যে, যাহা ৭ (সাত) দিনের নিম্নে নহে, দাখিল করা আবশ্যক\n (ক) 	ধারা ১৬৬ এর অধীন রিটার্ন, যেই ফরমে এবং যেই নিয়মে প্রতিপাদনপূর্বক দাখিল করিবার বিধান রহিয়াছে সেই ফরমে ও পদ্ধতিতে নোটিশে বর্ণিত অন্যান্য বিবরণাদি প্রতিপাদনপূর্বক সংযোজন করিয়া উপ-ধারা (১) এ উল্লিখিত মেয়াদে প্রতিটি পূর্ণ আয়বর্ষের মোট আয় সংবলিত রিটার্ন; এবং"
                "\n (খ) 	প্রতিটি পূর্ণ আয়বর্ষ উত্তীর্ণ হইবার পর হইতে তাহার বাংলাদেশ ত্যাগ করিবার সম্ভাব্য তারিখ পর্যন্ত মেয়াদে মোট আয়ের একটি প্রাক্কলন।\n(৪) কর নির্ধারণের জন্য উপ-ধারা (৩) এর অধীন নোটিশটি এই আইনের সকল বিধান যতদূর সম্ভব প্রয়োগ করিয়া ধারা ১৭২ এর নোটিশ প্রদানের পদ্ধতিতে প্রদান করিতে হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
