import 'package:flutter/material.dart';

class dhara_46 extends StatefulWidget {
  const dhara_46({super.key});

  @override
  State<dhara_46> createState() => _dhara_46State();
}

class _dhara_46State extends State<dhara_46> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
        padding: const EdgeInsets.all(25),
        children: [
          const Text(
            "ব্যবসা হইতে আয়ের বিশেষ ক্ষেত্রসমূহ",
            style: TextStyle(fontSize: 25),
            textAlign: TextAlign.center,
          ),
          const SizedBox(height: 10),
          const Text(
            "(১) ধারা ৪৫ এর সামগ্রিকতাকে ক্ষুণœ না করিয়া, বিশেষ ক্ষেত্রে, ব্যবসা হইতে আয় পরিগণনার ক্ষেত্রে এই ধারার বিধানাবলি প্রযোজ্য হইবে।\n(২) করদাতার যে ব্যবসায়ের জন্য আয় পরিগণিত হইতেছে সেই ব্যবসায়ে ব্যবহৃত কোনো পরিসম্পদ যদি কোনো আয়বর্ষে বিক্রয় করা হয়, তাহা হইলে উক্ত বিক্রয়লব্ধ আয়ের পরিমাণ হইবে নিম্নরূপ, যথা:-",
            style: TextStyle(fontSize: 15),
          ),
          const SizedBox(height: 10),
          Table(
            border: TableBorder.all(color: Colors.black),
            columnWidths: const {
              0: FlexColumnWidth(1),
              1: FlexColumnWidth(2),
              2: FlexColumnWidth(3),
            },
            children: const [
              TableRow(children: [
                Text("ক্রমিক নং"),
                Text("বিক্রয়লব্ধ অর্থ"),
                Text("আয়ের পরিমাণ"),
              ]),
              TableRow(children: [
                Text("১।"),
                Text(
                    "বিক্রয়লব্ধ অর্থ যদি পরিসম্পদের অর্জন মূল্য হইতে অধিক হয়	"),
                Text(
                    "ক-খ এর সমপরিমাণ অর্থ উক্ত আয়বর্ষে করদাতার ‘মূলধনি আয়' শ্রেণির আয় হিসাবে গণ্য হইবে; \n খ-গ এর সমপরিমাণ অর্থ উক্ত আয়বর্ষে করদাতার ‘ব্যবসা হইতে আয়' শ্রেণির আয় হিসাবে গণ্য হইবে।"),
              ]),
              TableRow(children: [
                Text("২।"),
                Text(
                    "বিক্রয়লব্ধ অর্থ যদি পরিসম্পদের অর্জন মূল্য হইতে অধিক না হয়, তবে অবলোপিত মূল্য হইতে অধিক হয়"),
                Text(
                    "ক-গ এর সমপরিমাণ অর্থ উক্ত আয়বর্ষে । করদাতার ‘ব্যবসা হইতে আয়’ শ্রেণির আয় হিসাবে গণ্য হইবে।"),
              ]),
            ],
          ),
          const SizedBox(height: 5),
          const Text(
              "(৩) করদাতার ব্যবসায়ে ব্যবহৃত হইবার পর কোনো পরিসম্পদ পরিত্যক্ত, নিশ্চিহ্ন বা ধ্বংস হইবার কারণে কোনো বিমা, স্যালভেজ বা ক্ষতিপূরণ হিসাবে কোনো অর্থ প্রাপ্ত হইলে তাহার পরিমাণ যদি উক্ত সম্পদের অবলোপিত মূল্যের চাইতে অধিক হয় তাহা হইলে এই ক্ষেত্রে আয়ের অঙ্ক হইবে নিম্নরূপ, যথা:"),
          const SizedBox(height: 5),
          Table(
            border: TableBorder.all(color: Colors.black),
            columnWidths: const {
              0: FlexColumnWidth(1),
              1: FlexColumnWidth(2),
              2: FlexColumnWidth(3),
            },
            children: const [
              TableRow(children: [
                Text("ক্রমিক নং"),
                Text("ক্রয়লব্ধ অর্থ"),
                Text("আয়ের পরিমাণ"),
              ]),
              TableRow(children: [
                Text("(১)	"),
                Text("(২)"),
                Text("(৩)"),
              ]),
              TableRow(children: [
                Text("১।"),
                Text(
                    "বিমা, স্যালভেজ বা ক্ষতিপূরণ বাবদ অর্থ যদি পরিসম্পদের অর্জন মূল্য হইতে অধিক হয়।	"),
                Text(
                    "ক-খ এর সমপরিমাণ অর্থ উক্ত আয়বর্ষে সংশ্লিষ্ট করদাতার ‘মূলধনি আয়' শ্রেণির । আয় হিসাবে গণ্য হইবে; \n খ-গ এর সমপরিমাণ অর্থ উক্ত আয়বর্ষে সংশ্লিষ্ট করদাতার 'ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে।"),
              ]),
              TableRow(children: [
                Text("২।"),
                Text(
                    "বিমা, স্যালভেজ বা ক্ষতিপূরণ বাবদ অর্থ যদি পরিসম্পদের অর্জন মূল্য হইতে অধিক না হয়, তবে অবলোপিত মূল্য হইতে অধিক হয়	যেইক্ষেত্রে ক>গ, সেইক্ষেত্রে ক-গ এর সমপরমিাণ অর্থ উক্ত আয়বর্ষে সংশ্লিষ্ট করদাতার ‘ব্যবসা হইতে আয়' শ্রেণির আয় হিসাবে গণ্য হইবে;"),
                Text(
                    "যেইক্ষেত্রে ক<গ, সেইক্ষেত্রে গ-ক এর সমপরমিাণ অর্থ উক্ত আয়বর্ষে সংশ্লিষ্ট করদাতার ‘ব্যবসা হইতে আয়’ পরিগণনার ক্ষেত্রে ধারা ৪৯ এর অধীন ব্যয় হিসাবে অনুমোদিত হইবে।"),
              ]),
            ],
          ),
          const SizedBox(height: 10),
          const Text(
              "(৪) উপ-ধারা (২) এবং (৩) এর সারণির কলাম (২) অনুসারে বিক্রয়লব্ধ অর্থ বা, ক্ষেত্রমত, পরিসম্পদের বিপরীতে বিমা, স্যালভেজ বা ক্ষতিপূরণ বাবদ প্রাপ্ত অর্থ এবং অবলোপিত মূল্যের পার্থক্য ঋণাত্মক হইলে ফলাফল ব্যবসা হইতে আয় খাতে ব্যয়িত বলিয়া গণ্য হইবে এবং উহা অনুমোদিত সাধারণ বিয়োজনের অন্তর্ভুক্ত হইবে।\n(৫) উপ-ধারা (২) এবং (৩) এর সারণীতে বর্ণিত-\nক = 	পরিসম্পদের বিপরীতে বিমা, স্যালভেজ বা ক্ষতিপূরণ বাবদ প্রাপ্ত অর্থ,\n খ = 	পরিসম্পদের অর্জন মূল্য, এবং\n গ = 	তৃতীয় তফসিলের অধীন অবচয় অনুমোদনের পর পরিসম্পদের গণনাকৃত অবলোপিত মূল্য, -কে বুঝাইবে।\n (৬) যদি কোনো রপ্তানিকারক করদাতা সরকার কর্তৃক তাহার অনুকূলে বণ্টনকৃত রপ্তানি কোটার সম্পূর্ণ বা আংশিক কোনো আয়বর্ষে অন্য কোনো ব্যক্তির নিকট হস্তান্তর করিয়া থাকেন, তাহা হইলে এইরূপ হস্তান্তরিত কোটার আনুপাতিক রপ্তানি মূল্য উক্ত আয়বর্ষে করদাতার ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে।\n(৭) যদি কোনো আয়বর্ষে এই অধ্যায়ের অধীন আয় পরিগণনায় কোনো ব্যক্তির নিকট প্রদেয় সুদ বা মুনাফা বাবদ কোনো খরচ বিয়োজিত হয় এবং যেই আয়বর্ষে বিয়োজিত হইয়াছে তাহা শেষ হইবার পরবর্তী ৩ (তিন) বৎসরের মধ্যে যদি উক্ত সুদ বা মুনাফা পরিশোধ করা না হয় তাহা হইলে বর্ণিত ৩ (তিন) বৎসর সমাপ্তির পরবর্তী আয়বর্ষে উক্ত সুদ বা মুনাফার অপরিশোধিত অঙ্ক করদাতার ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে: তবে শর্ত থাকে যে, আয় হিসাবে গণ্য হইয়াছে এইরূপ কোনো সুদ বা মুনাফা যদি পরবর্তী কোনো বৎসরে পরিশোধ করা হয়, তাহা হইলে উক্ত পরিশোধ সংশ্লিষ্ট আয়বর্ষে উক্ত অঙ্ক করদাতার আয় পরিগণনা হইতে বাদ যাইবে।\n(৮) কোনো আয়বর্ষে এই অধ্যায়ের অধীন আয় পরিগণনায় যদি করদাতার কোনো ট্রেডিং দায় হিসাবে নেওয়া হয় এবং\n(ক)	পরবর্তী কোনো আয় উক্ত আয়বর্ষে করদাতা যদি ট্রেডিং দায় বাবদ কোনো সুবিধা প্রাপ্ত হয় তাহা হইলে সেই সুবিধার অর্থমূল্য সুবিধা প্রাপ্তির আয়বর্ষে করদাতার ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে;\n(খ)	উক্ত ট্রেডিং দায় যেই আয়বর্ষে হিসাবে নেওয়া হইয়াছে তাহা শেষ হইবার পরবর্তী ৩ (তিন) বৎসরের মধ্যে যদি ট্রেডিং দায় বা তাহার কোনো অংশ অপরিশোধিত থাকে তাহা হইলে উক্ত অপরিশোধিত ট্রেডিং দায় উক্ত ৩ (তিন) বৎসর সমাপ্তির পরবর্তী আয়বর্ষে করদাতার ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে: তবে শর্ত থাকে যে, আয় হিসাবে গণ্য হইয়াছে এইরূপ কোনো ট্রেডিং দায় যদি পরবর্তী কোনো বৎসরে পরিশোধ করা হয় তাহা হইলে পরিশোধ সংশ্লিষ্ট আয়বর্ষে সেই অঙ্ক করদাতার আয় পরিগণনায় বাদ যাইবে।\n(৯) যদি কোনো আয়বর্ষে এই অধ্যায়ের অধীন আয় পরিগণনায় লোকসান, কুঋণ বা কোনো খরচ বিয়োজিত হয় এবং পরবর্তী কোনো আয়বর্ষে করদাতা যদি সেই বিয়োজিত লোকসান, কুঋণ বা খরচ বাবদ কোনো সুবিধা প্রাপ্ত হন তাহা হইলে সেই সুবিধার অর্থমূল্য সুবিধা প্রাপ্তির আয়বর্ষে করদাতার ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে।\n(১০) ধারা ১৮০ এর অধীন রিটার্ন দাখিলের ক্ষেত্রে যে বৎসরে রিটার্ন দাখিল হইয়াছে তাহার পরবর্তী ৫ (পাঁচ) বৎসরের মধ্যে যেকোনো সময়ে প্রদর্শিত প্রারম্ভিক মূলধনের যেকোনো পরিমাণের ঘাটতি ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে গণ্য হইবে।\n (১১) কোনো আর্থিক প্রতিষ্ঠানের আয় পরিগণনার ক্ষেত্রে, বাংলাদেশ ব্যাংক কর্তৃক কুঋণ বা সন্দেহজনক ঋণ হিসাবে শ্রেণিবিন্যাসকৃত ঋণের উপর সুদ বা মুনাফা আয় যেই আয়বর্ষে লাভ ক্ষতির হিসাবে ক্রেডিট প্রদান করা হইবে, অথবা যেই আয়বর্ষে প্রকৃতভাবে গৃহীত হইবে, দুইয়ের মধ্যে যাহা আগে হয় সেই আয়বর্ষে আর্থিক প্রতিষ্ঠানের ব্যবসা হইতে আয় শ্রেণির আয় হিসাবে অন্তর্ভুক্ত করা হইবে।\n(১২) এই ধারার উদ্দেশ্যপূরণকল্পে,-\n (ক)	বিক্রয়ের পূর্বে পরিসম্পদটি যে ব্যবসায়ে ব্যবহৃত হইয়াছে, সেই ব্যবসা পরিসম্পদ বিক্রয়-সংশ্লিষ্ট আয়বর্ষে করদাতা কর্তৃক পরিচালিত হইয়াছে বলিয়া গণ্য হইবে;\n(খ)	করদাতার ব্যবসায় ব্যবহৃত হইবার পর কোনো পরিসম্পদ বাংলাদেশের বাহিরে রপ্তানি বা স্থানান্তরিত হইলে, উক্ত রপ্তানির বা স্থানান্তরের তারিখই পরিসম্পদ বিক্রয়ের তারিখ বলিয়া গণ্য হইবে এবং সম্পদের ক্রয়মূল্যকে উহা বিক্রয় বাবদ প্রাপ্ত অর্থ বলিয়া বিবেচনা করা হইবে।")
        ],
      ),
    );
  }
}
