import 'package:flutter/material.dart';

class dhara_55 extends StatefulWidget {
  const dhara_55({super.key});

  @override
  State<dhara_55> createState() => _dhara_55State();
}

class _dhara_55State extends State<dhara_55> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
        padding: const EdgeInsets.all(25),
        children: const [
          Text(
            "কতিপয় ক্ষেত্রে বিয়োজন অনুমোদনযোগ্য না হওয়া",
            style: TextStyle(fontSize: 25),
          ),
          SizedBox(height: 10),
          Text(
            "এই অধ্যায়ে যাহা কিছুই থাকুক না কেন, নিম্নবর্ণিত অনুমোদনযোগ্য হইবে না, যথা:- ক্ষেত্রে ব্যবসা হইতে আয় পরিগণনায় নিম্নবর্ণিত বিয়োজনসমূহ\n (ক) 	যেকোনো প্রকারের ব্যয় বা পরিশোধ যাহার ক্ষেত্রে অংশ ৭ এর বিধানাবলি যথাযথভাবে পরিপালন করা হয় নাই;\n (খ) 	কোনো ফার্ম বা ব্যক্তিসংঘ কর্তৃক ফার্মের কোনো অংশীদার বা ব্যক্তিসংঘের কোনো সদস্যকে প্রদত্ত সুদ, বেতন, কমিশন বা পারিতোষিক ;\n (গ) 	কোনো কোম্পানি কর্তৃক শেয়ারহোল্ডার পরিচালককে কোনো কমিশন বা ডিসকাউন্ট প্রদান;\n (ঘ) 	ধারা ৩২ এর ব্যাখ্যাতে সংজ্ঞায়িত পারকুইজিট বাবদ কোনো কর্মচারীকে প্রদত্ত ১০ (দশ) লক্ষ টাকার অতিরিক্ত যেকোনো অঙ্ক: তবে শর্ত থাকে যে, সরকার কর্তৃক, সরকারি গেজেটে প্রজ্ঞাপন দ্বারা, সরকারি সিদ্ধান্তের ভিত্তিতে গঠিত মজুরি বোর্ডের সুপারিশ বাস্তবায়নের জন্য কর্মচারীদের অর্থ প্রদানের ক্ষেত্রে এই ধারার কোনো কিছুই প্রযোজ্য হইবে না;\n (ঙ) 	রয়্যালটি, লাইসেন্স ফি, কারিগরি সেবা ফি, কারিগরি কৌশল বাবদ ফি কারিগরি সহায়তা ফি বা স্পর্শাতীত সম্পত্তি ব্যবহার বাবদ নির্বাহকৃত সমপ্রকৃতির অন্য যেকোনো ফি বাবদ মোট ব্যয়সমষ্টির ক্ষেত্রে আর্থিক বিবরণীতে প্রদর্শিত নীট ব্যবসায় মুনাফার ১০% (দশ শতাংশ) এর অতিরিক্ত ব্যয়;\n(চ)	বাংলাদেশে নিবন্ধিত নহে এইরূপ কোনো কোম্পানি কর্তৃক নির্বাহকৃত হেড অফিস অথবা ইন্ট্রা-গ্রæপ ব্যয়, তাহা যে নামেই অভিহিত হউক না কেন, এর ক্ষেত্রে আর্থিক বিবরণীতে প্রদর্শিত নীট ব্যবসায় মুনাফার ১০% (দশ শতাংশ) এর অতিরিক্ত ব্যয়;\n(ছ)	ব্যবসায়িক প্রয়োজনে বিদেশ ভ্রমণ সম্পর্কিত ব্যয়ের ক্ষেত্রে আর্থিক বিবরণীতে প্রদর্শিত ব্যবসায়িক টার্নওভারের ০.৫% (শূন্য দশমিক পাঁচ শতাংশ) এর অতিরিক্ত অঙ্ক:তবে শর্ত থাকে যে, করদাতা সরকারকে কোনো সেবা প্রদানের কাজে বিদেশ ভ্রমণ করিলে সেইক্ষেত্রে এই সীমা প্রযোজ্য হইবে না: আরও শর্ত থাকে যে, এই দফায় অধীন পরিগণিত অতিরিক্ত অঙ্কের সমর্থনে প্রমাণাদি উপস্থাপন করিলে এবং উহার বাণিজ্যিক যৌক্তিকতা প্রমাণিত হইলে এই দফায় প্রদত্ত সীমা প্রযোজ্য হইবে না;\n(জ)	আপ্যায়ন ব্যয় হিসাবে নিম্নবর্ণিত অঙ্কের অতিরিক্ত অঙ্ক\n (অ) 	আপ্যায়ন ব্যয় বিয়োজন ব্যতীত নিরূপিত ব্যবসায় আয়ের প্রথম ১০ (দশ) লক্ষ টাকার ৪% (চার শতাংশ); এবং\n (আ) 	আপ্যায়ন ব্যয় বিয়োজন ব্যতীত নিরূপিত ব্যবসায় আয়ের প্রথম ১০ (দশ) লক্ষ টাকা বাদে পরবর্তী অঙ্কের ২% (দুই শতাংশ);\n (ঝ)	ফ্রি স্যাম্পল বিতরণে নিম্নবর্ণিত অঙ্কের অতিরিক্ত অঙ্কÑ\n (অ) 	ফার্মাসিউটিক্যাল শিল্পের ক্ষেত্রে\n (১)	ব্যবসায়িক টার্নওভারের ৫ (পাঁচ) কোটি টাকা পর্যন্ত ২% (দুই শতাংশ) হারে;\n(২)	ব্যবসায়িক টার্নওভার ৫ (পাঁচ) কোটি টাকার অধিক, তবে ১০ (দশ) কোটি টাকার অধিক নহে এইরূপ ক্ষেত্রে ১% (এক শতাংশ) হারে;\n (৩)	ব্যবসায়িক টার্নওভার ১০ (দশ) কোটি টাকার অধিক এইরূপ ক্ষেত্রে ০.৫% (শূন্য দশমিক পাঁচ শতাংশ) হারে;\n  (আ) 	খাদ্য, প্রসাধনী ও সুগন্ধি শিল্পের ক্ষেত্রে-\n(১) 	ব্যবসায়িক টার্নওভারের ৫ (পাঁচ) কোটি টাকা পর্যন্ত ১% (এক শতাংশ) হারে;\n (২)	ব্যবসায়িক টার্নওভার ৫ (পাঁচ) কোটি টাকার অধিক, তবে ১০ (দশ) কোটি টাকার অধিক নহে এইরূপ ক্ষেত্রে ০.৫% (শূন্য দশমিক পাঁচ শতাংশ) হারে;\n (৩)	ব্যবসায়িক টার্নওভার ১০ (দশ) কোটি টাকার অধিক এইরূপ ক্ষেত্রে ০.২৫% (শূন্য দশমিক দুই পাঁচ শতাংশ) হারে;\n(ই)	অন্যান্য শিল্পের ক্ষেত্রে\n (১)	ব্যবসায়িক টার্নওভারের ৫ (পাঁচ) কোটি টাকা পর্যন্ত ০.৫% (শূন্য দশমিক পাঁচ শতাংশ) হারে;\n (২)	ব্যবসায়িক টার্নওভার ৫ (পাঁচ) কোটি টাকার অধিক কিন্তু ১০ (দশ) কোটি টাকার অধিক নহে এইরূপ ক্ষেত্রে ০.২৫% (শূন্য দশমিক দুই পাঁচ শতাংশ) হারে;\n (৩)	ব্যবসায়িক টার্নওভার ১০ (দশ) কোটি টাকার অধিক এইরূপ ক্ষেত্রে ০.১% (শূন্য দশমিক এক শতাংশ) হারে;\n (ঞ) 	বিজ্ঞাপন ব্যতীত অন্যান্য প্রচারণামূলক ব্যয়ের ক্ষেত্রে ব্যবসায়িক টার্নওভারের ০.৫% (শূন্য দশমিক পাঁচ শতাংশ) এর অধিক অঙ্ক;\n (ট)	কর্মচারীর চাকরি হইতে আয় বলিয়া বিবেচিত এইরূপ কোনো অর্থ যদি ব্যাংকিং মাধ্যমে পরিশোধ না হইয়া অন্য কোনো মাধ্যমে পরিশোধ করা হয়;\n (ঠ)	কোনো পরিশোধ যাহা ভাড়া হইতে আয় বলিয়া বিবেচিত তাহা ব্যাংকিং মাধ্যমে পরিশোধ না হইয়া অন্য কোনো মাধ্যমে পরিশোধ হইয়া থাকিলে উক্ত পরিশোধিত অর্থ;\n(ড)	কাঁচামাল বাবদ যেকোনো অঙ্কের পরিশোধ ব্যাংকিং মাধ্যমে পরিশোধিত না হইয়া অন্য কোনো মাধ্যমে পরিশোধিত হইয়া থাকিলে ৫ (পাঁচ) লক্ষ টাকার অতিরিক্ত পরিশোধিত অঙ্ক;\n  (ঢ)	দফা (ট), (ঠ) ও (ড) ব্যতীত অন্যান্য সকল প্রকার ব্যয়ের ক্ষেত্রে ৫০ (পঞ্চাশ) হাজার টাকার অতিরিক্ত অঙ্ক ব্যাংকিং মাধ্যমে পরিশোধ না হইয়া অন্য কোনো মাধ্যমে পরিশোধ হইয়া থাকিলে উক্ত পরিশোধিত অর্থ;\n(ণ)	ধারা ২৬৪ এর উপ-ধারা (৩) এর দফা ২৫, ২৬, ২৮, ২৯, ৩৬, ৩৭, ৪২ ও ৪৩ অনুযায়ী রিটার্ন দাখিলের প্রমাণ দাখিলে বাধ্য এইরূপ কোনো ব্যক্তিকে পরিশোধিত কোনো অঙ্ক, যদি অর্থ পরিশোধের সময় উক্ত ব্যক্তি রিটার্ন দাখিলের প্রমাণ দাখিলে ব্যর্থ হয়;\n(ত)	মূলধনি প্রকৃতির কোনো ব্যয় কিংবা করদাতার ব্যক্তিগত কোনো ব্যয়;\n(থ) 	যেকোনো দায় যাহা সুস্পষ্টভাবে নিরূপিত নহে;\n (দ) 	ব্যবসায়িক কর্মকান্ডের সহিত সম্পর্কিত নহে এইরূপ সকল প্রকার ব্যয়;\n(ধ)	ওহঃবৎহধঃরড়হধষ ঋরহধহপরধষ জবঢ়ড়ৎঃরহম ঝঃধহফধৎফ মোতাবেক কোনো পরিসম্পদের জরমযঃ ড়ভ টংব বাবদ দাবিকৃত কোনো অবচয় ভাতা ও সুদ বিয়োজন : তবে শর্ত থাকে যে, এই ক্ষেত্রে ব্যবসার উদ্দেশ্যে ব্যবহৃত ভূমি বা আঙ্গিনার জন্য পরিশোধযোগ্য ভাড়া, উন্নয়ন ও সংরক্ষণ ব্যয় অনুমোদন করিতে হইবে;\n (ন)	ধারণাগত পরিসম্পদ অনিষ্টজনিত ক্ষতি ( রসঢ়ধরৎসবহঃ ষড়ংং);\n (প) 	বোর্ড কর্তৃক অননুমোদিত কোনো তহবিলে প্রদত্ত অর্থ;\n(ফ)	নির্ধারিত পদ্ধতিতে হিসাবরক্ষণের বিধান পরিপালন না হইলে প্রমাণকহীন সকল খরচ। ব্যাখ্যা। এই ধারার উদ্দেশ্যপূরণকল্পে,\n(অ)	“নীট ব্যবসায় মুনাফা” অর্থ কোনো সত্তা কর্তৃক সরাসরি পরিচালিত ব্যবসায়িক মুনাফা, তবে কোনো সাবসিডিয়ারি, অ্যাসোসিয়েট বা জয়েন্ট ভেঞ্চার হইতে অর্জিত মুনাফা ইহার অন্তর্ভুক্ত হইবে না;\n (আ)	“প্রচারণামূলক ব্যয়” অর্থ ব্যবসায়ের উদ্দেশ্যে কাউকে কোনো বস্তু, অর্থ বা অন্য কোনো প্রকারের সুবিধার প্রদানের বিপরীতে দাবিকৃত ব্যবসায়িক খরচ দাবি, তবে বিজ্ঞাপন ব্যয় ইহার অন্তর্ভুক্ত হইবে না।",
            style: TextStyle(fontSize: 15),
          )
        ],
      ),
    );
  }
}
