import 'package:flutter/material.dart';

class dhara_49 extends StatefulWidget {
  const dhara_49({super.key});

  @override
  State<dhara_49> createState() => _dhara_49State();
}

class _dhara_49State extends State<dhara_49> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "ব্যবসা হইতে আয় গণনার ক্ষেত্রে অনুমোদনযোগ্য সাধারণ বিয়োজনসমূহ ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "এই আইনের বিধানাবলি সাপেক্ষে, কোনো আয়বর্ষে কোনো ব্যক্তির ব্যবসা হইতে আয় পরিগণনার ক্ষেত্রে প্রত্যেক স্বতন্ত্র এবং ভিন্ন ব্যবসায়ের জন্য নিম্নবর্ণিত ব্যয়সমূহ সাধারণ বিয়োজনের অন্তর্ভুক্ত হইবে, যথা:-"
                "\n(ক) 	কাঁচামাল, মজুদ, ব্যবসায়ের উদ্দেশ্যে ও ব্যবসায়ে ব্যবহারের নিমিত্ত পণ্য ক্রয় বাবদ ব্যয় এবং কোনো অবলোপিত মজুদ ব্যয়;"
                "\n(খ) 	এই আইন ও দানকর আইন, ১৯৯০ (১৯৯০ সনের ৪৪ নং আইন) এর অধীন পরিশোধিত নহে, তবে ব্যবসার উদ্দেশ্যে পরিশোধিত এইরূপ শুল্ক-করাদি, পৌর কর, স্থানীয় কর, ভূমি উন্নয়ন কর বা খাজনা ও সরকারি ফি;"
                "\n(গ)	ব্যবসার উদ্দেশ্যে ব্যবহৃত ভূমি বা আঙ্গিনার জন্য পরিশোধযোগ্য ভাড়া, উন্নয়ন ও সংরক্ষণ ব্যয়;"
                "\n(ঘ)	এই আইনের অধীন চাকরি হইতে আয় হিসাবে পরিগণিত হয় এইরূপ সকল প্রকার ব্যয়, কল্যাণ ব্যয় বা পারিশ্রমিক;"
                "\n(ঙ) 	মেরামত ও সংরক্ষণ ব্যয়;\n(চ)	ব্যবসায়ের উদ্দেশ্যে কৃত ও পরিশোধিত বিমা প্রিমিয়াম;\n(ছ)	বিদ্যুৎ ও জ্বালানিসহ অন্যান্য পরিষেবা ব্যয়;\n(জ)	পণ্য পরিবহণ, ক্লিয়ারিং এবং ফরওয়ার্ডিং চার্জ;\n(ঝ)	বিক্রয় সংশ্লিষ্ট কমিশন, দালালি, ডিসকাউন্ট বা ওয়ারেন্টি চার্জ প্রকৃতির ব্যয়;\n (ঞ)	বিজ্ঞাপন ও প্রচারণা ব্যয়;\n(ট)	কর্মীদের প্রশিক্ষণ বাবদ ব্যয় ;\n (ঠ) 	বিক্রয় প্রতিনিধিদের সম্মেলন, হোটেল ও আবাসন বাবদ ব্যয় ;\n(ড)	যাতায়াত ও ভ্রমণ বাবদ ব্যয়;\n(ঢ)	ইন্টারনেট সেবা, ডাক ও টেলিযোগাযোগ সংক্রান্ত ব্যয় ;\n(ণ) 	আইনি সেবা, নিরীক্ষা সেবা ও অন্যান্য পেশাদারী সেবা গ্রহণ সংক্রান্ত ব্যয়;\n(ত) 	আপ্যায়ন ও অতিথিশালা সংক্রান্ত ব্যয়;\n(থ)	তৃতীয় তফসিল সাপেক্ষে, বৈদেশিক মুদ্রার নগদায়িত বিনিময় ক্ষতি;\n (দ) 	কোনো ক্লাব বা বাণিজ্যিক সমিতিতে প্রবেশ ফি-সহ তাহাদের সুবিধাদির ব্যবহারের জন্য চাঁদা;\n(ধ) সরকার কর্তৃক স্পন্সরকৃত কোনো ট্রেড ডেলিগেশনের সদস্য হিসাবে বিদেশে সফর সম্পর্কিত কোনো নির্বাহকৃত ব্যয় ;\n (ন)	রয়্যালটি, কারিগরি ফি, হেড অফিস ব্যয়;\n(প)	শ্রমিক অংশগ্রহণ তহবিল, কল্যাণ তহবিল এবং বাংলাদেশ শ্রমিক কল্যাণ ফাউন্ডেশন আইন, ২০০৬ (২০০৬ সনের ২৫ নং আইন) এর ধারা ২৩৪ এর অধীন স্থাপিত শ্রমিক কল্যাণ ফাউন্ডেশন তহবিলে প্রদত্ত অর্থ যাহা প্রদর্শিত নীট ব্যবসায়িক মুনাফার ৫% (পাঁচ শতাংশ) এর অধিক নহে; এবং\n(ফ)	সম্পূর্ণ ও একান্তভাবে ব্যবসায়ের উদ্দেশ্যে নির্বাহকৃত অন্যান্য ব্যয়।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
