import 'package:flutter/material.dart';

class dhara_74 extends StatefulWidget {
  const dhara_74({super.key});

  @override
  State<dhara_74> createState() => _dhara_74State();
}

class _dhara_74State extends State<dhara_74> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "দীর্ঘমেয়াদি চুক্তির ক্ষেত্রে হিসাবরক্ষণ পদ্ধতি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো ব্যক্তি ‘ব্যবসা হইতে আয়' শ্রেণিভুক্ত এবং গণনাকৃত আয়ের জন্য উপচিত হিসাবরক্ষণ পদ্ধতি অনুসরণ করেন, সেইক্ষেত্রে কোনো আয়বর্ষে দীর্ঘমেয়াদি চুক্তি হইতে উদ্ভূত আয় সম্পাদনের শতাংশ পদ্ধতি অনুসারে গণনা করিতে হইবে।\n(২) কোনো করবর্ষে দীর্ঘমেয়াদি চুক্তি সম্পাদনের শতাংশ, উক্ত করবর্ষ শেষ হইবার পূর্বে চুক্তিতে মোট বরাদ্দকৃত ব্যয় এবং সংঘটিত খরচের সহিত চুক্তির শুরুতে নির্ধারিত আনুমানিক মোট চুক্তিব্যয়ের মধ্যে তুলনার মাধ্যমে নির্ধারিত হইবে।\n(৩) এই ধারার উদ্দেশ্যপূরণকল্পে,\n(ক) 	দীর্ঘমেয়াদি চুক্তি অর্থ উৎপাদন, স্থাপন, বা নির্মাণ সংক্রান্ত চুক্তি, বা এতৎসংক্রান্ত প্রতিটি চুক্তি সম্পর্কিত পরিষেবা সমূহের সম্পাদন, যাহা চুক্তির অধীন কাজ আরম্ভ হইবার করবর্ষের মধ্যে সম্পন্ন হয় নাই, তবে চুক্তির অধীন কাজ শুরু হইবার দিন হইতে আনুমানিক ৬ (ছয়) মাসের মধ্যে শেষ হইবে এইরূপ চুক্তি ব্যতীত অন্য সকল চুক্তি;\n(খ) 	সম্পাদনের শতাংশ পদ্ধতি অর্থ সার্বজনীনভাবে গৃহীত হিসাবরক্ষণ নীতি যাহার অধীন দীর্ঘমেয়াদি চুক্তির আওতাধীন রাজস্ব ও ব্যয় উপ-ধারা (২) এর অধীন সংশোধনকৃত চুক্তির সমাপ্তির পর্যায়ে স্বীকৃত হয়। ",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
