import 'package:flutter/material.dart';

class dhara_328 extends StatefulWidget {
  const dhara_328({super.key});

  @override
  State<dhara_328> createState() => _dhara_328State();
}

class _dhara_328State extends State<dhara_328> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "ইলেক্ট্রনিক কর ব্যবস্থাপনা",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                " (১) যেইক্ষেত্রে এই আইনের কোনো বিধানের অধীন কোনো রিটার্ন, উৎসে করের রিটার্ন, যেকোনো প্রকারের বিবৃতি, আবেদন বা দলিল কোনো আয়কর কর্তৃপক্ষের নিকট বা কর আপিল ট্রাইব্যুনালে দাখিল করিতে হইবে সেইক্ষেত্রে উক্ত রিটার্ন, বিবৃতি, আবেদন বা দলিল বোর্ড কর্তৃক গৃহীত বা অনুমোদিত ইলেক্ট্রনিক, কম্পিউটারে পাঠযোগ্য বা যন্ত্রে পাঠযোগ্য ফরমে ও পদ্ধতিতে দাখিল করা যাইবে।\n(২) বোর্ড কর্তৃক গৃহীত বা অনুমোদিত নির্দিষ্ট কম্পিউটার বা ইলেকট্রনিক সিস্টেমে প্রেরিত কোনো নোটিশ, আদেশ, চাহিদাপত্র, সনদপত্র, যোগাযোগ, পত্র বা প্রাপ্তি স্বীকারপত্র এই আইনের অধীন কোনো নোটিশ, আদেশ, চাহিদাপত্র, সনদপত্র, যোগাযোগ, পত্র বা প্রাপ্তি স্বীকারপত্র হিসাবে বিবেচিত হইবে।  \n              (৩) বোর্ড, এই আইনের কোনো বিধানের অধীন আয়কর কর্তৃপক্ষের নিকট বা কর আপিল ট্রাইব্যনুালে কোনো প্রকার হাজিরা বা শুনানির বিষয়াদি ইলেক্ট্রনিক মাধ্যমে নিশ্চিতকল্পে যেকোনো কম্পিউটার বা ইলেক্ট্রনিক সিস্টেম উন্নয়ন, ব্যবহার ও প্রচলন করিতে পারিবে এবং উক্ত সিস্টেমের মাধ্যমে হাজিরা প্রদান ও শুনানির নিশ্চিতে প্রয়োজনীয় আদেশ জারি করিতে পারিবে।\n          (৪) বোর্ড, বিশেষ আদেশ দ্বারা, কোনো নির্দিষ্ট ব্যক্তি শ্রেণি বা কোনো নির্দিষ্ট শ্রেণির আয়ের ক্ষেত্রে ইলেক্ট্রনিক মাধ্যমে রিটার্ন, উৎসে করের রিটার্ন, যেকোনো প্রকারের বিবৃতি, আবেদন বা দলিল কোনো আয়কর কর্তৃপক্ষের নিকট বা কর আপিল ট্রাইব্যুনালে দাখিল বাধ্যতামূলক করিতে পারিবে।\n(৫) ইলেক্ট্রনিক মাধ্যমে কর পরিশোধ বা কর পরিপালন সংক্রান্ত অন্যান্য বিষয়ে বোর্ড বিশেষ আদেশ জারি করিতে পারিবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
