import 'package:flutter/material.dart';

class dhara_31 extends StatefulWidget {
  const dhara_31({super.key});

  @override
  State<dhara_31> createState() => _dhara_31State();
}

class _dhara_31State extends State<dhara_31> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
        padding: const EdgeInsets.all(25),
        children: const [
          Text(
            "আয় একীভতূ করণ",
            style: TextStyle(fontSize: 25),
            textAlign: TextAlign.center,
          ),
          SizedBox(height: 10),
          Text(
            "(১) এই আইনে ভিন্নরূপ কিছু না থাকিলে, নিম্নবর্ণিত আয়সমূহ কোনো ব্যক্তির মোট আয়ের অন্তর্ভুক্ত হইবে, যথা:\n (ক) উক্ত ব্যক্তি কোনো ফার্মের অংশীদার বা কোনো ব্যক্তিসংঘের সদস্য হইলে, উক্ত ফার্ম বা ব্যক্তিসংঘের আয়ে তাহার অংশ;\n (খ) উক্ত ব্যক্তির স্বামী বা স্ত্রী বা অপ্রাপ্তবয়স্ক সন্তানের আয়, যদি--\n(অ) উক্ত স্বামী বা স্ত্রী বা অপ্রাপ্তবয়স্ক সন্তান তাহার উপর নিভর্র শীল হন;\n (আ) এইরূপ আয়ের উপর উক্ত ব্যক্তির যুক্তিসঙ্গত নিয়ন্ত্রণ থাকে; বা\n (ই) তিনি এইরূপ একীভূতকরণে ইচ্ছুক হন: তবে শর্ত থাকে যে, উক্ত স্বামী বা ¯ী¿ বা অপ্রাপ্তবয়স্ক সন্তানের পৃথক কর নির্ধারণ করা হইলে এই বিধান প্রযোজ্য হইবে না।\n(২) কোনো ব্যক্তি কোনো ফার্মের অংশীদার বা কোনো ব্যক্তিসংঘের সদস্য হইলে, উক্ত ফার্ম বা ব্যক্তিসংঘের আয়ে তাহার অংশ নিম্নরূপ সূত্র দ্বারা নিরূপিত হইবে, যথা:-\n ক = খ+ (গ- ঘ) এর ঙ%, যেখানেক = ফার্ম বা ব্যক্তিসংঘ হইতে উক্ত ব্যক্তির আয়ের অংশ,\nখ = উক্ত ফার্ম বা ব্যক্তিসংঘ হইতে উক্ত ব্যক্তি কর্তৃক প্রাপ্ত বেতন, সুদ, কমিশন বা অন্যান্য পারিতোষিক,\n গ = উক্ত ফার্ম বা ব্যক্তিসংঘের মোট আয়,\n ঘ = উক্ত ফার্ম বা ব্যক্তিসংঘ কর্তৃক সকল অংশীদার বা সদস্যকে প্রদেয় বেতন, সুদ, কমিশন বা অন্যান্য পারিতোষিকের যোগফল,\n ঙ = উক্ত ফার্ম বা ব্যক্তিসংঘে উক্ত ব্যক্তির শেয়ারের শতকরা হার। ",
            style: TextStyle(fontSize: 15),
          )
        ],
      ),
    );
  }
}
