import 'package:flutter/material.dart';

class dhara_58 extends StatefulWidget {
  const dhara_58({super.key});

  @override
  State<dhara_58> createState() => _dhara_58State();
}

class _dhara_58State extends State<dhara_58> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "মূলধনি আয় পরিগণনা",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের বিধানাবলি সাপেক্ষে, কোনো ব্যক্তির মূলধনি আয় হইবে কোনো পরিসম্পদের উন্মুক্ত বাজারে বিক্রয় বা হস্তান্তর মূল্য এবং উক্ত পরিসম্পদের অর্জন মূল্যের পার্থক্য।\n (২) 	এই ধারার উদ্দেশ্যপূরণকল্পে,\n (ক) 	উন্মুক্ত বাজারে বিক্রয় বা হস্তান্তর মূল্য বলিতে কোনো পরিসম্পদের উন্মুক্ত বাজারে বিক্রয় বা হস্তান্তর মূল্য হইবে 'ক' এবং 'খ' এর মধ্যে যাহা অধিক, যেখানেÑ\n ক = 	পরিসম্পদ হস্তান্তর হইতে প্রাপ্ত বা উপচিত অর্থ; এবং\n  খ = 	হস্তান্তরের তারিখে পরিসম্পদের ন্যায্য বাজার মূল্য :\n (খ)	“পরিসম্পদের অর্জন মূল্য” বলিতেÑ\n (অ) 	কোনো পরিসম্পদের অর্জন মূল্য হইবে নিম্নবর্ণিত খরচসমূহের সমষ্টি-\n(১)	এইরূপ কোনো খরচ যাহা কেবল উক্ত পরিসম্পদের স্বত্ব হস্তান্তরের সহিত সম্পর্কিত;\n(২)	পরিসম্পদের ক্রয়মূল্য; এবং\n(৩) 	ধারা ৩৮, ৪২, ৪৯, ৫০ বা ৬৪ অনুযায়ী অনুমোদিত খরচ ব্যতীত উক্ত পরিসম্পদ উন্নয়নের খরচ, যদি থাকে;\n(আ)	যেইক্ষেত্রে হস্তান্তরকারি উক্ত পরিসম্পদ নিম্নবর্ণিতভাবে অর্জন করিয়াছেনÑ\n (১) 	কোনো উপহার, দান বা উইলের অধীন;\n (২) 	সাকসেশন, উত্তরাধিকার বা পরম্পরাক্রমে;\n (৩)	প্রত্যাহারযোগ্য বা অপ্রত্যাহারযোগ্য কোনো ট্রাস্টের হস্তান্তরের অধীন;\n (৪) 	কোনো কোম্পানি অবসায়নের জন্য মূলধনি পরিসম্পদের কোনো বিতরণের মাধ্যমে; বা\n  (৫)	কোনো ফার্ম বা ব্যক্তিসংঘ বা হিন্দু অবিভক্ত পরিবারের বিভাজনের ক্ষেত্রে মূলধনি পরিসম্পদের বিতরণের মাধ্যমে, সেইক্ষেত্রে হস্তান্তরকারী কর্তৃক উক্ত পরিসম্পদের মালিকানা অর্জনের তারিখের ন্যায্য বাজার মূল্য উক্ত পরিসম্পদের অর্জনমূল্য হিসাবে বিবেচিত হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
