import 'package:flutter/material.dart';

class dhara_284 extends StatefulWidget {
  const dhara_284({super.key});

  @override
  State<dhara_284> createState() => _dhara_284State();
}

class _dhara_284State extends State<dhara_284> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "সংশোধিত আয়ের পরিমাণের ভিত্তিতে জরিমানা আদেশ সংশোধন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে এই অংশের অধীন আরোপিত কোনো জরিমানার পরিমাণ এই আইনের বিধানাবলির আওতায় নির্ধারণকৃত আয়ের পরিমাণের সহিত সরাসরি সম্পর্কযুক্ত এবং এই আইনের অধীন প্রদত্ত কোনো আদেশ দ্বারা পরবর্তীতে উক্ত আয়ের পরিমাণ সংশোধিত হইয়াছে, সেইক্ষেত্রে উপকর কমিশনার আয়ের পরিমাণ সংশোধন করিবারসময় সংশোধিত জরিমানার আদেশ জারি করিতে পারিবেন।"
                    "\n (২) জরিমানার পরিমাণ বৃদ্ধি সংক্রান্ত কোনো প্রকার আদেশ জারির পূর্বে যাহার "
                    "উপর জরিমানা প্রযোজ্য তাহাকে শুনানির যুক্তিসঙ্গত সুযোগ প্রদান করিতে হইবে।"
                    "\n (৩) যেইক্ষেত্রে প্রাসঙ্গিক সংশোধিত কর নির্ধারণী আদেশ জারির পরও উপ-ধারা"
                    "(১) এ উল্লিখিত জরিমানার সংশোধিত আদেশ জারি করা হয় নাই, সেইক্ষেত্রে যাহার উপর জরিমানা আদেশ প্রযোজ্য তিনি উক্ত জরিমানার পরিমাণ সংশোধন করিবার অনুরোধ জানাইয়া উপকর কমিশনার বরাবর আবেদন করিতে পারিবে, এবং এইরূপ আবেদন প্রাপ্তির ১৮০ (একশত আশি) দিনের মধ্যে যদি কোনো আদেশ প্রদান করা না হয়, তাহা হইলে সংশোধিত কর নির্ধারণী অনুসারে জরিমানার আদেশটি সংশোধিত হইয়াছে মর্মে গণ্য হইবে এবং তদনুসারে এই আইনের সকল বিধান কার্যকর হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
