import 'package:flutter/material.dart';

class dhara_266 extends StatefulWidget {
  const dhara_266({super.key});

  @override
  State<dhara_266> createState() => _dhara_266State();
}

class _dhara_266State extends State<dhara_266> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " রিটার্ন, ইত্যাদি দাখিলে ব্যর্থতার জন্য জরিমানা",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো ব্যক্তি যুক্তিসঙ্গত কারণ ব্যতীত, ধারা ১৬৬, ১৭২, ১৯১, ১৯৩ বা ২১২ এর অধীন কোনো ব্যক্তি রিটার্ন দাখিল করিতে ব্যর্থ হন, সেইক্ষেত্রে উপকর কমিশনার উক্ত ব্যক্তির সর্বশেষ নিরূপিত আয়ের উপর ধার্যকৃত করের ১০% (দশ শতাংশ) হারে জরিমানা আরোপ করিতে পারিবেন, যাহা ন্যূনতম ১ (এক) হাজার টাকা হইবে এবং ব্যর্থতা অব্যাহত থাকিলে ব্যর্থতা অব্যাহত থাকাকালীন প্রতিদিনের জন্য ৫০ (পঞ্চাশ) টাকা হারে অতিরিক্ত জরিমানা আরোপ করিতে পারিবেন : তবে শর্ত থাকে যে, উক্ত জরিমানার পরিমাণ নিম্নবর্ণিত অঙ্ক অতিক্রম করিবে না, যথা:-\n(ক) কোনো ব্যক্তি করদাতা, যাহার ইতঃপূর্বে কখনো কর নির্ধারণ হয় নাই, তাহার ক্ষেত্রে ৫ (পাঁচ) হাজার টাকা;\n(খ) কোনো ব্যক্তি করদাতা, যাহার ইতঃপূর্বে কর নির্ধারণ হইয়াছে, তাহার ক্ষেত্রে সর্বশেষ নিরূপিত আয়ের উপর প্রদেয় করের ৫০% (পঞ্চাশ শতাংশ) বা ১ (এক) হাজার টাকা, দু&#39;টির মধ্যে যাহা অধিক।\n (২) যেইক্ষেত্রে কোনো ব্যক্তি যুক্তিসঙ্গত কারণ ব্যতীত,\n(ক) ধারা ১৭৭ এর অধীন কোনো রিটার্ন, তথ্য দাখিল বা উপস্থাপন করিতে ব্যর্থ হইয়াছেন সেইক্ষেত্রে উপকর কমিশনার উক্ত ব্যক্তির উপর তাহার সর্বশেষ নিরূপিত আয়ের উপর ধার্যকৃত করের ১০% (দশ শতাংশ) হারে অথবা ৫ (পাঁচ) হাজার টাকা, দু&#39;টির মধ্যে যাহা অধিক, সেই পরিমাণ জরিমানা আরোপ করিতে পারিবেন এবং ব্যর্থতা অব্যাহত থাকিলে, ব্যর্থতা অব্যাহত থাকাকালীন প্রতি মাসের জন্য অথবা তাহার ভগ্নাংশের জন্য ১ (এক) হাজার টাকা হারে অতিরিক্ত জরিমানা আরোপ করিতে পারিবেন;\n(খ) ধারা ১৪৫ এর অধীন কোনো সার্টিফিকেট প্রদান করিতে ব্যর্থ হইয়াছেন, সেইক্ষেত্রে উপকর কমিশনার উক্ত ব্যক্তির উপর ৫ (পাঁচ) হাজার টাকা পর্যন্ত জরিমানা আরোপ করিতে পারিবেন এবং ব্যর্থতা অব্যাহত থাকিলে, ব্যর্থতা অব্যাহত থাকাকালীন প্রতি মাসের জন্য অথবা তাহার ভগ্নাংশের জন্য ১ (এক) হাজার টাকা হারে অতিরিক্ত জরিমানা আরোপ করিতে পারিবেন; \n(গ) ধারা ২০০ এর আবশ্যকতা অনুযায়ী কোনো তথ্য দাখিল বা উপস্থাপনে ব্যর্থ হন, সেইক্ষেত্রে যে আয়কর কর্তৃপক্ষ ধারা ২০০ এর অধীন তথ্য চাহিয়াছে সেই কর্তৃপক্ষ উক্ত ব্যক্তির উপর ৫০ (পঞ্চাশ) হাজার টাকা জরিমানা আরোপ করিতে পারিবেন এবং ব্যর্থতা অব্যাহত থাকিলে, ব্যর্থতা অব্যাহত থাকাকালীন প্রতি দিনের জন্য ৫০০ (পাঁচশত) টাকা হারে অতিরিক্ত জরিমানা আরোপ করিতে পারিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
