import 'package:flutter/material.dart';

class dhara_272 extends StatefulWidget {
  const dhara_272({super.key});

  @override
  State<dhara_272> createState() => _dhara_272State();
}

class _dhara_272State extends State<dhara_272> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "আয় গোপন করিবার জন্য জরিমানা ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের অধীন কোনো কার্যক্রম চলাকালে, কার্যক্রম পরিচালনাকারী কর্তৃপক্ষ যদি এই মর্মে সন্তুষ্ট হয় যে, কোনো ব্যক্তি, উক্ত কার্যক্রমে কিংবা একই আয়বর্ষের কর নির্ধারণ সম্পর্কিত পূর্ববর্তী কোনো কার্যক্রমে তাহার আয়, সম্পদ, দায়, ব্যয়ের তথ্য বা অন্য কোনো গুরুত্বপূর্ণ তথ্য যাহা করদাতার প্রদেয় অঙ্কের সহিত সম্পর্কযুক্ত তাহা অসত্য পরিমাণে প্রদর্শনের মাধ্যমে এই আইনের অধীন প্রদেয় অঙ্কের ফাঁকি দিয়েছেন, তাহা হইলে উক্ত কার্যক্রম পরিচালনাকারী কর্তৃপক্ষ উক্ত ব্যক্তির উপর ক+খ এর সমপরিমাণ জরিমানা আরোপ করিবে, যেইক্ষেত্রেক = ফাঁকি দেওয়া অঙ্ক দ্ধ ১৫%, \n খ = ফাঁকি দেওয়া অঙ্ক দ্ধ ১০% ী গ \n গ = অসত্য পরিমাণে তথ্য প্রদর্শনের বিষয়টি যেই করবর্ষে সংঘটিত হইয়াছে সেই করবর্ষ হইতে উক্ত অসত্য পরিমাণে তথ্য প্রদর্শনের বিষয়টি যেই করবর্ষে উদঘাটিত হইয়াছে সেই করবর্ষ পর্যন্ত মোট বৎসর।\n (২) এই ধারার উদ্দেশ্যপূরণকল্পে, -\n(ক) “কার্যক্রম পরিচালনাকারী কর্তৃপক্ষ” বলিতে-\n (অ) উপকর কমিশনার পদের নিম্নে নহে এইরূপ আয়কর কর্তৃপক্ষকে বুঝাইবে; এবং \n(আ) কর আপিল ট্রা ইব্যুনালকে বঝু াইবে;\n(খ) “ফাঁকি দেওয়া অঙ্ক” বলিতে কোনো করবর্ষে গ-ঘ কে বুঝাইবে, যেইক্ষেত্রেগ = যদি আয়, সম্পদ, দায়, ব্যয় বা অন্য কোনো গুরুত্বপূর্ণ তথ্য অসত্য পরিমাণে প্রদর্শন করা না হইত তাহা হইলে কোনো করবর্ষে প্রদেয় কর ও অন্যান্য অঙ্ক, ঘ = সংশ্লিষ্ট করবর্ষে প্রকৃত পরিশোধিত অঙ্ক।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
