import 'package:flutter/material.dart';

class dhara_34 extends StatefulWidget {
  const dhara_34({super.key});

  @override
  State<dhara_34> createState() => _dhara_34State();
}

class _dhara_34State extends State<dhara_34> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কর্মচারী শেয়ার স্কিম হইতে অর্জিত আয় নির্ধারণ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কর্মচারী শেয়ার স্কিম অর্থ কোনো চুক্তি বা ব্যবস্থাপনা যাহার অধীন একটি কোম্পানি\n (ক) তাহার কোনো কর্মচারী বা তাহার কোনো সহযোগী কোম্পানি কর্মচারী বরাবর শেয়ার ইস্যু করিতে পারিবে; বা\n(খ) একটি ট্রা স্টের ট্রাস্টি বরাবর শেয়ার ইস্যুকরিতে পারিবে এবং পরবর্তীতে ট্রাস্টি ট্রাস্টের দলিল মোতাবেক উক্ত শেয়ার উক্ত কোম্পানি বা তাহার কোনো সহযোগী কোম্পানি কোনো কর্মচারী বরাবর ইস্যু করিতে পারিবে।\n(২) কর্মচারী শেয়ার স্কিমের অধীন শেয়ার প্রাপ্ত হইলে, শেয়ার প্রাপ্তির বৎসরে ক খ নিয়মে আয় চাকরি হইতে আয়ের সহিত যোগ হইবে, যেখানেক = প্রাপ্তির তারিখে শেয়ারের ন্যায্য বাজার মূল্য, খ = শেয়ার অর্জনের ব্যয়। \n (৩) উপ-ধারা (২) এ বর্ণিত শেয়ার অর্জনের ব্যয় বলিতে নিম্নবর্ণিত ব্যয়সমূহের যোগফল। বুঝাইবে, যথা:- \n (ক) কর্মচারী শেয়ার অর্জনে যদি কোনো মূল্য পরিশোধ করিয়া থাকেন; \n (খ) কর্মচারী শেয়ার অর্জনের অধিকার বা সুযোগ আদায়ে যদি কোনো মূল্য পরিশোধ করিয়া থাকেন। \n (৪) কর্মচারী শেয়ার স্কিমের অধীন শেয়ার অর্জনের প্রাপ্ত অধিকার বা সুযোগ কর্মচারী বিক্রয় বা হস্তান্তর করিলে চাকরি হইতে আয়ের সহিত কÑÑÑখ নিয়মে আয় যোগ হইবে, যেখানে\n ক = শেয়ার অর্জনের অধিকার বা সুযোগ বিক্রয় বা হ¯াÍ šরÍ মূল্য, \n খ = শেয়ার অর্জনের অধিকার বা সুযোগ আদায়ে পরিশোধিত মূল্য। ",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
