import 'package:flutter/material.dart';

class dhara_179 extends StatefulWidget {
  const dhara_179({super.key});

  @override
  State<dhara_179> createState() => _dhara_179State();
}

class _dhara_179State extends State<dhara_179> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "হিসাব, দলিলাদি ইত্যাদি উপস্থাপন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) উপকর কমিশনার লিখিত নোটিশের মাধ্যমে, ধারা ১৬৬, ১৭৫ বা ১৭৬ এর অধীন যিনি রিটার্ন দাখিল করিয়াছেন বা যাহার নিকট রিটার্ন দাখিলের নোটিশ জারি করা হইয়াছে এই ধরনের কোনো করদাতার রিটার্ন অডিট কার্যক্রম বা কর নির্ধারণের উদ্দেশ্যে প্রয়োজনীয় বিবেচিত হইতে পারে, সংশ্লিষ্ট আয়বর্ষের অনধিক ৩ (তিন) বৎসর পূর্বের, এইরূপ রেকর্ড, বহি, হিসাব, বিবৃতি, নথি, তথ্য বা ইলেকট্রনিক রেকর্ড উপস্থাপনের জন্য নির্দেশ প্রদান করিতে পারিবেন।\n(২) উপকর কমিশনার যেকোনো রেকর্ড, বহি, হিসাব, বিবৃতি, দলিল, তথ্য বা ইলেকট্রনিক রেকর্ড বা উহার কোনো অংশ ইলেকট্রনিক পদ্ধতিতে বা ইলেকট্রনিক মাধ্যমে উপস্থাপনের জন্য নোটিশ জারি করিতে পারিবেন।\n (৩) কোনো হিসাব, বিবৃতি, দলিল, তথ্য বা ইলেকট্রনিক রেকর্ড নোটিশে উল্লিখিত তারিখে বা উহার পূর্বে দাখিল করিতে হইবে।\n(৪) এই ধারার উদ্দেশ্যপুরণকল্পে,Ñ\n(ক) 	“রিটার্ন” অর্থে সংশোধিত রিটার্ন অন্তর্ভুক্ত হইবে;\n(খ) 	“তথ্য” অর্থে তথ্য ও যোগাযোগ প্রযুক্তি আইন, ২০০৬ (২০০৬ সনের ৩২ নং আইন) এর ধারা ২ এর দফা (১০) এ সংজ্ঞায়িত “উপাত্ত” অর্šÍভুক্ত হইবে;\n(গ)	“ইলেকট্রনিক রেকর্ড” এবং “ইলেক্ট্রনিক বিন্যাস” অর্থে তথ্য ও যোগাযোগ প্রযুক্তি আইন, ২০০৬ ( ২০০৬ সনের ৩২ নং আইন) এর ধারা ২ এর দফা (৫) এবং (৭) এ সংজ্ঞায়িত “ইলেকট্রনিক রেকর্ড” এবং “ইলেক্ট্রনিক বিন্যাস” অন্তর্ভুক্ত হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
