import 'package:flutter/material.dart';

class dhara_330 extends StatefulWidget {
  const dhara_330({super.key});

  @override
  State<dhara_330> createState() => _dhara_330State();
}

class _dhara_330State extends State<dhara_330> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "ত্রæটি সংশোধন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো আয়কর কর্তৃপক্ষ অথবা আপিল ট্রাইব্যুনাল স্বীয় বিবেচনায় বা করদাতার লিখিত আবেদনের ভিত্তিতে বা অন্য কোনো উৎসের তথ্যের ভিত্তিতে কোনো আদেশে ত্রæটি দেখিতে পান, সেইক্ষেত্রে আয়কর কর্তৃপক্ষ অথবা আপিল ট্রাইব্যনুাল লিখিত আদেশ দ্বারা, উক্তরূপ ত্রæটি সংশোধন করিতে পারিবে: তবে শর্ত থাকে যে, আদেশ জারির তারিখ হইতে ৪ (চার) বৎসর মেয়াদ শেষ হইবার পর এই উপ-ধারার অধীন কোনো সংশোধন করা যাইবে না। \n              (২) যেইক্ষেত্রে কোনো করদাতা, কোনো করবর্ষের ক্ষেত্রে লিখিত আবেদন দ্বারা, উপকর কমিশনারের নিকট এই মর্মে দাবি উত্থাপন করেন যে, এই আইনের অধীন- \n(ক) প্রদেয় অর্থের পরিমাণের চাহিতে অধিক পরিমাণ অর্থ পরিশোধ করা হইয়াছে; বা \n        (খ) করদাতা কর্তৃক পরিশোধিত কোনো করের ক্রেডিট প্রদান করা হয় নাই; সেইক্ষেত্রে উপকর কমিশনার করদাতার দাবির বৈধতা এবং সঠিকতা যাচাই করিয়া যে করবর্ষে উক্তরূপ অধিক পরিমাণ অর্থ পরিশোধিত হইয়াছিল সেই করবর্ষে উহার প্রত্যর্পণ সৃষ্টি করিবেন বা, ক্ষেত্রমত, উক্তরূপ পরিশোধিত করের ক্রেডিট প্রদান করিবেন। \n(৩) কর নির্ধারণ বৃদ্ধি বা প্রত্যর্পণ হ্রাস বা অন্য কোনোভাবে করদাতার দায় বৃদ্ধি করিতে পারে এইরূপ সংশোধনীর ক্ষেত্রে ক্ষতিগ্রস্ত পক্ষসমূহকে যুক্তিসঙ্গত শুনানির সুযোগ প্রদান না করিয়া উপ-ধারা (১) এর অধীন কোনো দায় সংশোধন করা যাইবে না।\n    (৪) যেইক্ষেত্রে উপ-ধারা (১) এ উল্লিখিত কোনো ত্রæটি করদাতা কর্তৃক সংশ্লিষ্ট কর্তৃপক্ষের গোচরীভূত করা হইয়াছে এবং উক্ত ত্রæটি কর্তৃপক্ষকে অবহিত করিবার পরবর্তী অর্থবৎসরের মধ্যে সংশোধন করা না হয়, সেইক্ষেত্রে এই উপ-ধারার অধীন ত্রæটি সংশোধন করা হইয়াছে বলিয়া বিবেচিত হইবে এবং তদনুসারে এই আইনের বিধানাবলি কার্যকর হইবে। \n(৫) যেইক্ষেত্রে কোনো ফার্মের অংশীদারের কর নির্ধারণের পর উক্ত ফার্মের কর নির্ধারণ অনুসারে বা ধারা ২১৩, ২৮৫, ২৮৯, ২৯২, ২৯৪, ২৯৫ বা ৩০৪ এর অধীন ফার্মের আয় হ্রাস বা বৃদ্ধির প্রেক্ষিতে এইরূপ পরিদৃষ্ট হয় যে, ফার্মের লাভ বা লোকসানের অংশ উহার অংশীদারের আয় নির্ধারণের মধ্যে অন্তর্ভুক্ত হয় নাই বা অন্তর্ভুক্ত হইলেও উহা সঠিকভাবে হয় নাই, সেইক্ষেত্রে উক্ত কর নির্ধারণে অংশীদারের শেয়ারের, ক্ষেত্রমত, অšভÍর্ ুক্তি বা সংশোধনী এইরূপভাবে সম্পন্ন করিতে হইবে যেন উহা এই ধারার অধীন রেকর্ড সাপেক্ষে ত্রæটি সংশোধন করা হইয়াছে বলিয়া বিবেচিত হইবে এবং উপ-ধারা (১) এর বিধানাবলি তদনুসারে কার্যকর হইবে।\n(৬) যেইক্ষেত্রে ধারা ২১২ এর অধীন গৃহীত কার্যধারার ফলস্বরূপ, কোনো ফার্ম বা ব্যক্তিসংঘের কর নির্ধারণ করা হয় এবং সংশ্লিষ্ট উপকর কমিশনারের বিবেচনায় ফার্মের অংশীদারের বা, ক্ষেত্রমতে, ব্যক্তিসংঘের সদস্যের মোট আয় পরিগণনা করা প্রয়োজন, সেইক্ষেত্রে উপকর কমিশনার এইরূপ ক্ষেত্রে মোট আয় পরিগণনা করিতে পারিবে না এবং উক্ত পরিগণনার ভিত্তিতে পরিশোধযোগ্য অর্থের পরিমাণ নির্ধারণ করিবেন যেন উক্ত পরিগণনা এই ধারার অধীন রেকর্ড সাপেক্ষে ত্রæটি সংশোধন করা হইয়াছে এবং উপ-ধারা (১) এর বিধানাবলি তদনুসারে কার্যকর হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
