import 'package:flutter/material.dart';

class dhara_335 extends StatefulWidget {
  const dhara_335({super.key});

  @override
  State<dhara_335> createState() => _dhara_335State();
}

class _dhara_335State extends State<dhara_335> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "নোটিশ জারি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো নোটিশ, কর নির্ধারণ আদেশ, কর বা প্রত্যর্পণ পরিগণনার ফরম, বা অন্য কোনো দলিল তদোল্লিখিত নামীয় ব্যক্তিকে রেজিস্টার্ড ডাকযোগে বা প্রেরকের অফিসিয়াল ইলেক্ট্রনিক মেইল হইতে উক্ত ব্যক্তির নির্ধারিত ইলেক্ট্রনিক মেইল এড্রেসে বা কোনো আদালত কর্তৃক Code of Civil Procedure, 1908 (Act V of 1908 ) এর অধীন সমন জারির পদ্ধতিতে, জারি করা যাইবে। \n              (২) ধারা ৩২৭ এ উল্লিখিত অনুমোদিত প্রতিনিধি কর্তৃক কোনো নোটিশ, কর নির্ধারণ আদেশ, কর বা প্রত্যর্পণ পরিগণনার ফরম, অথবা অন্য কোনো দলিল গ্রহণ করা হইলে উক্ত অনুমোদিত প্রতিনিধি কর্তৃক এইরূপ গ্রহণ উক্ত ব্যক্তির নিকট বৈধ প্রেরণ হিসাবে বিবেচিত হইবে। \n      (৩) নিম্নবণির্ত ভাবে নোটিশ প্রেরণ করা যাইবে, যথা: \n        (ক) কোনো ফার্ম বা হিন্দুঅবিভক্ত পরিবারের ক্ষেত্রে, ফার্মের কোনো সদস্য, বা ব্যবস্থাপক বা পরিবারের কোনো প্রাপ্তবয়স্ক সদস্যের নিকট; \n    (খ) স্থানীয় কর্তৃপক্ষ বা কোম্পানির ক্ষেত্রে, ইহার প্রধান নির্বা হী, উহা যে নামেই অভিহিত হউক না কেন, এর নিকট; \n(গ) অন্যান্য সংস্থা বা ব্যক্তিসংঘের ক্ষেত্রে, প্রধান নির্বাহী বা ইহার কোনো সদস্যের নিকট; \n    (ঘ) কোনো ফার্ম বা ব্যক্তিসংঘ বিলোপিত হইয়া গেলে অনুরুপ বিলোপিত হইবার অব্যবহিত পূর্বে, ক্ষেত্রমত, উক্ত ফার্ম বা ব্যক্তিসংঘের সদস্য ছিলেন এইরূপ যেকোনো ব্যক্তির নিকট;\n    (ঙ) ধারা ১৯১ প্রযোজ্য হয় এইরূপ কোনো ব্যবসা বন্ধ হইবার ক্ষেত্রে, যদি ব্যবসা বন্ধ থাকে তবে-\n(অ) এইরূপ কোনো ব্যক্তির ক্ষেত্রে, যাহার আয় নির্ধারণ করা হইবে;\n(আ) এইরূপ কোনো কোম্পানির ক্ষেত্রে, উক্ত কোম্পানির প্রধান নির্বাহীর নিকট; এবং \n    (ই) এইরূপ কোনো ফার্ম বা ব্যক্তিসংঘের ক্ষেত্রে, উক্ত ফার্ম বা ব্যক্তিসংঘের কার্যক্রম বন্ধ হইবার সময় অংশীদার ছিলেন এইরূপ কোনো ব্যক্তির নিকট; \n    (চ) যেইক্ষেত্রে ধারা ১৯২ এর অধীন কোনো হিন্দু অবিভক্ত পরিবারের বিভক্ত হইবার তথ্য পাওয়া যায়, উক্ত ক্ষেত্রে পরিবারের সর্বশেষ ব্যবস্থাপক ছিলেন এইরূপ ব্যক্তির নিকট অথবা যদি উক্তরূপ ব্যক্তির মৃত্যু হয় তাহা হইলে বিভক্তির পূর্বে উক্ত পরিবারের সদস্য ছিলেন এইরূপ সকল প্রাপ্তবয়স্ক সদস্যের নিকট; এবং \n    (ছ) অন্য কোনো ক্ষেত্রে, যাহা কোনো ব্যক্তি নহে, যিনি উক্ত ব্যক্তি বা প্রতিষ্ঠান সংক্রান্ত বিষয়াদি পরিচালনা বা নিয়ন্ত্রণ করিতেন এইরূপ ব্যক্তির নিকট। \n    (৪) কোনো নোটিশের অধীন রিটার্ন দাখিল বা নোটিশ পরিপালন করিবার পর উক্তরূপ নোটিশের বৈধতা বা উহা জারির বৈধতা সম্পর্কে প্রশ্ন উত্থাপন করা যাইবে না। ব্যাখ্যা- এই ধারার উদ্দেশ্যপূরণকল্পে, \n    (ক) &quot;নোটিশ&quot; অর্থে এই আইনের অধীন প্রদত্ত কোনো আদেশ, নির্দেশ বা চাহিদাপত্র অšভÍর্ ুক্ত হইবে;\n(খ) “ইলেক্ট্রনিক মেইল” অর্থ তথ্য ও যোগাযোগ প্রযুক্তি আইন, ২০০৬ (২০০৬ সনের ৩৯ নং আইন) এ সংজ্ঞায়িত কোনো ইলেক্ট্রনিক মেইল”; \n    (গ) “প্রেরকের অফিসিয়াল ইলেক্ট্ির নক মেইল” অর্থ নোটিশ প্রেরণের নিমিত্ত আয়কর কর্তৃপক্ষের জন্য বোর্ড কর্তৃক নির্ধারিত ইলেক্ট্রনিক মেইল; \n(ঘ) “ব্যক্তির নির্ধারিত ইলেক্ট্রনিক মেইল এডেস্র ” অর্থ ইলেক্ট্রনিক মেইল এড্রেস; \n    (অ) সংশ্লিষ্ট আয়বর্ষের জন্য দাখিলকৃত উক্ত ব্যক্তির রিটার্নে যেরূপে প্রদত্ত হইয়াছে: \n(আ) কোনো ব্যক্তি কর্তৃক লিখিতভাবে আয়কর কর্তৃপক্ষের নিকট যেরূপে উক্তরূপ ব্যক্তির ইলেক্ট্রনিক মেইল এড্রেস উল্লেখ করিয়াছেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
