import 'package:flutter/material.dart';

class dhara_97 extends StatefulWidget {
  const dhara_97({super.key});

  @override
  State<dhara_97> createState() => _dhara_97State();
}

class _dhara_97State extends State<dhara_97> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "স্থানীয় ঋণপত্রের কমিশন হিসাবে প্রাপ্ত অর্থ হইতে কর্তন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো ব্যাংক বা আর্থিক প্রতিষ্ঠান, কোনো স্থানীয় ঋণপত্র বা উপ-ধারা (২) এর অধীন কোনো অর্থায়ন ব্যবস্থা নহে এইরূপ অন্য কোনো অর্থায়ন চুক্তির অধীন ব্যবসা বা প্রক্রিয়া বা রূপান্তরের পরে পুনঃবিক্রি করিবার উদ্দেশ্যে কোনো ব্যক্তি, অতঃপর ক বলিয়া উল্লিখিত, কর্তৃক অন্য কোনো ব্যক্তি, অতঃপর ব্যক্তি খ বলিয়া উল্লিখিত, এর নিকট হইতে বাংলাদেশে কোনো পণ্য ক্রয়ের জন্য কোনো ঋণ সুবিধা প্রদান করে, সেইক্ষেত্রে উক্ত ব্যাংক বা আর্থিক প্রতিষ্ঠান ব্যক্তি খ-কে পরিশোধ বা ঋণ প্রদানের সময় ব্যক্তি ক কর্তৃক ক্রয়ের জন্য পরিশোধিত বা ঋণকৃত পরিমাণের উপর ৩% (তিন শতাংশ) হারে কর কর্তন করিবে।\n (২) যেইক্ষেত্রে কোনো ব্যাংক বা আর্থিক প্রতিষ্ঠান, কোনো পরিবেশককে এইরূপ কোনো অর্থায়ন ব্যবস্থার অধীন কোনো ঋণসুবিধা প্রদান করিয়া যেখানে কোনো ব্যক্তি, অতঃপর ব্যক্তি গ বলিয়া উল্লিখিত, ব্যাংক বা আর্থিক প্রতিষ্ঠান হইতে তাহার কোনো পরিবেশক, অতঃপর ব্যক্তি ঘ বলিয়া উল্লিখিত, এর নিকট পণ্য বিক্রি বা ইনভয়েসের বিপরীতে কোনো অর্থ প্রাপ্ত হয়, সেইক্ষেত্রে উক্ত ব্যাংক বা আর্থিক প্রতিষ্ঠান ব্যক্তি গ-কে পরিশোধ বা ঋণ প্রদানের সময় ব্যক্তি ঘ এর অনুকূলে ইনভয়েসকৃত পণ্যের জন্য পরিশোধিত বা ঋণকৃত পরিমাণের উপর ১% (এক শতাংশ) হারে কর কর্তন করিবে।\n(৩) ধান, গম, গোল আলু, পেঁয়াজ, রসুন, মটরশুটি, ছোলা, মশুর ডাল, আদা, হলুদ, শুকনো মরিচ, ডাল, ভূট্টা, মোটা আটা, আটা, লবণ, ভোজ্যতেল, চিনি, কালো গোল মরিচ, দারুচিনি, বাদাম, লবঙ্গ, খেজুর, ক্যাসিয়া পাতা, কম্পিউটার বা কম্পিউটার যন্ত্রাংশ, পাট, তুলা, সুতা এবং সকল প্রকার ফল ক্রয়ের জন্য খোলা বা কৃত স্থানীয় ঋণপত্র খোলা বা অন্য কোনো অর্থায়ন চুক্তির ক্ষেত্রে ব্যাংক বা আর্থিক প্রতিষ্ঠান কর্তৃক পরিশোধিত বা ঋণকৃত পরিমাণের উপর ২% (দুই শতাংশ) হারে কর কর্তন করিবে। ব্যাখ্যা।-এই ধারার উদ্দেশ্যপূরণকল্পে, ‘পরিবেশক' বলিতে এইরূপ ব্যক্তিকে বুঝাইবে, যিনি অন্য কোনো ব্যক্তি কর্তৃক উৎপাদিত প্রক্রিয়াজাত পণ্য সর্বশেষ ক্রেতার নিকট প্রত্যক্ষভাবে বা অন্য কোনো মধ্য স্বত্বভোগীর মাধ্যমে সরবরাহের কার্যক্রম পরিপালন করেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
