import 'package:flutter/material.dart';

class dhara_95 extends StatefulWidget {
  const dhara_95({super.key});

  @override
  State<dhara_95> createState() => _dhara_95State();
}

class _dhara_95State extends State<dhara_95> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " ট্রাভেল এজেন্টের নিকট হইতে কর সংগ্রহ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের অন্যান্য বিধানাবলিতে যাহা কিছুই থাকুক না কেন, কমিশন বা ছাড় বা অন্য কোনো সুবিধার মাধ্যমে, যে নামেই অভিহিত করা হউক না কেন, কোনো নিবাসীকে অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত কোনো ব্যক্তি, উক্ত অর্থ পরিশোধকালে যাত্রী টিকিট বিক্রয় বা কার্গো বিমানে পণ্য পরিবহণ সুবিধা প্রদানের মাধ্যমে রূপান্তরযোগ্য মোট অর্থের উপর ০.৩% (শূন্য দশমিক তিন শতাংশ) হারে কর কর্তন বা অগ্রিম কর সংগ্রহ করিবেন।\n (২) উপ-ধারা (১) এ উল্লিখিত টিকেট বিক্রয়ের মাধ্যমে বা বিমানে কার্গো পরিবহণ হইতে ইনসেন্টিভ বোনাস, পারফরমেন্স বোনাস বা অন্য কোনো সুবিধা, যে নামেই অভিহিত হউক না কেন, এর অতিরিক্ত কোনো অর্থ পরিশোধিত হইলে উক্তরূপ অর্থ পরিশোধকালে অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি ক/খ ঢ গ এর সমপরিমাণ অর্থ কর্তন করিবেন, যেখানে-\nক= 	এই উপ-ধারাতে উল্লিখিত ইনসেন্টিভ বোনাস, পারফরমেন্স বোনাস বা অন্য কোনো সুবিধা,\n ‘‘খ’’ =	কমিশন বা ডিসকাউন্ট বা উপ-ধারা (১) এ উল্লিখিত অন্য কোনো সুবিধার পরিমাণ, এবং\n‘‘গ’’ =	কমিশন বা ছাড় বা উপ-ধারা (১) এ উল্লিখিত অন্য কোনো সুবিধার উপর উৎস করের পরিমাণ।\n(৩) টিকিট বা চার্জের মূল্য গণনাকালে কোনো প্রারম্ভিক ফি, ভ্রমণ কর, ফ্লাইট সুরক্ষা বিমা, নিরাপত্তা কর এবং বিমানবন্দর কর বাবদ পরিশোধিত অর্থ মূল্য বা চার্জ ইহার অন্তর্ভুক্ত হইবে না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
