import 'package:flutter/material.dart';

class dhara_109 extends StatefulWidget {
  const dhara_109({super.key});

  @override
  State<dhara_109> createState() => _dhara_109State();
}

class _dhara_109State extends State<dhara_109> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "ভাড়া হইতে উৎসে কর কর্তন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                " (১) যেইক্ষেত্রে কোনো নির্দিষ্ট ব্যক্তি-\n(ক) 	কোনো গৃহ সম্পত্তি;\n (খ) 	হোটেল বা গেস্ট হাউজ;\n(গ) 	খালি স্থান বা প্ল্যান্ট বা যন্ত্রপাতি; বা\n(ঘ)	সরকারি জলাধার ব্যতীত অন্য কোনো জলাধার, ভাড়া করেন সেইক্ষেত্রে উক্ত ব্যক্তি উক্ত সম্পত্তির ভাড়া পরিশোধকালে প্রদেয় ভাড়ার উপর ৫% (পাঁচ শতাংশ) হারে কর কর্তন করিবেন।\n(২) যেইক্ষেত্রে সংশ্লিষ্ট বৎসরের কর নির্ধারণের পর দেখা যায় যে, গৃহ সম্পত্তির মালিক কর্তৃক কোনো কর প্রদেয় নাই বা প্রদত্ত করের পরিমাণ প্রদেয় কর অপেক্ষা অধিক হয়, সেইক্ষেত্রে নিম্নবর্ণিত হারে কর্তিত অর্থ ফেরত প্রদান করা হইবে,-\n(ক)	কোনো কর প্রদেয় না হইলে, সম্পূর্ণ অংশ; বা\n(খ)	কর্তিত করের পরিমাণ প্রদেয় কর অপেক্ষে অধিক হইলে, যতটুকু অধিক সেইটুকু।\n(৩) যেইক্ষেত্রে, উপকর কমিশনার এতদুদ্দেশ্যে কৃত আবেদনের ভিত্তিতে, নির্ধারিত ফরমে সদ্বিশ্বাসে এই মর্মে সনদ প্রদান করেন যে, উক্ত বৎসরে গৃহ সম্পত্তির মালিকের কোনো মূল্যায়নযোগ্য আয় নাই বা এই আইনের বিধাবাবলি সাপেক্ষে উহা আয়কর মুক্ত, সেইক্ষেত্রে উপ-ধারা (১) এর অধীন প্রদত্ত সনদ বাতিল না হওয়া পর্যন্ত উক্ত গৃহ সম্পত্তির ভাড়া হইতে প্রাপ্ত আয়ের উপর কর কর্তনযোগ্য হইবে না।\n(৪) এই ধারার উদ্দেশ্যপূরণকল্পে, ভাড়া অর্থ কোনো পরিশোধ, উহা যে নামেই অভিহিত হউক না কেন, যাহা কোনো লিজ, ভোগ স্বত্ত (ঃবহধহপু) বা কোনো চুক্তি বা সমঝোতার মাধ্যমে কোনো আসবাবপত্র, জিনিসপত্র এবং ভূমিসহ কোনো ভবন ব্যবহারের জন্য প্রদান করা হয়।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
