import 'package:flutter/material.dart';

class dhara_86 extends StatefulWidget {
  const dhara_86({super.key});

  @override
  State<dhara_86> createState() => _dhara_86State();
}

class _dhara_86State extends State<dhara_86> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "চাকরির আয় হইতে উৎসে কর কর্তন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো প্রাপককে চাকরি হইতে আয় খাতের অধীন কোনো চাকরির অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি, উক্ত অর্থ পরিশোধের সময়, উক্ত খাতের অধীন প্রাপকের আনুমানিক মোট আয়ের উপর প্রযোজ্য করের গড় হারে কর কর্তন করিবেন।\n(২) স্বীকৃত ভবিষ্য তহবিলের পুঞ্জিভূত স্থিতি হইতে কোনো অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি দ্বিতীয় তফসিলের অংশ ৩ এর অনুচ্ছেদ ৬ এ উল্লিখিত প্রযোজ্য ক্ষেত্রে কর কর্তন করিবেন।\n(৩) যেইক্ষেত্রে কোনো সরকারি কর্মকর্তা আয়নকারী ও ব্যয়নকারী কর্মকর্তা (ডিডিও) হিসাবে কার্য সম্পাদন করিয়াছেন বা সরকার বা অন্য কোনো কর্তৃপক্ষের নিকট হইতে চাকরি হইতে আয় উত্তোলন করিবার জন্য নিজের বা অন্য কোনো সরকারি অধীনস্তের জন্য বিল প্রস্তুত বা স্বাক্ষর করিয়াছেন, সেইক্ষেত্রে তিনি উক্ত বিল তৈরি বা স্বাক্ষরের সময়, উক্ত আয়বর্ষের জন্য প্রদেয় বার্ষিক বেতন যদি করমুক্ত সীমা অতিক্রম করে, তাহা হইলে উক্ত আয়বর্ষের আনুমানিক মোট আয়ের জন্য প্রযোজ্য করের গড় হারে কর কর্তন করিবেন।\n(৪) উপ-ধারা (১) এবং (৩) এর অধীন কোনো কর্তনের সময়, পূর্ববর্তী কোনো উদ্বৃত্ত বা ঘাটতির সহিত সমন্বয়ের জন্য উদ্বৃত্ত বা ঘাটতির সমপরিমাণ অর্থ বৃদ্ধি বা হ্রাস করা যাইবে।\n(৫) যেইক্ষেত্রে এই আইনের অধীন প্রদেয় অগ্রিম করসহ, এই ধারার অধীন ইতোমধ্যে উৎসে কর প্রদান করা হইয়াছে এবং কোনো কর্মচারীর সম্ভাব্য মোট আয়ের উপর প্রযোজ্য কর উক্তরূপে প্রদেয় করের পরিমাণের কাছাকাছি বলিয়া বিবেচিত হয়, সেইক্ষেত্রে উপকর কমিশনার উক্ত কর্মচারী কর্তৃক দাখিলকৃত আবেদন এবং প্রদত্ত প্রমাণাদির ভিত্তিতে, অবশিষ্ট আয়বর্ষের জন্য এই মর্মে প্রত্যয়নপত্র জারি করিতে পারিবেন যে, উক্ত কর্মচারীর নিকট হইতে কোনো কর কর্তন করা হইবে না বা কম হারে কর কর্তন করা হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
