import 'package:flutter/material.dart';

class dhara_94 extends StatefulWidget {
  const dhara_94({super.key});

  @override
  State<dhara_94> createState() => _dhara_94State();
}

class _dhara_94State extends State<dhara_94> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কমিশন, ডিসকাউন্ট, ফি, ইত্যাদি হইতে কর্তন বা উৎসে কর সংগ্রহ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                " (১) কোনো পরিবেশককে, উহা যে নামেই অভিহিত হউক না কেন, বা অন্য কোনো ব্যক্তিকে পণ্য বা সেবা সরবরাহ বা বিপণনের জন্য কমিশন, বাট্টা, ফি, প্রণোদনা বা কর্মদক্ষতা ভাতা বা কর্মদক্ষতা সম্পর্কিত অন্য কোনো প্রণোদনা বা এইরূপ প্রকৃতির অন্য কোনো অর্থ পরিশোধ বা একই প্রকৃতির সুবিধার মাধ্যমে কোনো কোম্পানি বা ফার্ম অর্থ পরিশোধকালে বা অনুমোদিত কোনো অঙ্কের অর্থ প্রদানকালে, অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি, পরিশোধযোগ্য পরিমাণ বা প্রদেয় অনুমোদিত অঙ্কের অর্থ বা অনুমোদিত সুবিধার আর্থিক মূল্য, ক্ষেত্রমত, এর উপর শতকরা ১০% (দশ শতাংশ) হারে কর কর্তন বা সংগ্রহ করিবে।\n(২) কোনো কোম্পানি বা ফার্মের পণ্য বিপণন বা বাজারজাতকরণের সহিত সম্পৃক্ত কোনো ব্যক্তিকে উক্ত কোম্পানি বা ফার্ম কোনো অর্থ পরিশোধকালে, অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি, পণ্য বিপণন বা বাজারজাতকরণের জন্য প্রাপ্ত অর্থের উপর ১.৫% (এক দশমিক পাঁচ শতাংশ) হারে কর কর্তন করিবেন।\n(৩) তেল বিপণন কোম্পানি ব্যতীত অন্য কোনো কোম্পানি বা ফার্ম, যাহা-\n(ক) 	কোনো পরিবেশক; বা\n (খ)	চুক্তির অধীন অন্য কোনো ব্যক্তি, -এর নিকট উক্ত কোম্পানি বা ফার্ম কর্তৃক নির্ধারিত খুচরা মূল্য হইতে কম মূল্যে পণ্য বিক্রয় করে, উক্ত পরিবেশক বা উক্তরূপ অন্য কোনো ব্যক্তির নিকট হইতে খ দ্ধ গ এর সমপরিমাণ মূল্যের উপর ৫% (পাঁচ শতাংশ) হারে কর সংগ্রহ করিবে, যেইক্ষেত্রে\n খ =	পরিবেশক বা অন্য কোনো ব্যক্তির নিকট কোম্পানি বা ফার্মের বিক্রয় মূল্য;\n গ =	৫% (পাঁচ শতাংশ):\n তবে শর্ত থাকে যে, সিগারেট প্রস্তুতকারক কোম্পানি বা ফার্মের পণ্য বিক্রয়কালে উক্ত পরিবেশক বা উক্তরূপ অন্য কোনো ব্যক্তির নিকট হইতে পরিবেশক বা অন্য কোনো ব্যক্তির নিকট পণ্যের বিক্রয় মূল্য এবং উক্ত কোম্পানি বা ফার্ম কর্তৃক নির্ধারিত খুচরা মূল্যের মধ্যে পার্থক্যের ৩% (তিন শতাংশ) হারে কর সংগ্রহ করিবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
