import 'package:flutter/material.dart';

class dhara_327 extends StatefulWidget {
  const dhara_327({super.key});

  @override
  State<dhara_327> createState() => _dhara_327State();
}

class _dhara_327State extends State<dhara_327> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " হাজিরার জন্য অনুমোদিত প্রতিনিধি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো করদাতা, যিনি এই আইনের অধীন কোনো কার্যধারার সহিত সংশ্লিষ্ট কোনো আয়কর কর্তৃপক্ষ বা আপিল ট্রাইব্যুনালে উপস্থিত হইবার উপযুক্ত বা প্রয়োজন সেইক্ষেত্রে, ধারা ২২১ এর অধীন ব্যক্তিগতভাবে উপস্থিত হওয়া ব্যতীত, অনুমোদিত প্রতিনিধির মাধ্যমে হাজির হইতে পারিবেন।\n (২) এই ধারার উদ্দেশ্যপূরণকল্পে, “অনুমোদিত প্রতিনিধি&quot; অর্থ এইরূপ কোনো ব্যক্তি যিনি করদাতার পক্ষে উপস্থিত হইবার জন্য লিখিতভাবে অনুমোদিত এবং যিনি-\n  (ক) করদাতার পিতা, মাতা, স্বামী বা স্ত্রী, পুত্র, কন্যা, ভাই বা বোন;\n (খ) করদাতার কোনো পূর্ণকালীন নিয়মিত কমর্চ ারী;\n(গ) একজন কর আইনজীবী।\n  (৩) উপ-ধারা (২) এর দফা (গ) এর উদ্দেশ্যে পূরণকল্পে, “কর আইনজীবী” অর্থ -\n    (ক) বাংলাদেশ বার কাউন্সিলে আইনজীবী হিসাবে নিবন্ধিত কোনো ব্যক্তি;\n    (খ) অনুশীলনকারী চার্টার্ড অ্যাকাউন্টেন্ট;\n    (গ) অনুশীলনকারী কস্ট এন্ড ম্যানেজমেন্ট অ্যাকাউন্টেন্ট;\n (ঘ) অনুশীলনকারী চাটার্ড সেক্রেটারিজ অব বাংলাদেশ;\n    (ঙ) উপকর কমিশনারের নিম্নে নহে এইরূপ পদে কমপক্ষে ৫ (পাঁচ) বৎসরের জন্য আয়কর কর্তৃপক্ষ হিসাবে কাজ করিয়াছেন; অথবা \n    (চ) বোর্ড কর্তৃক কর আইনজীবী হিসাবে সনদ প্রাপ্ত কোনো ব্যক্তি। \n    (৪) প্রত্যেক কর আইনজীবীকে বোর্ডের সহিত নিবন্ধিত কোনো কর আইনজীবী সমিতির সদস্য হইতে হইবে।\n    (৫) বোর্ড কর আইনজীবী সমিতির নিবন্ধন প্রদান করিবে এবং বোর্ডের সহিত নিবন্ধিত নহে এইরূপ কোনো আইনজীবী সমিতি কর আইনজীবী সমিতি হিসাবে গণ্য হইবে না।\n (৬) নিমবœ র্ণিত বিষয়ে বোর্ড বিধি প্রণয়ন করিতে পারিবে, যথা :-\n(ক) কর আইনজীবী হিসাবে সনদ প্রাপ্তি ও বাতিল ;\n(খ) কর আইনজীবীর আচরণ-বিধি:\n (গ) কর আইনজীবী হিসাবে প্রতিনিধিত্বের অযোগ্যতা; \n(ঘ) কর আইনজীবীর শৃঙ্খলা ও আপিল; এবং\n (ঙ) কর আইনজীবী হিসাবে নিবন্ধন ও পরিচিতিপত্র প্রাপ্তি।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
