import 'package:flutter/material.dart';

class dhara_177 extends StatefulWidget {
  const dhara_177({super.key});

  @override
  State<dhara_177> createState() => _dhara_177State();
}

class _dhara_177State extends State<dhara_177> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "উৎসে করের রিটার্ন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) নিম্নবর্ণিত ব্যক্তিগণ বোর্ড কর্তৃক যেইরূপ উপযুক্ত সেইরূপ নির্ধারিত ফরমে অংশ ৭ এর বিধানাবলির অধীন কর্তনকৃত বা সংগ্রহকৃত করের রিটার্ন দাখিল করিবেন:\n(ক) 	স্থানীয় কর্তৃপক্ষ, স্বায়ত্তশাসিত সংস্থা, সরকারের কোনো কর্তৃপক্ষ, বাংলা ভাষায় পাঠদানকারী প্রাথমিক বা প্রাক-প্রাথমিক বিদ্যালয়, সরকারি মাধ্যমিক বা উচ্চ মাধ্যমিক বিদ্যালয়, বা মাসিক পেমেন্ট আদেশভুক্ত (এমপিও) কোনো শিক্ষা প্রতিষ্ঠান ব্যতীত অন্যান্য কোম্পানি;\n(খ) 	ফার্ম;\n(গ) 	ব্যক্তিসংঘ;\n(ঘ) 	বেসরকারি হাসপাতাল;\n(ঙ) 	ক্লিনিক\n(চ) 	ডায়াগনস্টিক সেন্টার।\n (২) উপ-ধারা (১) এর অধীন রিটার্ন-\n(ক) 	করদাতা যে উপকর কমিশনারের অধিক্ষেত্রের আওতাধীন তাহার নিকট দাখিল করিতে হইবে;\n (খ) 	নির্ধারিত ফরমে সংশ্লিষ্ট বিবরণ ও তথ্যাদি এবং তফসিল, বিবৃতি, হিসাব, পরিশিষ্ট বা দলিলাদি সহযোগে দাখিল করিতে হইবে;\n (গ) 	ধারা ১৬৯ এর উপ-ধারা (৫) এ বর্ণিত পদ্ধতিতে স্বাক্ষরিত ও প্রতিপাদন করিতে হইবে;\n (৩) উপ-ধারা (১) এর অধীন রিটার্ন নিম্নবর্ণিত সময়ে দাখিল করিতে হইবে, যথা:-\n (ক) 	প্রতি মাসের ১৫ (পনেরো) তারিখের মধ্যে পূর্ববর্তী মাসের জন্য প্রযোজ্য রিটার্ন দাখিল করিতে হইবে; এবং\n (খ) 	যেইক্ষেত্রে কোনো মাসের ১৫ (পনেরো) তারিখ সাপ্তাহিক বা সরকারি কোনো ছুটির দিন সেইক্ষেত্রে পরবর্তী অফিস খোলার দিন;\n (৪) উপকর কমিশনার এই ধারার অধীন রিটার্ন দাখিলের সময় নির্ধারিত তারিখ হইতে অনধিক ১৫ (পনেরো) দিন বা উক্ত মাসের শেষ দিন পর্যন্ত বৃদ্ধি করিতে পারিবেন।\n (৫) বোর্ড, সরকারি গেজেটে প্রজ্ঞাপন দ্বারা, ইলেকট্রনিক, যন্ত্রে পাঠযোগ্য বা কম্পিউটারে পাঠযোগ্য মাধ্যমে রিটার্ন দাখিলের ক্ষেত্র, ফরম ও পদ্ধতি নির্ধারণ করিতে পারিবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
