import 'package:flutter/material.dart';

class dhara_166 extends StatefulWidget {
  const dhara_166({super.key});

  @override
  State<dhara_166> createState() => _dhara_166State();
}

class _dhara_166State extends State<dhara_166> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "রিটার্ন দাখিল",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                  "(১) প্রত্যেক ব্যক্তি উপকর কমিশনারের নিকট সংশ্লিষ্ট আয়বর্ষের জন্য রিটার্ন দাখিল করিবেন, যদি-\n  (ক) 	সংশ্লিষ্ট আয়বর্ষে তাহার আয় এই আইনের অধীন করমুক্ত আয়ের সীমা অতিক্রম করে;\n (খ) 	সংশ্লিষ্ট আয়বর্ষের অব্যবহিত পূর্ববর্তী ৩ (তিন) বৎসরের মধ্যে কোনো বৎসর তাহার কর নির্ধারণ করা হয়;\n(গ)	উক্ত ব্যক্তি একটি কোম্পানি, কোনো শেয়ারহোল্ডার পরিচালক বা কোনো কোম্পানির শেয়ারহোল্ডার কর্মচারী, কোনো ফার্ম, কোনো ফার্মের অংশীদার, কোনো ব্যক্তিসংঘ, কোনো ব্যবসায় নির্বাহী বা ব্যবস্থাপকের পদধারী কোনো কর্মচারী, কোনো গণকর্মচারী হন বা কোনো অনিবাসী হন যাহার বাংলাদেশে স্থায়ী স্থাপনা রহিয়াছে;\n(ঘ)	উক্ত ব্যক্তি, কেবল দাতব্য উদ্দেশ্যে প্রতিষ্ঠিত কোনো প্রতিষ্ঠান ব্যতীত, সংশ্লিষ্ট আয়বর্ষে এইরূপ কোনো আয় প্রাপ্ত হন, যাহা অংশ ৬ এর প্রথম অধ্যায়ের অধীন কর অব্যাহতি বা হ্রাসকৃত করহার সুবিধাপ্রাপ্ত;\n(ঙ) 	ধারা ২৬১ অনুসারে করদাতা হিসাবে নিবন্ধনযোগ্য কোনো ব্যক্তি; বা\n(চ)	উক্ত ব্যক্তির ধারা ২৬৪ অনুযায়ী রিটার্ন দাখিলের প্রমাণ দাখিলের বাধ্যবাধকতা রহিয়াছে।\n(২) নিম্নবর্ণিত ক্ষেত্রসমূহে রিটার্ন দাখিল বাধ্যতামূলক হইবে না, যথা:-\n (ক)	কোনো শিক্ষা প্রতিষ্ঠান-\n(অ)	যাহা বাংলা ভাষায় পাঠদানকারী প্রাথমিক বা প্রাক-প্রাথমিক বিদ্যালয় বা সরকারি মাধ্যমিক বা উচ্চ মাধ্যমিক বিদ্যালয়, বা যাহা মাসিক পেমেন্ট আদেশভুক্ত (এমপিও) শিক্ষা প্রতিষ্ঠান; এবং\n(আ)	যাহার ইংরেজি ভার্সন কারিকুলাম নাই;\n(খ)	সরকারি বিশ্ববিদ্যালয়;\n (গ) 	বাংলাদেশ ব্যাংক ;\n  (ঘ)	স্থানীয় কর্তৃপক্ষ;\n(ঙ)	সংবিধিবদ্ধ সরকারি কর্তৃপক্ষ বা সায়ত্বশাসিত সংস্থা, যাহার সরকারের নিকট হইতে প্রাপ্ত তহবিল ও সুদ আয় ব্যতীত অন্য কোনো আয় নাই ;\n(চ)	আপাতত বলবৎ কোনো আইন দ্বারা বা আইনের অধীন প্রতিষ্ঠিত বা গঠিত যেকোনো সত্তা যাহাদের সরকারের নিকট হইতে প্রাপ্ত তহবিল ব্যতীত অন্য কোনো আয় নাই;\n(ছ)	সরকারি ভবিষ্য তহবিল এবং সরকারি পেনশন তহবিল;\n(জ)	কোনো অনিবাসী স্বাভাবিক ব্যক্তি যাহার বাংলাদেশে কোনো নির্দিষ্ট ভিত্তি (ভরীবফ নধংব) নাই; বা\n(ঝ)	বোর্ড কর্তৃক, সরকারি গেজেটে প্রজ্ঞাপন দ্বারা, রিটার্ন দাখিল করা হইতে অব্যাহতিপ্রাপ্ত ব্যক্তিবর্গ।",
                  style: TextStyle(fontSize: 15)),
            ],
          )),
    );
  }
}
