import 'package:flutter/material.dart';

class dhara_169 extends StatefulWidget {
  const dhara_169({super.key});

  @override
  State<dhara_169> createState() => _dhara_169State();
}

class _dhara_169State extends State<dhara_169> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "রিটার্ন দাখিলের সাধারণ নিয়মাবলি। ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) বোর্ড কর্তৃক নির্ধারিত ফরমে প্রয়োজনীয় বিবরণ ও তথ্যাদি প্রদান করিয়া নির্ধারিত তফসিলসমূহ, বিবৃতি, হিসাব, পরিশিষ্ট বা দলিলাদিসহ রিটার্ন দাখিল করিতে হইবে।\n(২) কোম্পানি বা দীর্ঘমেয়াদি চুক্তি সম্পাদন হইতে আয়প্রাপ্ত কোনো ব্যক্তির রিটার্নের সহিত নিম্নবর্ণিত দলিলাদি সংযুক্ত করিতে হইবে, যথা :-\n(ক) 	নিরীক্ষিত আর্থিক বিবরণী;\n(খ) 	যাচাইয়ের নিমিত্ত বোর্ড কর্তৃক, সময় সময়, নির্ধারিত মানদÐ অনুসরণের প্রমাণ; এবং\n (গ) 	আর্থিক বিবরণীতে প্রদর্শিত লাভ-ক্ষতি এবং রিটার্নে প্রদর্শিত আয়ের মধ্যকার পার্থক্যের ব্যাখ্যাসহ একটি পৃথক পরিগণনা পত্র।\n (৩) কোনো আয়বর্ষে আন্তর্জাতিক লেনদেন রহিয়াছে এইরূপ কোনো সত্তার ক্ষেত্রে, ধারা ২৩৮ এর অধীন আন্তর্জাতিক লেনদেন সম্পর্কিত একটি বিবরণী রিটার্নের সহিত দাখিল করিতে হইবে।\n(৪) কোনো অনিবাসী বাংলাদেশি তাহার রিটার্নের ভিত্তিতে করদায়ের পরিশোধের প্রমাণাদিসহ রিটার্ন নিকটস্থ বাংলাদেশ মিশনে দাখিল করিতে পারিবেন এবং মিশন উহার দাপ্তরিক সিলসহ উক্ত রিটার্নের একটি প্রাপ্তি স্বীকার পত্র প্রদান করিবে এবং রিটার্নটি বোর্ডের নিকট প্রেরণ করিবে।\n(৫) রিটার্ন নিম্নবর্ণিত ব্যক্তি কর্তৃক স্বাক্ষরিত ও প্রতিপাদিত হইতে হইবে, যথা:-\n(ক)	কোনো স্বাভাবিক করদাতার ক্ষেত্রে, করদাতা স্বয়ং; তিনি বাংলাদেশে না থাকিলে সংশ্লিষ্ট কোনো ব্যক্তি কর্তৃক বা এতদুদ্দেশ্যে তৎকর্তৃক ক্ষমতাপ্রাপ্ত কোনো ব্যক্তি কর্তৃক, এবং তিনি মানসিক অপ্রকৃতিস্থতার কারণে স্বাভাবিক কার্য করিতে অপারগ হইলে, তাহার অভিভাবক কর্তৃক বা তাহার পক্ষে স্বাক্ষর করিতে আইনগতভাবে উপযুক্ত কোনো ব্যক্তি;\n(খ)	কোনো হিন্দু অবিভক্ত পরিবারের ক্ষেত্রে, পরিবারের কর্তা কর্তৃক, এবং কর্তা বাংলাদেশে অবস্থান না করিলে বা মানসিক অক্ষমতার কারণে স্বাভাবিক কার্য করিতে অপারগ হইলে, উক্ত পরিবারের কোনো প্রাপ্তবয়স্ক ব্যক্তি;\n(গ)	কোনো কোম্পানি বা স্থানীয় কর্তৃপক্ষের ক্ষেত্রে, প্রধান কর্মকর্তা;\n(ঘ) 	কোনো ফার্মের ক্ষেত্রে, কোনো নাবালক অংশীদার ব্যতীত, উহার যেকোনো অংশীদার;\n(ঙ) 	অন্য কোনো সংঘের ক্ষেত্রে, সংঘের কোনো সদস্য বা মুখ্য কর্মকর্তা; এবং\n(চ) 	অন্যান্য ব্যক্তির ক্ষেত্রে, উক্ত ব্যক্তি কর্তৃক বা তাহার পক্ষে স্বাক্ষর করিতে আইনগতভাবে উপযুক্ত কোনো ব্যক্তি।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
