import 'package:flutter/material.dart';

class dhara_167 extends StatefulWidget {
  const dhara_167({super.key});

  @override
  State<dhara_167> createState() => _dhara_167State();
}

class _dhara_167State extends State<dhara_167> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "পরিসম্পদ ও দায়ের বিবরণী দাখিল- ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই ধারার অন্যান্য বিধানাবলি সাপেক্ষে, প্রত্যেক স্বাভাবিক করদাতা আবশ্যিকভাবে পরিসম্পদ ও দায়ের বিবরণী দাখিল করিবেন, যদি উক্ত ব্যক্তিÑ\n(ক) 	আয়বর্ষের শেষ তারিখে ৪০ (চল্লিশ) লক্ষ টাকার অধিক মোট সম্পত্তির মালিক হন; বা\n (খ)	আয়বর্ষের যেকোনো সময় কোনো মোটরযানের মালিক হন; বা\n(গ) 	সিটি কর্পোরেশন এলাকার মধ্যে সংশ্লিষ্ট আয়বর্ষে গৃহ সম্পত্তি বা অ্যাপার্টমেন্টে বিনিয়োগ করেন; বা\n (ঘ)	আয়বর্ষের কোনো সময়ে বিদেশে কোনো পরিসম্পদের মালিক হন; বা\n (ঙ) 	কোনো কোম্পানির শেয়ারহোল্ডার পরিচালক হন: তবে শর্ত থাকে যে, এই উপ-ধারার শর্তাবলি পালন সাপেক্ষে সকল গণকর্মচারী আবশ্যিকভাবে পরিসম্পদ ও দায়ের বিবরণী দাখিল করিবেন।\n(২) প্রত্যেক নিবাসী বাংলাদেশি স্বাভাবিক করদাতা তাহার রিটার্নে বাংলাদেশে এবং বাংলাদেশের বাহিরে অবস্থিত সকল প্রকার পরিসম্পদ ও দায়ের বিবরণী দাখিল করিবেন।\n (৩) প্রত্যেক অনিবাসী বাংলাদেশি স্বাভাবিক করদাতা তাহার রিটার্নে বাংলাদেশে অবস্থিত সকল প্রকার পরিসম্পদ ও দায়ের বিবরণী দাখিল করিবেন।\n (৪) এইরূপ প্রত্যেক বিদেশি স্বাভাবিক করদাতা যিনি বাংলাদেশি নহেন তাহার রিটার্নে বাংলাদেশে অবস্থিত সকল প্রকার পরিসম্পদ ও দায়ের বিবরণী দাখিল করিবেন।\n(৫) কোনো স্বাভাবিক করদাতার জন্য উপ-ধারা (১) এর অধীন পরিসম্পদ ও দায়ের বিবরণী পূরণ বাধ্যতামূলক না হইলেও, তিনি স্বেচ্ছায় পরিসম্পদ ও দায়ের বিবরণী দাখিল করিতে পারিবেন।\n(৬) কোনো স্বাভাবিক করদাতার পরিসম্পদ ও দায়ের বিবরণীতে সংশ্লিষ্ট ব্যক্তির স্বামী বা স্ত্রী বা নাবালক সন্তানের পরিসম্পদ ও দায়ের বিবরণীও দাখিল করিতে হইবে যদি তাহাদের পৃথক টিআইএন না থাকে।\n (৭) উপকর কমিশনার, লিখিত নোটিশ দ্বারা, কোনো ব্যক্তিকে যেকোনো আয়বর্ষের জন্য পরিসম্পদ ও দায়ের বিবরণী দাখিল করিতে বলিতে পারিবেন, যদি-\n (ক) 	উক্ত ব্যক্তি সংশ্লিষ্ট আয়বর্ষে পরিসম্পদ ও দায়ের বিবরণী দাখিল না করিয়া থাকেন; বা\n(খ) 	উক্ত করদাতার সংশ্লিষ্ট আয়বর্ষের করদায় নির্ধারণের জন্য উক্ত পরিসম্পদ ও দায়ের বিবরণী আবশ্যক বলিয়া প্রতীয়মান হইয়া থাকে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
