import 'package:flutter/material.dart';

class dhara_223 extends StatefulWidget {
  const dhara_223({super.key});

  @override
  State<dhara_223> createState() => _dhara_223State();
}

class _dhara_223State extends State<dhara_223> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " সম্পত্তির অন্তর্বর্তীকালীন অবরুদ্ধকরণ বা ক্রোক",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের অধীন কার্যসম্পাদনকালে, যেইক্ষেত্রে মহাপরিচালক (কেন্দ্রীয় গোয়েন্দা সেল) বা কমিশনারের নিকট এই মর্মে সুনির্দিষ্ট তথ্য থাকে যে, কোনো ব্যক্তি তাহার আয় বা বিনিয়োগ সংক্রান্ত তথ্যাদি গোপন করিয়াছেন, সেইক্ষেত্রে তিনি, লিখিত আদেশ দ্বারা, কোনো ব্যক্তি, যাহার অধিকারে এই মুহূর্তে কোনো অর্থ, বুলিয়ান, অলংকার, আর্থিক দলিল, আর্থিক পরিসম্পদ, মূল্যবান দ্রব্য বা অন্য কোনো সম্পত্তি রহিয়াছে তাহাকে আদেশ প্রদানকারী কর্তৃপক্ষের পূর্বানুমতি ব্যতিরেকে তাহা অপসারণ, হস্তান্তর বা অন্য কোনোভাবে বিলিব্যবস্থা না করিবার নির্দেশ প্রদান করিতে পারিবেন ।\n(২) উপ-ধারা (১) এর অধীন আদেশ প্রদানের তারিখ হইতে এক বৎসর উত্তীর্ণ হইবার পর এইরূপ আদেশের কোনো কার্যকারিতা থাকিবে না। \n(৩) উপ-ধারা (১) এ উল্লিখিত আয়কর কর্তৃপক্ষ বোর্ডের অনুমোদন সাপেক্ষে, উক্ত মেয়াদ বৃদ্ধি করিতে পারিবে: তবে শর্ত থাকে যে, মেয়াদ বৃদ্ধির সময় কোনোক্রমেই সাকুল্যে ১ (এক) বৎসরের অধিক হইবে না।\n(৪) উপ-ধারা (২) ও (৩) এ উল্লিখিত মেয়াদ হিসাব করিবার ক্ষেত্রে, উপ-ধারা (১) এর অধীন প্রদত্ত আদেশ আদালত কোনো মেয়াদের জন্য স্থগিত করিলে উক্ত মেয়াদ, যদি থাকে, গণনা হইতে বাদ যাইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
