import 'package:flutter/material.dart';

class dhara_133 extends StatefulWidget {
  const dhara_133({super.key});

  @override
  State<dhara_133> createState() => _dhara_133State();
}

class _dhara_133State extends State<dhara_133> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "প্রকাশ্য নিলামের বিক্রি হইতে কর সংগ্রহ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো ব্যক্তি কোনো নির্দিষ্ট। মালিকের কোনো পণ্য বা সম্পত্তি সীলমোহরযুক্ত দরপত্রের মাধ্যমে প্রকাশ্য নিলামে বিক্রয় করিলে উক্ত পণ্য বা সম্পত্তির স্বত্ব হস্তান্তর অথবা কোনো অধিকার চর্চার অনুমতি প্রদানের পূর্বে মোট বিক্রয় মূল্যের উপর ১০% (দশ শতাংশ) হারে কর সংগ্রহ করিতে হইবে।\n (২) প্রকাশ্য নিলামে চা বিক্রয়ের ক্ষেত্রে ১% (এক শতাংশ) হারে উৎসে কর সংগ্রহ করিতে হইবে।\n (৩) প্রকাশ্য নিলামের মাধ্যমে প্লট আকারে কোনো জমি বিক্রয় করা হইলে এই ধারার অধীন কর কর্তন প্রযোজ্য হইবে না।\n (৪) 	এই ধারার উদ্দেশ্যপূরণকল্পে,\n (ক) 	“কোনো পণ্য বা সম্পত্তি বিক্রয়” অর্থে কোনো পণ্য বা সম্পত্তির ইজারা, জলমহাল, বালুমহাল, সায়রাত মহালের ইজারা, যেকোনো প্রকারের অধিকারের ইজারা, অক্ট্রয় ফি (ড়পঃৎড়র ফঁঃরবং) বা অন্যান্য আরোপনীয় কর, যে নামেই অভিহিত হউক না কেন, সংগ্রহের অধিকারসহ কোনো ব্যক্তির নামে কোনো ইজারা প্রদানের অধিকারকে অন্তর্ভুক্ত করে, তবে কোনো জমির প্লট বিক্রয় ইহার অন্তর্ভুক্ত হইবে না;\n (খ)	নির্দিষ্ট মালিক অর্থ সরকার বা অন্য কোনো কর্তৃপক্ষ, ইউনিটসহ কোনো কর্পোরেশন বা সংস্থা, যাহার কার্যক্রম বা প্রধান কার্যক্রম কোনো আইন, অধ্যাদেশ, আদেশ বা আইনের মর্যাদাসম্পন্ন দলিল দ্বারা অনুমোদিত বা বাংলাদেশে বলবৎ কোনো আইনের অধীন অনুমোদিত বা প্রতিষ্ঠিত কোনো সত্তা বা কোনো কোম্পানি।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
