import 'package:flutter/material.dart';

class dhara_124 extends StatefulWidget {
  const dhara_124({super.key});

  @override
  State<dhara_124> createState() => _dhara_124State();
}

class _dhara_124State extends State<dhara_124> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কোনো সেবা, রেভিনিউ শেয়ারিং, ইত্যাদি বাবদ বিদেশ হইতে প্রেরিত আয় হইতে কর কর্তন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                " ফি, সেবা চার্জ বা পারিশ্রমিক, তাহা যে নামেই অভিহিত হউক না কেন, বা যেকোনো নামে বা প্রকৃতির রেভিনিউ শেয়ারিং এর মাধ্যমে নিম্নবর্ণিত কাজের বিনিময়ে বিদেশ হইতে প্রেরিত অর্থ কোনো ব্যক্তির হিসাবে পরিশোধ বা জমা প্রদানের জন্য দায়িত্বপ্রাপ্ত ব্যক্তি প্রাপকের হিসাবে অর্থ পরিশোধ বা জমা প্রদানকালে উক্ত পরিশোধিত বা জমাকৃত অর্থের উপর ১০% (দশ শতাংশ) হারে কর কর্তন করিবেন, যথা:-\n(ক)	বাংলাদেশে প্রদত্ত কোনো সেবার জন্য;\n (খ) 	কোনো নিবাসী ব্যক্তি কর্তৃক কোনো বিদেশি ব্যক্তিকে পরিষেবা প্রদান বা কোনো কাজের জন্য;\n(গ)	বিজ্ঞাপন বা অন্য কোনো উদ্দেশ্যে কোনো অনলাইন প্লাটফর্ম ব্যবহারের অনুমতি প্রদানের জন্য: তবে শর্ত থাকে যে,\n(১) ম্যানুফ্যাকচারিং, প্রসেস কনভারশন, পূর্ত কাজ, নির্মাণ, প্রকৌশল বা সমজাতীয় অন্য কোনো কাজের জন্য সম্পাদিত চুক্তির বিপরীতে বিদেশ হইতে বাংলাদেশে প্রেরিত অর্থ প্রাপকের হিসাবে অর্থ পরিশোধ বা জমা প্রদানকালে উক্ত পরিশোধিত বা জমাকৃত অর্থের উপর ৭.৫% (সাত দশমিক পাঁচ শতাংশ) হারে কর কর্তন করিতে হইবে:\n (২) বিদেশ হইতে প্রেরিত নিম্নবর্ণিত অর্থের বিপরীতে কোনো কর্তন করা যাইবে না, যথা:-\n (অ)	ষষ্ঠ তফসিলের অংশ ১ এর দফা ১৭ ও ৩৩ দ্বারা মোট আয় বহির্ভূত অর্থ;\n(আ)	কোনো নিবাসীর সফটওয়্যার বা সেবার বিক্রয়লব্ধ অর্থ, যদি উক্ত বিক্রয় বা সেবা হইতে প্রাপ্ত আয় ষষ্ঠ তফসিলের অংশ ১ এর দফা ২১ এর মোট আয় বহির্ভূত অর্থ হয়।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
