import 'package:flutter/material.dart';

class dhara_262 extends StatefulWidget {
  const dhara_262({super.key});

  @override
  State<dhara_262> createState() => _dhara_262State();
}

class _dhara_262State extends State<dhara_262> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "করদাতার নিবন্ধন বাতিল",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১)একজন ব্যক্তি নিবন্ধন বাতিলের আবেদন করিবেন, যদি উক্ত ব্যক্তি- (ক) ধারা ২৬৪ এর অধীন রিটার্ন দাখিলের প্রমাণ উপস্থাপনে আর বাধ্য না হন এবং- \n(অ) ধারা ২ এর দফা ২২ এর অধীন করদাতা হিসাবে আর সংজ্ঞায়িত না হন;\n(আ) পরপর বিগত ৩ (তিন) বৎসর করযোগ্য আয় শূন্য হন এবং শারীরিক অক্ষমতার কারণে বা অন্য কোনো কারণে ভবিষ্যতে কোনো করযোগ্য আয় শূন্য থাকিবেন; বা\n    (ই) ধারা ১৬৬ এর অধীন আর রিটার্ন দাখিলের প্রয়োজন নাই;\n(খ) মৃত্যু, অবসায়ন, অবলুপ্তি (dissolution) বা অনুরূপ অন্য কোনো কারণে অস্তিত্বহীন হইয়া যান; \n  (গ) স্থায়ীভাবে বাংলাদেশ ত্যাগ করেন এবং বাংলাদেশে আয় উপার্জক কোনো কর্মকাÐ করিবেন না;\n    (ঘ) ডুিপ্লকেট (duplicate) নিবন্ধন বা ভুল নিবন্ধন পাইয়া থাকেন;\n(ঙ) আইনি মর্যাদা পরিবতর্ন করেন;\n(চ) অন্য কোনো আইনানুগ কারণ প্রদর্শন করেন।\n(২) আয়কর কর্তৃপক্ষ, নিবন্ধন বাতিলের আবেদন প্রাপ্তির পর, আবেদনের বিষয়ে াচাই-বাছাই করিয়া করদাতার নিবন্ধন বাতিল করিতে পারিবেন, যদি তিনি নিশ্চিত হন যে\n    (ক) করদাতা কর্তৃক পরিশোধিতব্য কোনো বকেয়া দায় নাই ;\n    (খ) করদাতার বিরুদ্ধে কোনো কর নির্ধারণ নিষ্পন্নাধীন নাই ;\n(গ) কোনো ফোরামে আয়কর সংক্রান্ত কোনো বিরোধ নিষ্পন্নাধীননাই; এবং\n    (ঘ) করদাতা কর্তৃক উপ-ধারা (১) এর অধীনে নিবন্ধন বাতিলের যে কারণ উল্লেখ করিয়াছেন উহার সত্যতা রহিয়াছে। \n    (৩) বোর্ড নিম্নবর্ণিত বিষয়ে স্বতঃপ্রবৃত্ত হইয়া কোনো করদাতার নিবন্ধন বাতিল করিতে পারিবে, যথা:-\n(ক) উপ-ধারা (১) এবং (২) এর অধীন কোনো করদাতাকে নিবন্ধন বাতিলের যুক্তি রহিয়াছে;\n(খ) কোনো করদাতার প্রকৃত বা বৈধ উৎসের কোনো আয় নাই বলিয়া বিশ্বাস করিবার যুক্তিসঙ্গত কারণ রহিয়াছে;\n(গ) নিবন্ধনটি আর্থিক অপরাধ সংঘটনের লক্ষ্যে বা অর্থ পাচারের কোনো স্কিমের অংশ হিসাবে করা হইয়াছে; বা\n (ঘ) নিবন্ধন প্রক্রিয়ায় প্রদত্ত তথ্য ভুল এবং অসত্য।\n(৪) বোর্ড যেইরূপ উপযুক্ত বিবেচনা করিবে, সেইরূপে নিবন্ধন বাতিলকৃত করদাতার সমস্ত তথ্য এবং রেকর্ড নির্দিষ্ট সময় পর্যন্ত সংরক্ষণ করিতে পারিবে। \n(৫) এই ধারার উদ্দেশ্যপূরণকল্পে, &quot;নিবন্ধন বাতিল&quot; অর্থ একটি টিআইএন এর নিষ্ক্রিয়করণ (inactive) রহিতকরণ (dormant) এবং সবর্স াধারণের ব্যবহার অনুপযোগীকরণ, কিন্তু ইতিমধ্যে প্রাপ্ত তথ্যের বিলোপ (deletion) বা মোচন (erasure) বুঝাইবে না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
