import 'package:flutter/material.dart';

class dhara_258 extends StatefulWidget {
  const dhara_258({super.key});

  @override
  State<dhara_258> createState() => _dhara_258State();
}

class _dhara_258State extends State<dhara_258> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "অবলুপ্তির প্রক্রিয়াধীন প্রাইভেট কোম্পানির করের জন্য লিকুইডেটরের দায়",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) আদালতের আদেশের মাধ্যমে বা অন্য কোনোভাবে অবলুপ্ত (ড়িঁহফ ঁঢ়) কোনো প্রাইভেট কোম্পানির লিকুইডেটর, তাহার লিকুইডেটর হিসাবে নিযুক্ত হইবার ৩০ (ত্রিশ) দিনের মধ্যে তাহার নিযুক্তির বিষয়ে যে উপকর কমিশনারের অধীন উক্ত কোম্পানির কর নির্ধারণের অধিক্ষেত্র রহিয়াছে তাহার নিকট নোটিশ প্রদান করিবেন।\n(২) উপকর কমিশনার উপ-ধারা (১) এর অধীন নোটিশ প্রাপ্তির তারিখ হইতে ৩ (তিন) মাসের মধ্যে, তাহার নিজস্ব বিবেচনায় আবশ্যকীয় তথ্যাদি তলব অথবা প্রয়োজনীয় তদন্ত সম্পন্ন করে, কোম্পানি কর্তৃক উক্ত সময়ে অথবা উক্ত সময়ের পরে প্রদেয় কর পরিশোধের জন্য তাহার মতে যেই পরিমাণ অর্থের প্রয়োজন হইবে সেই সম্পর্কে লিকুইডেটরকে অবগত করিবেন। \n(৩) উপ-ধারা (২) এর অধীন অবগত হইবার পর লিকুইডেটর নোটিশে উল্লিখিত করের সমপরিমাণ অর্থ পৃথক করিয়া রাখিবেন এবং উক্ত অর্থ পৃথক করিবার পূর্বে, কোম্পানি অবলুপ্তির তারিখে কোম্পানি কর্তৃক প্রদেয় কর পরিশোধ অথবা যে সকল ঋণ পরিশোধের ক্ষেত্রে আইন অনুযায়ী সরকারি পাওনার পরিশোধ অপেক্ষা অগ্রাধিকার প্রাপ্য, তাহাদের অর্থ পরিশোধের নিরাপত্তা প্রদানের উদ্দেশ্য ব্যতীত কোম্পানির কোনো সম্পদ পৃথক করিয়া রাখা যাইবে না। \n (৪) লিকুইডেটর কোম্পানির পক্ষে উক্ত পরিমাণ কর পরিশোধের জন্য ব্যক্তিগতভাবে দায়ী থাকিবেন যেই পরিমাণ সম্পর্কে উপ-ধারা (২) এর অধীন অবগত করা হইয়াছে, যদি তিনি--\n(ক) উপ-ধারা (১) এর চাহিদা অনুযায়ী নোটিশ প্রদানে ব্যর্থ হন; বা \n(খ) উপ-ধারা (৩) এর বিধানবলির লঙ্ঘন করেন।\n(৫) যখন একাধিক লিকুইডেটর নিযুক্ত থাকিবে তখন এই ধারার অধীন লিকুইডেটরের আইনগত বাধ্যবাধকতা ও দায়সমূহ সকল লিকুইডেটরের উপর যৌথভাবে এবং পৃথকভাবে বর্তাবে। \n(৬) আপাতত বলবৎ অন্য কোনো আইনে যাহা কিছইু থাকুক না কেন, এই ধারা কার্যকর হইবে। \n(৭) এই ধারার উদ্দেশ্য পূরণকল্পে, “লিকুইডেটর” বলিতে অবলুপ্তির প্রক্রিয়াধীন কোম্পানির পরিসম্পদের গ্রহীতা হিসাবে নিয়োগপ্রাপ্ত ব্যক্তিও অন্তর্ভুক্ত হইবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
