import 'package:flutter/material.dart';

class dhara_252 extends StatefulWidget {
  const dhara_252({super.key});

  @override
  State<dhara_252> createState() => _dhara_252State();
}

class _dhara_252State extends State<dhara_252> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কতিপয় ক্ষেত্রে প্রতিনিধির দায়",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "( ১) কোনো আয়ের বিষয়ে অন্য কোনো ব্যক্তির প্রতিনিধি হিসাবে দায়িত্বপালনকারী প্রত্যেক ব্যক্তি, এই ধারার উদ্দেশ্যপূরণকল্পে, উক্ত আয়ের ক্ষেত্রে - \n (ক) এইরূপ কর্তব্য, দায়িত্ব ও দায়ের আওতাভুক্ত হইবে যেন এইরূপ আয় তাহার সুবিধার্থে তাহার দ্বারা গৃহীত হইয়াছে, বা তাহার বরাবর উদ্ভূত হইয়াছে বা তাহার অনুকূলে জমা হইয়াছে;\n              (খ) তাহার নিজ নামে কর নির্ধারণে দায়ী হইবে; এবং \n          (গ) এই অংশের অন্যান্য বিধানাবলির সাপেক্ষে, এই আইনের সকল উদ্দেশ্যে পূরণকল্পে করদাতা হিসাবে গণ্য হইবে।\n(২) কোনো ব্যক্তি, যাহার কোনো আয়ের জন্য প্রতিনিধি হিসাবে এই ধারার বিধানাবলির আওতায় কর নির্ধারণ করা হইয়াছে তাহার একই আয়ের জন্য এই আইনের অন্য কোনো বিধানের অধীন কর নির্ধারণ করা যাইবে না। \n(৩) এই ধারার কোনো কিছুই উক্ত ব্যক্তি যাহার জন্য বা যাহার পক্ষে বা যাহার সুবিধার জন্য প্রতিনিধি কোনো আয় গ্রহণের অধিকারী সেই ব্যক্তির সরাসরি কর নির্ধারণ বা তাহার নিকট হইতে উক্ত আয়ের উপর প্রদেয় কর আদায়কে বাধাগ্রস্থ করিবে না। \n(৪) এই ধারার উদ্দেশ্যপূরণকল্পে \n(ক) অভিভাবক, ব্যবস্থাপক, বা ট্রাস্টি যিনি কোনো নাবালক, অপ্রকৃতিস্থ বা নির্বো ধ এর জন্য বা তাহার পক্ষে বা তাহার কল্যাণে কোনো আয় গ্রহণ করেন বা গ্রহণের অধিকারী হন, তিনি উক্ত আয়ের জন্য প্রতিনিধি হিসাবে গণ্য হইবেন;\n (খ) আদালতের আদেশবলে বা আদেশাধীনে নিযুক্ত অ্যাডমিনিস্ট্রেটর জেনারেল, অফিসিয়াল ট্রাস্টি, বা কোনো রিসিভার, ম্যানেজার বা অন্য ব্যক্তি তিনি, যে নামেই আখ্যায়িত হন কেন, অন্য কোনো ব্যক্তির জন্য বা তাহার পক্ষে বা তাহার সুবিধার জন্য কোনো আয় গ্রহণ বা গ্রহণের অধিকারী হইলে, উক্ত আয়ের জন্য প্রতিনিধি হইবেন;\n(গ) আইনগতভাবে বৈধ ওয়াকফ্ দলিলসহ আইনানুগভাবে সম্পাদিত লিখিত উইল বা অন্য কোনো দলিল দ্বারা ঘোষিত কোনো ট্রাস্টের অধীন নিযুক্ত ট্রাস্টি বা ট্রা স্টিবর্গ যাহারা অন্য কোনো ব্যক্তির জন্য বা তাহার পক্ষে বা তাহার সুবিধার জন্য কোনো আয় গ্রহণ বা গ্রহণের অধিকারী হন, তাহারা উক্ত আয়ের জন্য প্রতিনিধি হইবেন;\n(ঘ) কোনো ব্যক্তি যিনি ধারা ২৫৩ এর অধীন কোনো অনিবাসীর এজেন্ট হিসাবে বিবেচিত হন, তিনি উক্ত অনিবাসীর যে আয় ধারা ২৭ এর অধীন বাংলাদেশে উদ্ভূত বা অর্জিত হইয়াছে বলিয়া বিবেচিত হইবে সেই আয়ের জন্য প্রতিনিধি হইবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
