import 'package:flutter/material.dart';

class dhara_253 extends StatefulWidget {
  const dhara_253({super.key});

  @override
  State<dhara_253> createState() => _dhara_253State();
}

class _dhara_253State extends State<dhara_253> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "এজেন্ট হিসাবে বিবেচিত ব্যক্তি।-",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের উদ্দেশ্যপূরণকল্পে, নিম্নবর্ণিত ব্যক্তিগণ, উপ-ধারা (২) ও (৩) এর বিধানাবলি সাপেক্ষে, কোনো অনিবাসীর এজেন্ট হিসাবে বিবেচিত হইবেন, যথা:-\n (ক) বাংলাদেশের কোনো ব্যক্তি\n (অ) যিনি অনিবাসীর দ্বারা বা তাহার পক্ষে নিযুক্ত হইয়াছেন;\n(আ) যাহার অনিবাসীর সহিত ব্যবসায়িক সম্পর্ক রহিয়াছে;\(ই) যিনি অনিবাসীর মালিকানাধীন কোনো অর্থ ধারণ করিয়া অথবা প্রাপ্তি বা বন্দোবস্তকে নিয়ন্ত্রণ করেন; \n (ঈ) যিনি অনিবাসীর একজন ট্রা স্টি; বা\n(উ) যাহার নিকট হইতে বা মাধ্যমে অনিবাসী প্রত্যক্ষ বা পরোক্ষভাবে কোনো আয় গ্রহণ করেন;\n(খ) নিবাসী বা অনিবাসী কোনো ব্যক্তি যিনি বাংলাদেশের বাহিরে অবস্থানরত কোনো ব্যক্তির নিকট হইতে বাংলাদেশে অবস্থিত কোনো মূলধনি সম্পদ হস্তান্তরের মাধ্যমে অর্জন করেন; \n(গ) কোনো ব্যক্তি যিনি অন্য কোনো যুক্তিসঙ্গত কারণে অনিবাসীর একজন এজেন্ট হিসাবে ঘোষিত অথবা বিবেচিত হন।\n(২) বাংলাদেশে অবস্থিত কোনো স্বতন্ত্র দালাল যিনি যেকোনো লেনদেনের ক্ষেত্রে সরাসরি অনিবাসী প্রিন্সিপালের সহিত অথবা তাহার পক্ষে কারবার না করিয়া বরং কোনো অনিবাসী দালালের সহিত বা মাধ্যমে কারবার করেন, তিনি উক্ত লেনদেনের ক্ষেত্রে অনিবাসীর এজেন্ট হিসাবে বিবেচিত হইবেন না, যদি- \n(ক) লেনদেনটি অনিবাসী দালালের মাধ্যমে সাধারণ ব্যবসায়িক কার্যক্রম হিসাবে সম্পাদিত হয়; এবং \n(খ) অনিবাসী দালাল তাহার সাধারণ ব্যবসায়িক কার্যক্রমে উক্তরূপ লেনদেন সম্পাদন করেন। \n(৩) উপকর কমিশনার কর্তৃক শুনানির সুযোগ প্রদান ব্যতীত কোনো ব্যক্তি এই আইনের অধীন অনিবাসীর সহিত সম্পর্কের সূত্রে এজেন্ট হিসাবে বিবেচিত হইবেন না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
