import 'package:flutter/material.dart';

class dhara_254 extends StatefulWidget {
  const dhara_254({super.key});

  @override
  State<dhara_254> createState() => _dhara_254State();
}

class _dhara_254State extends State<dhara_254> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "পরিশোধিত কর পুনরুদ্ধারে প্রতিনিধির অধিকার",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কোনো প্রতিনিধি যে, ধারা ২৫২ এর অধীন তাহার দায়ের বিপরীতে, কোনো অঙ্ক পরিশোধ করে, সে যাহার পক্ষে উক্ত অঙ্ক পরিশোধ করিয়াছে তাহার নিকট হইতে পরিশোধিত উক্ত অঙ্ক পুনরুদ্ধারের অধিকারী হইবে, অথবা তাহার দখলে রহিয়াছে বা দখলে আসার সম্ভাবনা রহিয়াছে বা প্রতিনিধি হইবার কারণে তাহার পাইবার সম্ভাবনা রহিয়াছে এইরূপ অর্থ হইতে পরিশোধিত অঙ্কের সমপরিমাণ অর্থ উদ্ধার করিতে পারিবে। \n (২) কোনো প্রতিনিধি, বা অন্য কোনো ব্যক্তি যাহাকে প্রতিনিধি হিসাবে গণ্য করিয়া কর নির্ধারণ করা হইতে পারে, সেই যে ব্যক্তির (অতঃপর “সুবিধাভোগী” হিসাবে উল্লিখিত) পক্ষে ধারা ২৫২ এর অধীন কর পরিশোধের জন্য দায়ী, সেই সুবিধাভোগীকে প্রদেয় কোনো অর্থ হইতে তাহার আনুমানিক করদায়ের অধিক নহে এইরূপ পরিমাণ অর্থ উদ্ধার করিতে পারিবে। \n(৩) সুবিধাভোগী এবং প্রতিনিধির মধ্যে কোনোরূপ মতানৈক্যের ঘটনা বা প্রতিনিধি হিসাবে গণ্য করিয়া কর নির্ধারণ করা হইতে পারে এইরূপ আশঙ্কাগ্রস্থ কোনো ব্যক্তি, যাহা প্রযোজ্য, উপ-ধারা (২) এর অধীন, যেই পরিমাণ অঙ্ক ধরিয়া রাখিবার কথা, উক্ত প্রতিনিধি বা ব্যক্তি উপকর কমিশনারের নিকট হইতে উক্ত অঙ্ক উল্লেখপূবর্ক এই মর্মে সার্টিফিকেট গ্রহণ করিয়া নিশ্চয়তা দিতে পারিবে যে করদায় নিষ্পত্তি না হওয়া পর্যন্ত উক্ত অঙ্ক ধরিয়া রাখা বা মুলতবি থাকিবে এবং এইরূপে গৃহীত সার্টিফিকেট উক্ত অঙ্ক ধরিয়া রাখিবার জন্য হুকুমনামা (warrant) হিসাবে গণ্য হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
