import 'package:flutter/material.dart';

class dhara_260 extends StatefulWidget {
  const dhara_260({super.key});

  @override
  State<dhara_260> createState() => _dhara_260State();
}

class _dhara_260State extends State<dhara_260> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "অনিবাসীর বিমান পরিবহণ ব্যবসায়ের ক্ষেত্রে করদায়",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) এই আইনের অন্যান্য বিধানে যাহা কিছুই থাকুক না কেন, যেইক্ষেত্রে কোনো অনিবাসী স্বতা¡ ধিকারী বা ভাড়াকারী হিসাবে (অতঃপর এই ধারায় প্রিন্সিপাল হিসাবে উল্লিখিত) বিমান পরিবহণ ব্যবসা পরিচালনা করেন, এবং তাহার স্বত্বাধীন বা ভাড়াকত ৃ বিমান বাংলাদেশের কোনো বিমানবন্দরে আগমন করে, সেইক্ষেত্রে উক্ত বিমানবন্দর হইতে বিমানটিতে আরোহিত যাত্রী, গবাদি পশু, ডাক বা মালামাল পরিবহণ বাবদ গৃহীত অর্থের সমষ্টি প্রিন্সিপাল কর্তৃক উক্ত ব্যবসা হইতে বাংলাদেশে অর্জিত আয় হিসাবে বিবেচিত হইবে, যাহা এই আইনের অধীন তাহার &#39;ব্যবসা হইতে আয়&#39; খাতে করযোগ্য হইবে এবং উক্ত আয়ের উপর ৩% (তিন শতাংশ) হারে কর আরোপিত হইবে। \n (২) প্রিন্সিপাল বা এতদুদ্দেশ্যে তৎকর্তৃক ক্ষমতাপ্রাপ্ত কোনো এজেন্ট প্রতি ৩ (তিন) মাসের জন্য রিটার্ন প্রস্তুত করিবেন এবং উপকর কমিশনারের নিকট তাহা প্রত্যেক অর্থবৎসরে র প্রতি ৩ (তিন) মাসের শেষ দিন, অর্থাৎ পর্যায়ক্রমে ৩০ সেপ্টেম্বর, ৩১ ডিসেম্বর, ৩১ মার্চ ও ৩০ জুন, হইতে ৪৫ (পঁয়তাল্লিশ) দিনের মধ্যে নিম্নবর্ণিত তথ্যাদি প্রদর্শন করিয়া দাখিল করিবে, যথা:- \n (ক) উক্ত বিমানবন্দর হইতে বিমানে আরোহিত যাত্রী, গবাদি পশু, ডাক বা মালামাল পরিবহণ বাবদ প্রিন্সিপাল বা তাহার পক্ষে কোনো ব্যক্তিকে, বাংলাদেশের অভ্যন্তরে বা বাহিরে, পরিশোধিত বা প্রদেয় অর্থের পরিমাণ ; এবং \n(খ) বাংলাদেশের বাহিরের কোনো বিমানবন্দর হইতে যাত্রী, গবাদি পশু, ডাক বা মালামাল পরিবহণ বাবদ প্রিন্সিপাল বা তাহার পক্ষে বাংলাদেশের অভ্যন্তরে গৃহীত বা গৃহীত হইবে বলিয়া বিবেচিত অর্থের পরিমাণ। \n(৩) রিটার্ন প্রাপ্তির পর উপকর কমিশনার যেইরূপ প্রয়োজনীয় বিবেচনা করিবেন সেইরূপ বিবরণাদি, হিসাব বা দলিলাদি তলবক্রমে উপ-ধারা (২) এ উল্লিখিত মোট অর্থের পরিমাণ নির্ধারণ করিবেন এবং উপ-ধারা (১) এ বর্ণিত পদ্ধতিতে কর আরোপ করিতে পারিবেন।\n  (৪) যেইক্ষেত্রে প্রিন্সিপাল উপ-ধারা (১) এর অধীন প্রদেয় কর ৩ (তিন) মাসের অধিক সময়ের জন্য পরিশোধ করিতে ব্যর্থ হন, সেইক্ষেত্রে কর কমিশনার উক্ত বিমানের ছাড়পত্র মঞ্জুর করিবার এখতিয়ারসম্পন্ন কর্তৃপক্ষ বরাবর প্রিন্সিপালের নাম ও তৎকর্তৃক প্রদেয় করের পরিমাণ উল্লেখক্রমে একটি সার্টিফিকেট ইস্যু করিবেন এবং উক্ত কর্তৃপক্ষ সাটির্ িফকেট প্রাপ্তির পর উক্ত প্রিন্সিপালের স্বত্বাধীন বা ভাড়াকৃত বিমানকে প্রদেয় কর পরিশোধ না করা পর্যন্ত বাংলাদেশের কোনো বিমান বন্দর ত্যাগের ছাড়পত্র মঞ্জুর করিবে না।\n(৫) উপ-ধারা (৩) এর অধীন নিরূপিত প্রাপ্তির সমষ্টিগত অর্থের বিপরীতে কোনো খরচ অনুমোদনের প্রয়াসে এই আইনের অন্য কোনো কিছুকে এখানে ব্যাখ্যা করা যাইবে না।\n(৬) এই ধারার অধীন পরিশোধিত কর, এই আইনের অধীন চূড়ান্ত করদায় হিসাবে বিবেচিত হইবে এবং করদাতা কর্তৃক ধারা ১৬৭ এর অধীন রিটার্ন দাখিল আবশ্যক হইবে না, অথবা তিনি উক্ত রিটার্নের ভিত্তিতে কোনো কর প্রত্যর্পণ বা সমন্বয় দাবি করিতে পারিবেন না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
