import 'package:flutter/material.dart';

class dhara_212 extends StatefulWidget {
  const dhara_212({super.key});

  @override
  State<dhara_212> createState() => _dhara_212State();
}

class _dhara_212State extends State<dhara_212> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কর ও অন্যান্য অঙ্ক পরিশোধ এড়াইয়া যাওয়া । - ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যদি কোনো অডিট, কর নির্ধারণ বা এই আইনের আওতায় গৃহীত কোনো কার্যক্রমের প্রেক্ষিতে বা অন্য কোনো উৎস হইতে প্রাপ্ত সুনির্দিষ্ট তথ্যসূত্রে, উপকর কমিশনারের বিশা¦ স করিবার কারণ থাকে যে, কোনো করদাতা কোনো করবর্ষে এই আইনের আওতায় প্রদেয় কোনো অঙ্কের পরিশোধ এড়াইয়া গিয়াছেন, তাহা হইলে উপকর কমিশনার উক্ত করদাতাকে বোর্ড কতৃক নির্ধারিত ফরমে নোটিশ জারি করিয়ার্ \n (ক) নোটিশে উল্লিখিত সময়ের মধ্যে সংশ্লিষ্ট করবর্ষের জন্য রিটার্ন এবং প্রযোজ্য বিবরণী ও দলিলাদি দাখিল করিতে বলিবেন; এবং\n (খ) যেই পরিমাণ কর পরিশোধ এড়াইয়া যাওয়া হইয়াছে তাহা রিটার্ন দাখিলের সময় বা তাহার পূর্বে পরিশোধের জন্য বলিবেন।\n (২) উপকর কমিশনারÑ\n (ক) নিম্নবর্ণিত শর্তাবলি পূরণ হইলে, রিটার্নের একটি গ্রহণ পত্র প্রেরণ করিবেন, যথা:-\n(অ) উপ-ধারা (১) এর অধীন জারীকৃত নোটিশে উল্লিখিত সময়সীমার মধ্যে এবং উক্ত উপ-ধারার বিধান অনুসরণপূর্বক রিটার্ন দাখিল;\n (আ) রিটার্ন দাখিলের সময়ে বা তাহার পূর্বে যে অঙ্কের পরিশোধ এড়াইয়া যাওয়া হইয়াছে তাহা পরিশোধ; এবং\n (ই) যে ইস্যরু জন্য কর পরিশোধ এড়াইয়া যাওয়া হইয়াছে তাহা সুস্পষ্টভাবে রিটার্নে উল্লেখ;n(খ) দফা (ক)-তে উল্লিখিত শর্তসমূহের যেকোনো একটি পূরণ করা না হইলে ধারা ১৮৩ বা, প্রযোজ্য ক্ষেত্রে, ধারা ১৮৪ এর অধীন কর নির্ধারণে অগ্রসর হইবেন।\n (৩) উপকর কমিশনার উপ-ধারা (১) এর অধীন নোটিশ জারির পূর্বে পরিদর্শী অতিরিক্ত কর কমিশনারের নিকট হইতে লিখিত অনুমোদন গ্রহণ করিবেন, যেইক্ষেত্রে- \n(ক) ধারা ১৮০ এর উপ-ধারা (১) এর বিধান পরিপালনপূর্বক সংশিষ্টø করবর্ষের রিটার্ন দাখিল করা হইয়াছে; অথবা\n (খ) এই আইনের অন্য কোনো বিধানের অধীন সংশ্লিষ্ট করবর্ষের কর নির্ধারণ সম্পন্ন করা হইয়াছে।\n (৪) উপকর কমিশনার উপ-ধারা (১) এর অধীন নোটিশ জারি করিতে পারেন-\n (ক) সংশ্লিষ্ট করবর্ষে কোনো রিটার্ন দাখিল ও কোনো কর নির্ধারণ করা না হইলে, যেকোনো সময়;\n (খ) অন্যান্য ক্ষেত্রে, যে করবর্ষে নোটিশ জারি করিবেন উহা হইতে পূর্বের ষষ্ঠতম করবর্ষ পর্যন্ত: তবে শর্ত থাকে যে,\n(অ) এই আইনের অধীন কোনো বিধানের আওতায় কোনো করবর্ষে নূতন করিয়া কর নির্ধারণ করা হইলে, যে করবর্ষে নূতন করিয়া কর নির্ধারণ করা হইয়াছে, সেই বৎসর সমাপ্তির পর হইতে এই ধারায় বর্ণিত মেয়াদকাল গণনা শুরু হইবে;\n (আ) যেইক্ষেত্রে কোনো ব্যক্তির অপ্রদর্শিত কোনো পরিসম্পদ যাহা দফা (খ)- তে উল্লিখিত ষষ্ঠ করবর্ষেরও অধিককাল পূর্বে অর্জিত হইয়াছে, সেইক্ষেত্রে উক্ত পরিসম্পদ উক্ত ষষ্ঠতম করবর্ষে অর্জিত হইয়াছে বলিয়া গণ্য হইবে।\n (৫) কর নির্ধারণ বা এই আইনের অধীন অন্য কোনো কার্যক্রম গ্রহণের উদ্দেশ্যে তামাদির মেয়াদ গণনার ক্ষেত্রে, আদালত, ট্রাইব্যুনাল বা অন্য কোনো কর্তৃপক্ষ কর নির্ধারণ বা অন্য কোনো কার্যক্রম কোনো মেয়াদের জন্য স্থগিত রাখলে, উক্ত মেয়াদ গণনা হইতে বাদ যাইবে। \n(৬) উপ-ধারা (৪) এ যাহা কিছুই থাককু না কেন, কোনো কর নির্ধারণ বা কোনো আদেশ রদ, নাকচ, বাতিল বা সংশোধন করা হইলে, কার্যক্রমের যে স্তরে উক্ত রদ, নাকচ, বাতিল বা সংশোধন করা হইয়াছিল তাহার পরবর্তী স্তর হইতে সংশ্লিষ্ট আয়কর কর্তৃপক্ষ কার্যক্রম শুরু করিতে পারিবে, এবং এই আইনের কোনো বিধান অনুসারে ইতোমধ্যে জারীকৃত কোনো নোটিশ, পুনঃজারি অথবা ইতোমধ্যে সরবরাহকৃত বা, প্রযোজ্য ক্ষেত্রে, দাখিলকৃত কোনো রিটার্ন, বিবরণী বা অন্য কোনো তথ্য পুনঃসরবরাহ বা পুনঃদাখিল করিবার প্রয়োজন হইবে না।\n (৭) ইতোমধ্যে কর নির্ধারণ সম্পন্ন হইয়াছে এইরূপ কোনো করদাতার সংশিষ্টø করবর্ষের উপ- ধারা (২) এর আওতায় কর নির্ধারণের ক্ষেত্রে উপ-ধারা (১) এর অধীন জারীকৃত নোটিশে উল্লিখিত ইস্যুসমূহের মধ্যে সীমাবদ্ধ থাকিতে হইবে।\n (৮) কোনো করবর্ষে উপ-ধারা (২) এর অধীন কার্যক্রম পূর্বেই সম্পন্ন হইয়াছেকেবল এই কারণে উক্ত করবর্ষের জন্য এই ধারার অধীন কার্যক্রম গ্রহণে উপকর কমিশনারকে বারিত করিবে না। \n(৯) এই ধারার উদ্দেশ্যপুরণকল্পে,-\n(ক) এই আইনের আওতায় প্রদেয় কোনো অঙ্কের পরিশোধ এড়াইয়া যাওয়া হইয়াছে বলিতে বুঝাইবে, যদি-\n(অ) কোনো আয় বা তাহার অংশ বিশেষের কর নির্ধারণ এড়াইয়া যাওয়া হইয়াছে;\n(আ) আয়ের পরিমাণ কম প্রদর্শন করা হইয়াছে;\n(ই) রিটার্নে অতিরিক্ত লোকসান, বিয়োজন, ভাতা বা ছাড় দাবি করা হইয়াছে;\n(ঈ) কোনো আয়ের তথ্য গোপন বা অসত্য পরিমাণে প্রদর্শনের মাধ্যমে বা ধারা ১৬৭ বা ১৬৮ এর অধীন দাখিলকৃত বিবরণীতে কোনো সম্পদ, দায় বা ব্যয়ের তথ্য গোপন বা অসত্য পরিমাণে প্রদর্শন করিবার মাধ্যমে করদায় বা অন্য কোনো অঙ্কের দায় কম প্রদর্শন বা নিরূপণ করা হইয়াছে;\n (উ) করযোগ্য আয় কম নিরূপিত হইয়াছে, বা প্রকৃত কর হার অপেক্ষা কম হারে আয়ের উপর কর আরোপিত হইয়াছে;\n (ঊ) করযোগ্য আয়কে কর অব্যাহতিপ্রাপ্ত আয় হিসাবে বিবেচনা করা হইয়াছে;\n (ঋ) অত্যধিক ছাড় বা লোকসান বা অবচয় ভাতা বা এই আইনের আওতায় অন্য কোনো ভাতা অনুমোদন করিয়া আয় নিরূপণ করা হইয়াছে; বা\n (এ) ভিত্তি কম ধরিবার কারণে এই আইনের আওতায় প্রদে কর বা অন্যান্য প্রদেয় অঙ্ক কম পরিগণিত বা পরিশোধিত হইয়াছে;\n (খ) সংশ্লিষ্ট করবর্ষ হইল এইরূপ করবর্ষ, যাহার ক্ষেত্রে এই আইনের আওতায় কোনো করদাতা কর্তৃক প্রদেয় কোনো অঙ্ক পরিশোধ এড়াইয়া যাওয়া হইয়াছে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
