import 'package:flutter/material.dart';

class dhara_213 extends StatefulWidget {
  const dhara_213({super.key});

  @override
  State<dhara_213> createState() => _dhara_213State();
}

class _dhara_213State extends State<dhara_213> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "ত্রæটিপূর্ণ আদেশ সংশোধনের ক্ষেত্রে পরিদর্শী অতিরিক্ত কর কমিশনারের ক্ষমতা ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) পরিদর্শী অতিরিক্ত কর কমিশনার, যদি বিবেচনা করেন যে, উপকর কমিশনার কর্তৃক প্রদত্ত আদেশ ত্রæটিপূর্ণ এবং তাহা রাজস্ব স্বার্থের পরিপšি,’ তাহা হইলে তিনি এই আইনের অধীন পরিচালিত কার্যক্রমের রেকর্ড তলব ও পরীক্ষা করিতে"
                "পারিবেন এবং করদাতাকে শুনানির সুযোগ প্রদান করিয়া এবং যেইরূপ প্রয়োজন বিবেচনা করিবেন সেইরূপ তদন্ত করিবার বা করাইবার পর পরিস্থিতির নিরিখে তাহার বিবেচনায় যেইরূপ আদেশ প্রদান ন্যায়সংগত হইবে, সেইরূপ আদেশ জারি করাসহ কর নির্ধারণী আদেশ পরিবর্ধন বা পরিবর্তন বা বাতিল করিয়া নূতনভাবে কর নির্ধারণ করিবার জন্য আদেশ জারি করিতে পারিবেন। \n (২) কোনো ঊর্ধ্বতন আয়কর কর্তৃপক্ষ ধারা ১২ এর অধীন উপকর কমিশনারের ক্ষমতা প্রয়োগ করিলে কর কমিশনার উপ-ধারা (১) এ উল্লিখিত কার্যক্রম পরিচালনা করিবেন।\n (৩) কোনো আদেশ জারির তারিখ হইতে ৪ (চার) বৎসর অতিক্রন্ত হইবার পর তাহা সংশোধনের জন্য উপ-ধারা (১) এর অধীন কোনো আদেশ জারি করা যাইবে না।\n(৪) ধারা ২১২ এর কোনো কিছুই, প্রযোজ্য ক্ষেত্রে, এই ধারার অধীন কোনো কার্যক্রম গ্রহণকে বারিত করিবে না।\n(৫) এই ধারায় কোনো আদেশ ত্রæটিপূর্ণ হিসাবে গণ্য হইবে যদি পরিদর্শী অতিরিক্ত কর কমিশনার মনে করেন যে,-\n (ক) আদেশে আয়ের খাত ভলু হইয়াছে;\n (খ) আদেশ জারির ক্ষেত্রে, এই আইনের কোনো বিধানের ভুল ব্যাখ্যা করা হইয়াছে;\n(গ) যাচাই করিবার আবশ্যকতা থাকা সত্তে¡ও কোনোরূপ যাচাই না করিয়া আদেশ জারি করা হইয়াছে;\n (ঘ) দাবিকৃত ছাড়ের বিষয়ে কোনোরূপ তদন্ত না করিয়া ছাড় মানিয়া আদেশ জারি করা হইয়াছে;\n (ঙ) আদেশে বোর্ড কর্তৃক ধারা ১০ এর অধীন জারীকৃত কোনো আদেশ, নির্দেশ বা নির্দেশনা পরিপালন বা অনুসরণ করা হয় নাই; বা\n(চ) রেকর্ড হইতে স্পষ্টত প্রতীয়মান হয় যে, আদেশটি ত্রæটিপূর্ণ।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
