import 'package:flutter/material.dart';

class dhara_76 extends StatefulWidget {
  const dhara_76({super.key});

  @override
  State<dhara_76> createState() => _dhara_76State();
}

class _dhara_76State extends State<dhara_76> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "কর অব্যাহতি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) বোর্ড, সরকারি গেজেটে প্রজ্ঞাপন দ্বারা, কোনো ব্যক্তিকে বা কোনো শ্রেণীর ব্যক্তিগণকে কর অব্যাহতি প্রদান করিতে পারিবে। \n (২) যেইক্ষেত্রে এই আইন ব্যতীত অন্য কোনো আইন বা আইন হিসাবে পরিগণিত অন্য কোনো আইনগত দলিলের বিধানানুযায়ী কোনো ব্যক্তিকে কর অব্যাহতি প্রদান করা হইয়াছে, সেইক্ষেত্রে, অন্য আইনে বা আইনগত দলিলে যাহা কিছুই থাকুক না কেন, উপ-ধারা (১) এর অধীন জারীকৃত প্রজ্ঞাপন দ্বারা, উক্ত ব্যক্তিকে কর অব্যাহতি প্রদান করা না হইলে উক্তরূপ বিধান কার্যকর হইবে না।\n (৩) বোর্ড এই ধারার অধীন প্রজ্ঞাপন জারীর মাধ্যমে যেকোনো কর অব্যাহতি বাতিল করিতে পারিবে।\n(৪) এই আইনের অধীন কোনো কর অব্যাহতি ভূতাপেক্ষভাবে প্রদান করা যাইবে না।\n(৫) অংশ ৬ এবং এই আইনের অন্যান্য বিধানে যাহা কিছুই থাকুক না কেন, এই আইনের অধীন কোনো ব্যক্তি কোনো করবর্ষে কর অব্যাহতি প্রাপ্ত হইবেন না যদি তিনি নিম্নবর্ণিত শর্তাবলির পরিপালনে ব্যর্থ হন, যথা:-\n (ক) 	করদিবসের মধ্যে রিটার্ন দাখিল; বা\n (খ) 	ধারা ১৬৬ এবং ১৭১ এর বিধানাবলি পরিপালনপূর্বক রিটার্ন দাখিল; বা\n (গ) 	উৎসে কর কর্তন, সংগ্রহ, জমা বা এতদসংক্রান্ত রিটার্ন দাখিল এবং অংশ ৭ এর বিধানাবলির পরিপালন; বা\n(ঘ) 	কর অব্যাহতি প্রাপ্ত কোনো খাত হইতে সকল প্রকার প্রাপ্তি ও আয় ব্যাংক ট্রান্সফারের মাধ্যেমে গ্রহণে:"
                " তবে শর্ত থাকে যে, যেইক্ষেত্রে প্রাপ্তির খাত “কৃষি হইতে আয়” হিসাবে পরিগণিত এবং কোনো আয়বর্ষে মোট প্রাপ্তির পরিমাণ ১ (এক) কোটি টাকার ঊর্ধ্বে নহে সেইক্ষেত্রে এই বিধান প্রযোজ্য হইবে না;\n(৬) কর অব্যাহতিপ্রাপ্ত কোনো উৎসের আয় বা ব্যক্তির আয় পরিগণনার ক্ষেত্রে ধারা ৫৫ এর অধীন অননুমোদিত কোনো ব্যয়, ক্ষেত্রমত, উক্ত উৎসের আয় বা ব্যক্তির আয় বলিয়া গণ্য হইবে এবং উক্ত আয়ের উপর নিয়মিত হারে কর প্রদেয় হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
