import 'package:flutter/material.dart';

class dhara_220 extends StatefulWidget {
  const dhara_220({super.key});

  @override
  State<dhara_220> createState() => _dhara_220State();
}

class _dhara_220State extends State<dhara_220> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "জেলা কালেক্টরের মাধ্যমে কর আদায়।",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "( ১ ) উপকর কমিশনার, যেই জেলায় তাহার অফিস অবস্থিত সেই জেলার কালেক্টর বরাবর অথবা যে জেলায় করদাতা বসবাস করেন বা সম্পত্তির মালিক বা ব্যবসা পরিচালনা করেন সেই জেলার কালেক্টর"
                "বরাবর বকেয়া পাওনা অর্থের পরিমাণ উল্লেখ করিয়া তাহার স্বাক্ষরযোগে সার্টিফিকেট"
                "প্রেরণ করিতে পারিবেন, এবং কালেক্টর এইরূপ সাটির্ িফকেট প্রাপ্তির পর করদাতার নিকট"
                "হইতে উক্ত সার্টিফিকেটে উল্লিখিত বকেয়া অর্থ ভূমি রাজস্বের বকেয়ার ন্যায় বিবেচনা"
                "করত তাহা আদায়ের ব্যবস্থা করিবেন।"
                "\n(২) জেলা কালেক্টরের অন্য কোনো ক্ষমতাকে ক্ষুণœ না Code of Civil Procedure, 1908 (Act No. V of 1908)"
                "এর বিধান মোতাবেক ডিক্রির"
                "আওতায় অর্থ আদায়ের জন্য দেওয়ানি আদালতের যে ক্ষমতা রহিয়াছে, উপ-ধারা (১)"
                "এর অধীন তাহার নিকট প্রেরিত সার্টিফিকেটে উল্লিখিত বকেয়া আদায়ের জন্য জেলা"
                "কালেক্টরেরও সেই ক্ষমতা থাকিবে।"
                "\n (৩) উপকর কমিশনার যেকোনো সময় উপ-ধারা (১) এর অধীন জেলা"
                "কালেক্টরের নিকট প্রেরিত সার্টিফিকেট প্রত্যাহার করিয়া আনিতে পারিবেন এবং এইরূপ"
                "প্রত্যাহার করিয়া আনিবার ফলে সার্টিফিকেট সংক্রান্ত সমস্ত কার্যক্রম বাতিল হইবে।"
                "\n (৪) সার্টিফিকেট প্রত্যাহার দ্বারা কালেক্টর কর্তৃক উক্ত প্রত্যাহারের পূর্ব আদায়"
                "ক্ষুণœ হইবে না, এইক্ষেত্রে আদায়কৃত অর্থের সমপরিমাণ অর্থের জন্য সার্টিফিকেট"
                "প্রত্যাহার করা হয় নাই মর্মে গণ্য হইবে; অথবা নূতন করিয়া সার্টিফিকেট ইস্যুর মাধ্যমে"
                "সাটির্ িফকেট প্রত্যাহারের সময় আদায়যোগ্য অর্থ আদায়ের ক্ষেত্রে কোনো বাধা হইবে না।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
