import 'package:flutter/material.dart';

class dhara_218 extends StatefulWidget {
  const dhara_218({super.key});

  @override
  State<dhara_218> createState() => _dhara_218State();
}

class _dhara_218State extends State<dhara_218> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "সাটির্ িফকেট প্রত্যাহার এবং কার্যক্রম স্থগিতকরণের ক্ষমতা। - ",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) ধারা ২১৬ এর অধীন কর আদায়ের লক্ষ্যে সার্টিফিকেট ইস্যু করা সত্তে¡ও, উপকর কমিশনার ট্যাক্স রিকোভারি অফিসারকে ইন্টিমেশন প্রদান করিয়া, তাহা প্রত্যাহার করিবার অথবা কোনো করণিক বা গাণিতিক ভুল সংশোধনের ক্ষমতা সংরক্ষণ করেন।"
                "\n (২) যেই পরিমাণ করদাবি আদায়ের জন্য সার্টিফিকেট জারি করা হয়, আপিল বা এই আইনের আওতায় পরিচালিত অন্য কোনো কার্যক্রমের প্রেক্ষিতে যদি তাহা হ্রাস পায়, কিন্তু আদেশটি চূড়ান্ত মীমাংসার লক্ষ্যে এই আইনের আওতায় আরও কার্যক্রম গ্রহণের আবশ্যকতা থাকে তবে সেইক্ষেত্রে যতক্ষণ পর্যন্ত পরবর্তী আপিল বা মামলার অন্য কোনো কার্যক্রম অমীমাংসিত থাকিবে ততক্ষণ পর্যন্ত উপকর কমিশনার সার্টিফিকেট হইতে হ্রাসকৃত অর্থের সমপরিমাণ অর্থ আদায় স্থগিত রাখিবেন।\n(৩) বকেয়া কর আদায়ের লক্ষ্যে কোনো সার্টিফিকেট ইস্যু করিবার পর আপিল বা এই আইনের অধীন পরিচালিত অন্য কোনো কার্যক্রমের প্রেক্ষিতে বকেয়া দাবির পরিমাণ হ্রাস পাইলে এবং আদেশটির বিষয়বস্তু আপিল বা এই আইনের অধীন পরিচালিত অন্য কোনো কার্যক্রম চূড়ান্ত এবং সমাপ্তিমলূ ক হইলে উপকর কমিশনার সাটির্ িফকেটটির প্রয়োজনীয় সংশোধন বা, প্রয়োজ্য ক্ষেত্রে, প্রত্যাহার করিবেন।\n(৪) উপকর কমিশনার কর আদায় সংক্রান্ত সার্টিফিকেটটি বাতিলকরণ, ভুল সংশোধন, কার্যক্রম স্থগিতকরণ, প্রত্যাহার বা, প্রযোজ্য ক্ষেত্রে, সংশোধন সংক্রান্ত আদেশ সম্পর্কে আদায়কারী কর্মকর্তাকে অবহিত করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
