import 'package:flutter/material.dart';

class dhara_217 extends StatefulWidget {
  const dhara_217({super.key});

  @override
  State<dhara_217> createState() => _dhara_217State();
}

class _dhara_217State extends State<dhara_217> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "( ১ ) আপাতত বলবৎ অন্য কোনো আইনে যাহা কিছুই থাকুক না কেন, ট্যাক্স রিকোভারি অফিসার ধারা "
                "২১৬ এর অধীন সাটির্ িফকেট প্রাপ্তির পর বোর্ড কর্তৃক এতদুদ্দেশ্যে প্রণীত বিধিমালা "
                "মোতাবেক করদাতার নিকট হইতে সার্টিফিকেটে বর্ণিত অর্থ নিম্নবর্ণিত এক বা একাধিক "
                "পদ্ধতিতে আদায় করিবেন, যথা :-"
                "\n(ক) করদাতার যেকোনো স্থাবর বা অস্থাবর সম্পত্তি বাজেয়াপ্ত, অবরুদ্ধ বা ক্রোকপূর্বক বিক্রয় অথবা বাজেয়াপ্ত, অবরুদ্ধ বা ক্রোক না করিয়া বিক্রয়ের মাধ্যমে;\n(খ) করদাতাকে গ্রেপ্তার এবং তাহাকে কারাগারে আটক রাখিবার মাধ্যমে;"
                "\n  (গ) করদাতার স্থাবর এবং অস্থাবর সম্পত্তি ব্যবস্থাপনার জন্য রিসিভার নিয়োগের মাধ্যমে।\n(২) ট্যাক্স রিকোভারি অফিসার, তাহার নিকট উপ-ধারা (১) এর অধীন প্রেরিত সাটির্ িফকেটে উল্লিখিত পরিমাণ অর্থ আদায়কালে খেলাপি করদাতার নিকট হইতে উক্ত"
                "অর্থ ছাড়াও একই পদ্ধতিতে বকেয়া কর আদায় কার্যক্রমের সহিত সংশিষ্টø যেকোনো খরচ ও চার্জসহ কোনো নোটিশ বা গ্রেফতারি পরোয়ানা জারির জন্য ব্যয়িত অর্থও আদায় করিতে পারিবেন। \n (৩) ধারা ২১৬ এর অধীন সাটির্ িফকেট অগ্রায়ন করা হইয়াছে এইরূপ কোনো ট্যাক্স রিকোভারি অফিসার যদি তাহার অধিক্ষেত্রাধীন কোনো করদাতার স্থাবর এবং অস্থাবর সম্পত্তি বিক্রয়ের মাধ্যমে সম্পূর্ণ অর্থ আদায় করিতে সক্ষম না হন, কিন্তু তাহার নিকট এই মর্মে তথ্য থাকে যে, অন্য ট্যাক্স রিকোভারি অফিসারের অধিক্ষেত্রাধীন এলাকায় উক্ত করদাতার সম্পত্তি রহিয়াছে, তবে সেইক্ষেত্রে উক্ত ট্যাক্স রিকোভারি অফিসার যাহার অধিক্ষেত্রাধীন এলাকায় উক্ত করদাতার সম্পত্তি রহিয়াছে বা উক্ত করদাতা বসবাস করেন, তাহার নিকট সংশ্লিষ্ট সার্টিফিকেট পাঠাইতে পারিবেন, অতঃপর উক্ত সার্টিফিকেট প্রাপ্ত কর্মকর্তা এই অধ্যায়ের অধীন অবশিষ্ট অনাদায়ী অঙ্ক আদায়ের জন্য এইরূপভাবে অগ্রসর হইবেন, যেন তিনি উক্ত সার্টিফিকেটটি উপকর কমিশনারের নিকট হইতে প্রাপ্ত হইয়াছেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
