import 'package:flutter/material.dart';

class dhara_221 extends StatefulWidget {
  const dhara_221({super.key});

  @override
  State<dhara_221> createState() => _dhara_221State();
}

class _dhara_221State extends State<dhara_221> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: ListView(
        padding: const EdgeInsets.all(25),
        children: const [
          Text(
            "আদায়ের অন্যান্য পদ্ধতি ",
            style: TextStyle(fontSize: 25),
          ),
          SizedBox(height: 10),
          Text(
            "(১) বকেয়া কর আদায়ের লক্ষ্যে ধারা ২১৬ বা ধারা ২২০ এর অধীন সার্টিফিকেট ইস্যু করা সত্তে¡ও, উপকর কমিশনার উপ-ধারা (২)"
            "বা (৩) এ বর্ণিত পদ্ধতিতে উহা আদায় করিতে পারিবেন।"
            "\n (২) কোনো আপিল ফোরামে বিচারাধীন নহে করদাতার নিকট এইরূপ করদাবি"
            "আদায়ের উদ্দেশ্যে উপকর কমিশনার, করদাতাকে শুনানির সুযোগ প্রদান করিয়া,"
            "কমিশনারের পূর্বানুমোদন সাপেক্ষে, উল্লিখিত করদাবি আদায় না হওয়া পর্যন্ত উক্ত"
            "করদাতার ব্যবসার স্থান হইতে যেকোনো পণ্য এবং সেবার স্থানান্তর নিষিদ্ধ করিতে"
            ""
            ""
            "পারিবেন এবং ব্যবসার স্থান বন্ধও করিতে পারিবেন অথবা এইরূপ কর আদায়ের জন্য"
            "যেকোনো সন্তোষজনক ব্যবস্থা গ্রহণ করিতে পারিবেন।\n"
            "(৩) করদাতার নিকট পাওনা করদাবি আদায়ের উদ্দেশ্যে, উপকর কমিশনার,"
            "লিখিত নোটিশ দ্বারা, নিম্নবর্ণিত যেকোনো ব্যক্তিকে নোটিশে উল্লিখিত সময়ের মধ্যে"
            "বর্ণিত সরকারি কোষাগারে অর্থ জমাদান বা কর্তনপূর্বক অর্থ জমাদান করিবার নির্দেশ"
            "প্রদান করিতে পারিবেন এবং, ক্ষেত্রমত, অর্থ বা পরিসম্পদ স্থানান্তরের ক্ষেত্রে পরবর্তী"
            "করণীয় সম্পর্কে নির্দেশ প্রদান করিতে পারিবেন, যথা:-"
            "\n (ক) যাহার নিকট করদাতার কোনো অর্থ বা পণ্য পাওনা রহিয়াছে বা পাওনা"
            "হইতে পারে;"
            "\n  (খ) যিনি করদাতার মালিকানাধীন অর্থ বা পণ্য ধারণ বা গ্রহণ বা নিষ্পত্তি"
            "নিয়ন্ত্রণ করেন বা পরবর্তীকালে ধারণ বা গ্রহণ বা নিষ্পত্তি নিয়ন্ত্রণ করিতে পারিবেন;"
            "\n(গ) যিনি করদাতার পক্ষে করদাতার কোনো পরিসম্পদ, তাহা যেই প্রকারের"
            "হউক না কেন, ধারণ করেন বা তত্ত¡াবধান বা পরিচালনা করেন;"
            "\n (ঘ) যিনি কোনো অনিবাসী করদাতার এজেন্ট হিসাবে অনিবাসী পক্ষে কোনো"
            "পরিসম্পদ বা পণ্য ধারণ বা গ্রহণ বা নিষ্পত্তি নিয়ন্ত্রণ করেন বা"
            "পরবর্তীকালে ধারণ বা গ্রহণ বা নিষ্পত্তি নিয়šণ¿ করিতে পারেন;"
            "\n(ঙ) যিনি করদাতার চাকরি হইতে আয় খাতে যেকোনো পরিমাণ অর্থ পরিশোধের জন্য দায়িত্বপ্রাপ্ত; বা"
            "\n(চ) যিনি করদাতার “ভাড়া হইতে আয়” খাতে যেকোনো পরিমাণ অর্থ পরিশোধ করেন।\n (৪) কোনো ব্যক্তি উপ-ধারা (৩) এর বিধানমতে কোনো অর্থ পরিশোধ করিলে,"
            "এইরূপ পরিশোধ করদাতার নিয়ন্ত্রণাধীনে তাহার দ্বারা সম্পন্ন করা হইয়াছে এবং উপকর"
            "কমিশনার, উক্ত ব্যক্তির নিকট হইতে যেই পরিমাণ অর্থ গ্রহণ করিয়া রশিদ দিবেন করদাতার নিকট হইতে উক্ত ব্যক্তি সেই পরিমাণ দায় হইতে মুক্তি পাইবেন মর্মে গণ্ হইবে।"
            "\n(৫) যদি কোনো ব্যক্তি উপ-ধারা (৩) এর অধীন নোটিশ পাওয়া সত্তে¡ও নোটিশ"
            "অনুসারে অর্থ পরিশোধে বা কর্তনে ব্যর্থ হন, তবে নোটিশে বর্ণিত অর্থের জন্য তাহাকে"
            "খেলাপি করদাতা হিসাবে গণ্য করা হইবে এবং অর্থ আদায়ের জন্য তাহার বিরুদ্ধে"
            "এইরূপ আইনগত ব্যবস্থা গ্রহণ করা যাইতে পারে যাহাতে বকেয়া কর তাহার নিকট"
            "পাওনা এবং এইক্ষেত্রে এই অধ্যায়ের বিধানাবলি সমভাবে প্রযোজ্য হইবে।\n(৬) উপকর কমিশনার যেকোনো সময় উপ-ধারা (৩) এর অধীন ইস্যকু ত ৃ নোটিশ সংশোধন বা প্রত্যাহার করিতে পারিবেন অথবা এইরূপ নোটিশ অনুসারে যেকোনো অর্থ পরিশোধের সময় বৃদ্ধি করিতে পারিবেন।\n (৭) উপকর কমিশনার বকেয়া কর আদায়ের লক্ষ্যে করদাতার গ্যাস, বিদ্যুৎ,"
            "পানি, বা অন্যান্য সেবার সংযোগ বিচ্ছিন্ন বা বন্ধ করিবার জন্য সরবরাহের দায়িত্বপ্রাপ্ত"
            "ব্যক্তিকে নোটিশের মাধ্যমে নির্দেশ দিবেন এবং গ্যাস, বিদ্যুৎ, পানি, বা অন্যান্য সেবা"
            "সরবরাহের দায়িত্ব প্রাপ্ত ব্যক্তি এই ধারার অধীন নোটিশ প্রাপ্তির ২১ (একুশ) দিনের মধ্যে উক্ত সেবাসমূহের সংযোগ বিচ্ছিন্ন বা বন্ধ করিয়া দিবেন।\n(৮) কোনো ব্যক্তি উপ-ধারা (৬) এর অধীন প্রাপ্ত নোটিশ পরিপালনে ব্যর্থ হইলে উক্ত ব্যক্তি নিজে খেলাপি করদাতা হিসাবে গণ্য হইবেন এবং বকেয়া করদাবি পরিশোধের জন্য ব্যক্তিগতভাবে দায়ী হইবেন।\n (৯) যেইক্ষেত্রে কোনো ব্যক্তি উপ-ধারা (৭) এর অধীন প্রাপ্ত নোটিশ পরিপালন করিয়া কোনো গ্যাস, বিদ্যুৎ, পানি, বা অন্যান্য সেবার সংযোগ বিচ্ছিন্ন বা বন্ধ করিয়াছেন সেইক্ষেত্রে উপকর কমিশনারের নিকট হইতে অনুমতি প্রাপ্তির পর উক্তরূপ সেবার সংযোগ পুনর্বহাল করিবেন।\n(১০) যেইক্ষেত্রে কমিশনার নির্দেশ প্রদান করেন যে, উক্ত এলাকায় বলবৎযোগ্য বকেয়া পৌর কর আদায় বা বাংলাদেশের যেকোনো অংশে প্রযোজ্য আইন অনুসারে ধার্যকৃত স্থানীয় কর অথবা বাংলাদেশে বলবৎ অন্যান্য আইনে কর আদায়ের জন্য যেই প্রক্রিয়া অবলম্বন করা হয়, সেই প্রক্রিয়ায় কর আদায় করিতে হইবে এবং সেইক্ষেত্রে উপকর কমিশনার বকেয়া অর্থ আদায়ের জন্য এইরূপ একই প্রক্রিয়ায় অগ্রসর হইবেন।\n"
            "(১১) উপ-ধারা (১০) এর আওতায় পৌর কর, স্থানীয় কর বা অন্যান্য কর আদায় করিবার জন্য কোনো বিধিবদ্ধ আইনের আওতায় প্রয়োগযোগ্য কোনো পদ্ধতির মাধ্যমে বা মলূ ্য সংযোজন কর ও সম্পূরক শুল্ক আইন, ২০১২ (২০১২ সনের ৪৭ নং আইন), ঈঁংঃড়সং অপঃ, ১৯৬৯ (অপঃ ঘড়. ওঠ ড়ভ ১৯৬৯) এর কর আদায় করিবার জন্য প্রয়োগযোগ্য কোনো পদ্ধতির মাধ্যমে কোনো কৰ্তৃপক্ষ কর্তৃক কী ধরনের ক্ষমতা ও কর্তব্য কী পরিমাণে অনুশীলন করা হইবে, তাহা কমিশনার কর্তৃক নির্ধারণ করিয়াদেওয়া থাকিবে।",
            style: TextStyle(fontSize: 15),
          )
        ],
      ),
    );
  }
}
