import 'package:flutter/material.dart';

class dhara_83 extends StatefulWidget {
  const dhara_83({super.key});

  @override
  State<dhara_83> createState() => _dhara_83State();
}

class _dhara_83State extends State<dhara_83> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "সহযোগী সত্তার সহিত লেনদেন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো অনুমোদিত কর অবকাশপ্রাপ্ত সত্তা ইহার অন্য কোনো সহযোগী সত্তার সহিত লেনদেনে জড়িত থাকে এবং যদি উপকর কমিশনার এই মর্মে সন্তুষ্ট হন যে,\n (ক) 	লেনদেন উন্মুক্ত বাজার মূল্যে হয় নাই; এবং\n(খ)	এই ধরনের লেনদেনের ফলে কোনো আয়বর্ষে কোনো সহযোগী সত্তার আয় প্রকৃত আয় আপেক্ষা কম হইয়াছে, সেইক্ষেত্রে সহযোগী সত্তাটির জন্য যে পরিমাণে আয় কম পরিগণনা করা হইয়াছে তাহা অনুমোদিত কর অবকাশপ্রাপ্ত সত্তাটির আয় হিসাবে বিবেচিত হইবে এবং তাহা উক্ত আয়বর্ষের জন্য অন্যান্য উৎস হইতে আয় খাতে শ্রেণিভুক্ত হইবে।\n (২) 	এই ধারার উদ্দেশ্যপূরণকল্পে,-\n (ক)	কোনো সত্তা অনুমোদিত কর অবকাশপ্রাপ্ত সত্তার সহযোগী সত্তা হিসাবে বিবেচিত হইবে, যদি-\n(অ) 	কোনো সত্তা সরাসরি বা পরোক্ষভাবে, বা এক কিংবা একাধিক মধ্যস্থতাকারীর মাধ্যমে, অন্য কোনো সত্তার ব্যবস্থাপনা বা নিয়ন্ত্রণ বা মূলধনে অংশগ্রহণ করে; অথবা\n(আ) 	একই ব্যক্তি বা ব্যক্তিবর্গ, দম্পতি ও বংশধরসহ, উভয় সত্তার ব্যবস্থাপনা বা নিয়ন্ত্রণ বা মূলধনে, সরাসরি বা পরোক্ষভাবে, বা এক বা একাধিক মধ্যস্থতাকারীদের মাধ্যমে অংশগ্রহণ করে; অথবা\n(ই)	কোনো সত্তা প্রত্যক্ষভাবে বা পরোক্ষভাবে, অন্য কোনো সত্তার ভোটিং ক্ষমতার ২৫% (পঁচিশ শতাংশ) এর অধিক বহনকারী শেয়ার নিয়ন্ত্রণ করে; অথবা\n(ঈ) 	একই ব্যক্তি বা ব্যক্তিবর্গ, দম্পতি বা বংশধরসহ, উভয় সত্তায় ভোটিং ক্ষমতার ২৫% (পঁচিশ শতাংশ) এর অধিক বহনকারী শেয়ার নিয়ন্ত্রণ করে; অথবা\n (উ)	দুইটি সত্তা একই গ্রæপের সদস্য হয়।\n(খ)	উন্মুক্ত বাজার মূল্য অর্থ মুক্ত বাজারে সম্পর্কহীন (দুইটি পক্ষের মধ্যে সম্মত মূল্য ;\n(গ)	সত্তা শব্দ অর্থে কোনো ব্যক্তি অন্তর্ভুক্ত হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
