import 'package:flutter/material.dart';

class dhara_82 extends StatefulWidget {
  const dhara_82({super.key});

  @override
  State<dhara_82> createState() => _dhara_82State();
}

class _dhara_82State extends State<dhara_82> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "বোর্ড কর্তৃক কর অবকাশপ্রাপ্ত সত্তা অনুমোদন",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কর অবকাশ সুবিধা প্রাপ্তির জন্য কোনো ব্যবসায়িক সত্তাকে ইহার বাণিজ্যিক কার্যক্রম শুরু হইবার মাসের মধ্যে, বোর্ড কর্তৃক নির্ধারিত পদ্ধতিতে, আবেদন দাখিল করিতে হইবে।\n(২) আবেদন প্রাপ্তির তারিখ হইতে ৬০ (ষাট) দিনের মধ্যে, বোর্ড, লিখিত আদেশ দ্বারা, উপ-ধারা (১) এর অধীন দাখিলকৃত আবেদনের উপর সিদ্ধান্ত প্রদান করিবে।\n(৩) বোর্ড উপ-ধারা (২) এ উল্লিখিত সময়সীমার মধ্যে সিদ্ধান্ত প্রদান করিতে ব্যর্থ হইলে, কর অবকাশ প্রাপ্তির আবেদনটি অস্থায়ীভাবে মঞ্জুর করা হইয়াছে বলিয়া গণ্য হইবে এবং, উক্ত বিষয়ে বোর্ড সিদ্ধান্ত প্রদান না করা পর্যন্ত উক্ত ব্যবসায়িক সত্তাকে কর অবকাশপ্রাপ্ত সত্তা হিসাবে গণ্য করা হইবে।\n(৪) আবেদনকারীকে যুক্তিসঙ্গতভাবে শুনানির সুযোগ প্রদান না করিয়া বোর্ড কোনো আবেদন বাতিল করিবে না।\n(৫) উপ-ধারা (৩) এর অধীন বোর্ড কর্তৃক প্রদত্ত সিদ্ধান্তে কোনো আবেদনকারী সংক্ষুব্ধ হইলে, সিদ্ধান্ত প্রাপ্তির ৪ (চার) মাসের মধ্যে উক্ত আবেদনকারী বোর্ডের নিকট আবেদন করিতে পারিবেন এবং বোর্ড পূর্ববর্তী আদেশ পুনর্বিবেচনা করিতে পারিবে এবং তৎবিবেচনায় উপযুক্ত আদেশ জারি করিতে পারিবে।\n(৬) উপ-ধারা (১) এর বিধানকে ক্ষুণœ না করিয়া, কর অবকাশপ্রাপ্ত সত্তার কর পরিপালন নিশ্চিত করিবার উদ্দেশ্যে বোর্ড যেইরূপ উপযুক্ত বিবেচনা করিবে সেইরূপে এই ধারার অধীন অনুমোদন মঞ্জুর ও পুনর্বিবেচনা বা যেকোনো বিষয়ে বিধি প্রণয়ন করিতে পারিবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
