import 'package:flutter/material.dart';

class dhara_230 extends StatefulWidget {
  const dhara_230({super.key});

  @override
  State<dhara_230> createState() => _dhara_230State();
}

class _dhara_230State extends State<dhara_230> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "এই অধ্যায়ের উদ্দেশ্যপূরণকল্পে, (১) “কর সুবিধা” অর্থে নিম্নবর্ণিত বিষয় অন্তভুক্ত হইবে, যথা:-র্ (ক) প্রত্যক্ষ বা পরোক্ষভাবে, আয়করদায় পরিহার বা হ্রাস করা; (খ) প্রত্যক্ষ বা পরোক্ষভাবে, কোনো ব্যক্তিকে আয়কর পরিশোধের দায় হইতে, অথবা ভবিষ্যৎ আয়করের সম্ভাব্য বা ভবিষ্যাপেক্ষ দায় হইতে মুক্ত করা; (গ) প্রত্যক্ষ বা পরোক্ষভাবে, কোনো করদায়, অথবা ভবিষ্যৎ আয়করের কোনো সম্ভাব্য বা ভবিষ্যাপেক্ষ দায় পরিহার, স্থগিত বা হ্রাসকরণ;\n(ঘ) আয়কর পরিশোধে বিলম্বকরণ;\n (ঙ) উৎসে কর কর্তন বা সংগ্রহ এবং সরকারি কোষাগারে উক্ত কর জমা প্রদানের বাধ্যবাধকতা পরিহার;\n(২) “ব্যবস্থা” অর্থ বলবৎযোগ্য বা অবলবৎযোগ্য কোনো সম্মতি, চুক্তি, পরিকল্পনা বা সমঝোতা এবং উক্ত সকল পদক্ষেপ ও লেনদেন যাহার মাধ্যমে তাহা কার্যকর হয়;\n (৩) “কর ব্যব¯া’ র অপব্যবহার” অর্থ কোনো ব্যবস্থা, যাহার দ্বারা প্রভাবিত ব্যক্তি বা অন্য কোনো ব্যক্তি যাহার মাধ্যমে সম্পাদিত হউক না কেন - (ক) যাহা, এই ধারার অনুপস্থিতিতে, প্রত্যক্ষ বা পরোক্ষভাবে এক বা একাধিক কর সুবিধা সৃষ্টি করে যদি না উক্ত ব্যবস্থা যুক্তিসঙ্গতভাবে কোনো কর সুবিধা অর্জনের উদ্দেশ্য ব্যতীত অন্য কোনো সরল উদ্দেশ্যে (bonafide purpose) গৃহীত বা সৃজিত হয়; বা \n(খ) যাহা, একাধিক ব্যব¯া’ র একটি অংশ এবং উক্ত একাধিক ব্যবস্থা, এই ধারার অনুপস্থিতিতে, প্রত্যক্ষ বা পরোক্ষভাবে এক বা একাধিক কর সুবিধা সৃষ্টি করে যদি না উক্ত একাধিক ব্যবস্থা যুক্তিসঙ্গতভাবে কোনো কর সুবিধা অর্জনের উদ্দশ্যে ব্যতীত অন্য কোনো উদ্দেশ্যে গৃহীত বা সৃজিত হয়।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
