import 'package:flutter/material.dart';

class dhara_232 extends StatefulWidget {
  const dhara_232({super.key});

  @override
  State<dhara_232> createState() => _dhara_232State();
}

class _dhara_232State extends State<dhara_232> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                " সমন্বয়ের পদ্ধতি",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) কর সুবিধার বিরুদ্ধে ব্যবস্থা গ্রহণের নিমিত্ত, উপকর কমিশনার নিম্নবর্ণিত বিষয় উল্লেখপূর্বক করদাতার প্রতি নোটিশ জারি করিবেন,  যথা :-(ক) করদাতা কর ব্যবস্থার অব্যবহারের মাধ্যমে কর সুবিধা গ্রহণ করিয়াছেন মর্মে উপকর কমিশনারের বিশ্বাস করিবার কারণ;\n (খ) প্রযোজ্য ক্ষেত্রে, সমন্বয়ের উদ্দেশ্য উল্লেখসহ যে সকল ব্যবস্থা গ্রহণ করিতে ইচ্ছুক তাহার বিবরণ; \n(গ) করদাতাকে নোটিশে উল্লিখিত তারিখে উপকর কমিশনারের নিকট হাজির হইবার; \n(ঘ) কর সুবিধা গ্রহণের বিষয়ে সিদ্ধান্ত প্রদানের জন্য প্রয়োজনীয় বিবরণী, দলিলাদি ও তথ্যাদি উপস্থাপনের।\n(২) কর সুবিধা সমন্বয়ের করদাতাকে শুনানির সুযোগ প্রদান করিতে হইবে এবং করদাতার উপর উক্ত শুনানির জারীকৃত নোটিশ অবহিতকরণের তারিখ হইতে শুনানির দিন পর্যন্ত অন্যূন ৩০ (ত্রিশ) দিন সময় প্রদান করিতে হইবে। \n(৩) উপকর কমিশনার রেকডর্, করদাতা কর্তৃক দাখিলকৃত ও শুনানিকালে উপস্থাপিত দলিলাদির ভিত্তিতে তাহার নিকট উপস্থাপিত সকল তথ্যাদি বিবেচনাপূর্বক কর কমিশনারের পূর্বানুমোদন সাপেক্ষে সমন্বয়ের আদেশ প্রদান করিবেন এবং আদেশ প্রদানের তারিখ হইতে ৩০ (ত্রিশ) দিনের মধ্যে উহা করদাতাকে অবহিত করিবেন।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
