import 'package:flutter/material.dart';

class dhara_162 extends StatefulWidget {
  const dhara_162({super.key});

  @override
  State<dhara_162> createState() => _dhara_162State();
}

class _dhara_162State extends State<dhara_162> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xff021e17),
        actions: [IconButton(onPressed: () {}, icon: const Icon(Icons.search))],
      ),
      body: Container(
          padding: const EdgeInsets.all(25),
          child: Column(
            children: const [
              Text(
                "অগ্রিম কর পরিশোধের ক্ষেত্রে ঘাটতি থাকিলে উহার উপর করদাতা কর্তৃক সুদ প্রদেয়।",
                style: TextStyle(fontSize: 25),
              ),
              SizedBox(height: 10),
              Text(
                "(১) যেইক্ষেত্রে কোনো অর্থবর্ষে করদাতা স্বীয় প্রাক্কলনের ভিত্তিতে অগ্রিম কর পরিশোধ করেন এবং এই অংশের অধীন উৎসে কর কর্তন করা হয়, উক্ত কর্তনকৃত কর এবং উক্তরূপ অগ্রিম পরিশোধকৃত করের সমষ্টি যদি নিয়মিত কর নির্ধারণের মাধ্যমে নিরূপিত পরিশোধযোগ্য করের ৭৫% (পঁচাত্তর শতাংশ) আপেক্ষা কম হয়, তবে সেইক্ষেত্রে করদাতা পরিশোধযোগ্য অবশিষ্ট করের অতিরিক্ত পরিশোধকৃত মোট কর এবং নিয়মিত নির্ধারণীর মাধ্যমে উদ্ভূত করের ৭৫% (পঁচাত্তর শতাংশ) এর মধ্যে যে পার্থক্য হইবে তাহার উপর বার্ষিক ১০% (দশ শতাংশ) হারে সরল সুদ প্রদান করিবেন: তবে শর্ত থাকে যে, করদিবসের তারিখে বা ইহার পূর্বে রিটার্ন দাখিল করা না হইলে, সুদের হার ৫০% (পঞ্চাশ শতাংশ) অধিক হইবে।\n (২) উপ-ধারা (১) এর অধীন অতিরিক্ত অগ্রিম কর পরিশোধের উপর সংশ্লিষ্ট কর নির্ধারণী বর্ষে জুলাই মাসের প্রথম দিন হইতে উক্ত বৎসর নিয়মিত কর নির্ধারণের তারিখ পর্যন্ত, বা ১ জুলাই হইতে পরবর্তী ২ (দুই) বৎসর মেয়াদ পর্যন্ত, এই দুইয়ের মধ্যে যাহা কম, সময়ের জন্য সুদ পরিশোধ করিতে হইবে।\n(৩) উপ-ধারা (১) ও (২) এ যাহা কিছুই থাকুক না কেন, যেইক্ষেত্রে\n(ক)	ধারা ১৭৩ এর অধীন কর পরিশোধ করা হয়; বা\n (খ) 	ধারা ১৮৫ এর অধীন সাময়িক কর নির্ধারণ করা হইয়াছে কিন্তু নিয়মিত কর নির্ধারণ করা হয় নাই, সেইক্ষেত্রে নিম্নবর্ণিত বিধান অনুসারে সরল সুদ হিসাব করিতে হইবে, যথা:-\n (অ) 	যেই তারিখে ধারা ১৭৩ এর অধীন বা সাময়িকভাবে নির্ধারিত কর পরিশোধ করা হইয়াছে, সেই তারিখ পর্যন্ত;\n (আ) 	অতঃপর, নির্ধারণকৃত ৭৫% (পঁচাত্তর শতাংশ) কর অপেক্ষা উক্তরূপে পরিশোধকৃত কর যেই পরিমাণ ঘাটতি হইয়াছে, তাহার উপর সরল সুদ পরিগণনা করিতে হইবে।\n  (৪) যেইক্ষেত্রে আপিল, রিভিশন বা রেফারন্সের ফলশ্রæতিতে উপ-ধারা (১) এর অধীন যেই পরিমাণ অর্থের উপর সুদ প্রদেয় ছিল তাহা হ্রাস প্রাপ্ত হইয়াছে, সেইক্ষেত্রে একইভাবে প্রদেয় সুদের পরিমাণ ও হ্রাস প্রাপ্ত হইবে এবং কোনো অতিরিক্ত সুদ পরিশোধিত হইয়া থাকিলে, তাহা ফেরতযোগ্য করের সহিত ফেরত প্রদান করিতে হইবে।\n  (৫) এই ধারার উদ্দেশ্যপূরণকল্পে, “নিয়মিত কর নির্ধারণ অর্থে সংশোধিত রিটার্ন গ্রহণ বা ধারা ১৮১ এর অধীন অডিটের প্রেক্ষিতে প্রণীত কর নির্ধারণও অন্তর্ভুক্ত হইবে।",
                style: TextStyle(fontSize: 15),
              )
            ],
          )),
    );
  }
}
